cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<!-- edited with XMLSpy v2017 rel. 3 (http://www.altova.com) by Infineon Technologies (Infineon Technologies AG) -->
<!--Version of used XSLT processor: 2.0 Altova GmbH http://www.altova.com-->
<!--Version of used XSLT: ISFR2SVD.xslt  V0.10-->
<!--Configuration of XSLT: with bit extraction =Yes;  with bit coding =Yes; decodeThe3knownBitAccessTypes = Yes; 0,r and 1,r bit extraction = No-->
<!--Version of used XSLT for fixing SVD issues: SVD_fixes.xslt  V1.4-->
<device xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="1.1" xs:noNamespaceSchemaLocation="c:\fm8_xml\XSLT\RD2ISFR\CMSIS-SVD_Schema_1_1.xsd">
	<name>TLE985x</name>
	<version>1.0</version>
	<description>SVD file</description>
	<vendor>Infineon Technologies AG</vendor>
	<vendorID>Infineon</vendorID>
	<licenseText>tbd</licenseText>
	<cpu>
		<name>CM0</name>
		<revision>r0p0</revision>
		<endian>little</endian>
		<mpuPresent>false</mpuPresent>
		<fpuPresent>false</fpuPresent>
		<nvicPrioBits>2</nvicPrioBits>
		<vendorSystickConfig>false</vendorSystickConfig>
	</cpu>
	<addressUnitBits>8</addressUnitBits>
	<width>32</width>
	<peripherals>
		<peripheral>
			<name>ADC1</name>
			<description>ADC1</description>
			<baseAddress>0x40004000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x4000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>INTISR3</name>
				<description>Interrupt node 3: ADC1</description>
				<value>3</value>
			</interrupt>
			<interrupt>
				<name>INTISR21</name>
				<description>Interrupt node 21: Differential Unit</description>
				<value>21</value>
			</interrupt>
			<registers>
				<register>
					<name>CAL_CH0_1</name>
					<description>Calibration for Channel 0 and 1</description>
					<addressOffset>0x48</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>CALGAIN_CH1</name>
							<description>Gain Calibration for channel 1</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CALOFFS_CH1</name>
							<description>Offset Calibration for channel 1</description>
							<lsb>16</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CALGAIN_CH0</name>
							<description>Gain Calibration for channel 0</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CALOFFS_CH0</name>
							<description>Offset Calibration for channel 0</description>
							<lsb>0</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CAL_CH10_11</name>
					<description>Calibration for Channel 10 and 11</description>
					<addressOffset>0x5C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>CALGAIN_CH11</name>
							<description>Gain Calibration for channel 11</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CALOFFS_CH11</name>
							<description>Offset Calibration for channel 11</description>
							<lsb>16</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CALGAIN_CH10</name>
							<description>Gain Calibration for channel 10</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CALOFFS_CH10</name>
							<description>Offset Calibration for channel 10</description>
							<lsb>0</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CAL_CH12_13</name>
					<description>Calibration for Channel 12 and 13</description>
					<addressOffset>0x138</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>CALGAIN_CH13</name>
							<description>Gain Calibration for channel 13</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CALOFFS_CH13</name>
							<description>Offset Calibration for channel 13</description>
							<lsb>16</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CALGAIN_CH12</name>
							<description>Gain Calibration for channel 12</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CALOFFS_CH12</name>
							<description>Offset Calibration for channel 12</description>
							<lsb>0</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CAL_CH2_3</name>
					<description>Calibration for Channel 2 and 3</description>
					<addressOffset>0x4C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>CALGAIN_CH3</name>
							<description>Gain Calibration for channel 3</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CALOFFS_CH3</name>
							<description>Offset Calibration for channel 3</description>
							<lsb>16</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CALGAIN_CH2</name>
							<description>Gain Calibration for channel 2</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CALOFFS_CH2</name>
							<description>Offset Calibration for channel 2</description>
							<lsb>0</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CAL_CH4_5</name>
					<description>Calibration for Channel 4 and 5</description>
					<addressOffset>0x50</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>CALGAIN_CH5</name>
							<description>Gain Calibration for channel 5</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CALOFFS_CH5</name>
							<description>Offset Calibration for channel 5</description>
							<lsb>16</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CALGAIN_CH4</name>
							<description>Gain Calibration for channel 4</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CALOFFS_CH4</name>
							<description>Offset Calibration for channel 4</description>
							<lsb>0</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CAL_CH6_7</name>
					<description>Calibration for Channel 6 and 7</description>
					<addressOffset>0x54</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>CALGAIN_CH7</name>
							<description>Gain Calibration for channel 7</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CALOFFS_CH7</name>
							<description>Offset Calibration for channel 7</description>
							<lsb>16</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CALGAIN_CH6</name>
							<description>Gain Calibration for channel 6</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CALOFFS_CH6</name>
							<description>Offset Calibration for channel 6</description>
							<lsb>0</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CAL_CH8_9</name>
					<description>Calibration for Channel 8 and 9</description>
					<addressOffset>0x58</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>CALGAIN_CH9</name>
							<description>Gain Calibration for channel 9</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CALOFFS_CH9</name>
							<description>Offset Calibration for channel 9</description>
							<lsb>16</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CALGAIN_CH8</name>
							<description>Gain Calibration for channel 8</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CALOFFS_CH8</name>
							<description>Offset Calibration for channel 8</description>
							<lsb>0</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CHx_EIM</name>
					<description>Channel Setting Bits for Exceptional Interrupt Measurement</description>
					<addressOffset>0x08</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>ADC1_EIM_TRIG_SEL</name>
							<description>Trigger selection for exceptional interrupt measurement (EIM)</description>
							<lsb>16</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NONE</name>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUT63</name>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPT12_T6OUT</name>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPT12_T3OUT</name>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T2</name>
									<description>t2_adc_trigger</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T21</name>
									<description>t21_adc_trigger</description>
									<value>0b101</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EIM_EN</name>
							<description>Exceptional interrupt measurement (EIM) Trigger Event enable</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>start of EIM disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>start of IEM enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EIM_REP</name>
							<description>Repeat count for exceptional interrupt measurement (EIM)</description>
							<lsb>8</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1</name>
									<description>Measurements (1 SOC generated for ADC10)</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2</name>
									<description>Measurements (2 SOC generated for ADC10)</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4</name>
									<description>Measurements (4 SOC generated for ADC10)</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8</name>
									<description>Measurements (8 SOC generated for ADC10)</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16</name>
									<description>Measurements (16 SOC generated for ADC10)</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>32</name>
									<description>Measurements (32 SOC generated for ADC10)</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>64</name>
									<description>Measurements (64 SOC generated for ADC10)</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>128</name>
									<description>Measurements (128 SOC generated for ADC10)</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EIM_CHx</name>
							<description>Channel set for exceptional interrupt measurement (EIM)</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CH0_EN</name>
									<description>Channel 0 enable</description>
									<value>0b0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH1_EN</name>
									<description>Channel 1 enable</description>
									<value>0b0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH2_EN</name>
									<description>Channel 2 enable</description>
									<value>0b0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH3_EN</name>
									<description>Channel 3 enable</description>
									<value>0b0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH4_EN</name>
									<description>Channel 4 enable</description>
									<value>0b0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH5_EN</name>
									<description>Channel 5 enable</description>
									<value>0b0101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH6_EN</name>
									<description>Channel 6 enable</description>
									<value>0b0110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH7_EN</name>
									<description>Channel 7 enable</description>
									<value>0b0111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH8_EN</name>
									<description>Channel 8 enable</description>
									<value>0b1000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH9_EN</name>
									<description>Channel 9 enable</description>
									<value>0b1001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH12_EN</name>
									<description>Channel 12 enable</description>
									<value>0b1100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH13_EN</name>
									<description>Channel 13 enable</description>
									<value>0b1101</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CHx_ESM</name>
					<description>Channel Setting Bits for Exceptional Sequence Measurement</description>
					<addressOffset>0x0C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>ESM_STS</name>
							<description>Exceptional Sequence Measurement is finished</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not active</name>
									<description>Exceptional Sequence Measurement not done</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>done</name>
									<description>Exceptional Sequence Measurement done</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ESM_EN</name>
							<description>Enable for Exceptional Sequence Measurement Trigger Event</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>start of ESM disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>start of ESM enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADC1_ESM_TRIG_SEL</name>
							<description>Trigger selection for exceptional interrupt measurement (ESM)</description>
							<lsb>16</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NONE</name>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUT63</name>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPT12_T6OUT</name>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPT12_T3OUT</name>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T2</name>
									<description>t2_adc_trigger</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T21</name>
									<description>t21_adc_trigger</description>
									<value>0b101</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ESM_0</name>
							<description>Channel Sequence for Exceptional Sequence Measurement (ESM)</description>
							<lsb>0</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CH0_EN</name>
									<description>Channel 0 enable</description>
									<value>0x0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH1_EN</name>
									<description>Channel 1 enable</description>
									<value>0x0002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH2_EN</name>
									<description>Channel 2 enable</description>
									<value>0x0004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH3_EN</name>
									<description>Channel 3 enable</description>
									<value>0x0008</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH4_EN</name>
									<description>Channel 4 enable</description>
									<value>0x0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH5_EN</name>
									<description>Channel 5 enable</description>
									<value>0x0020</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH6_EN</name>
									<description>Channel 6 enable</description>
									<value>0x0040</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH7_EN</name>
									<description>Channel 7 enable</description>
									<value>0x0080</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH8_EN</name>
									<description>Channel 8 enable</description>
									<value>0x0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH9_EN</name>
									<description>Channel 9 enable</description>
									<value>0x0200</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH10_EN</name>
									<description>Channel 10 enable</description>
									<value>0x0400</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH11_EN</name>
									<description>Channel 11 enable</description>
									<value>0x0800</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH12_EN</name>
									<description>Channel 12 enable</description>
									<value>0x1000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH13_EN</name>
									<description>Channel 13 enable</description>
									<value>0x2000</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
