cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
				<register>
					<name>CNT4_7_UPPER</name>
					<description>Upper Counter Trigger Level Post-Processing-Channel 4-7</description>
					<addressOffset>0xEC</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>HYST_UP_PP7</name>
							<description>Post-Processing-Channel 7 upper hysteresis</description>
							<lsb>27</lsb>
							<msb>28</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>HYSTOFF</name>
									<description>hysteresis switched off</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST4</name>
									<description>hysteresis = 4</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST8</name>
									<description>hysteresis = 8</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST16</name>
									<description>hysteresis = 16</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CNT_UP_PP7</name>
							<description>Upper timer trigger threshold Post-Processing-Channel 7</description>
							<lsb>24</lsb>
							<msb>25</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1</name>
									<description>1 measurement</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2</name>
									<description>2 measurements</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4</name>
									<description>4 measurements</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>7</name>
									<description>7 measurements</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HYST_UP_PP6</name>
							<description>Post-Processing-Channel 6 upper hysteresis</description>
							<lsb>19</lsb>
							<msb>20</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>HYSTOFF</name>
									<description>hysteresis switched off</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST4</name>
									<description>hysteresis = 4</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST8</name>
									<description>hysteresis = 8</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST16</name>
									<description>hysteresis = 16</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CNT_UP_PP6</name>
							<description>Upper timer trigger threshold Post-Processing-Channel 6</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1</name>
									<description>1 measurement</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2</name>
									<description>2 measurements</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4</name>
									<description>4 measurements</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>7</name>
									<description>7 measurements</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HYST_UP_PP5</name>
							<description>Post-Processing-Channel 5 upper hysteresis</description>
							<lsb>11</lsb>
							<msb>12</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>HYSTOFF</name>
									<description>hysteresis switched off</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST4</name>
									<description>hysteresis = 4</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST8</name>
									<description>hysteresis = 8</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST16</name>
									<description>hysteresis = 16</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CNT_UP_PP5</name>
							<description>Upper timer trigger threshold Post-Processing-Channel 5</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1</name>
									<description>1 measurement</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2</name>
									<description>2 measurements</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4</name>
									<description>4 measurements</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>7</name>
									<description>7 measurements</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HYST_UP_PP4</name>
							<description>Post-Processing-Channel 4 upper hysteresis</description>
							<lsb>3</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>HYSTOFF</name>
									<description>hysteresis switched off</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST4</name>
									<description>hysteresis = 4</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST8</name>
									<description>hysteresis = 8</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST16</name>
									<description>hysteresis = 16</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CNT_UP_PP4</name>
							<description>Upper timer trigger threshold Post-Processing-Channel 4</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1</name>
									<description>1 measurement</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2</name>
									<description>2 measurements</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4</name>
									<description>4 measurements</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>7</name>
									<description>7 measurements</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CTRL2</name>
					<description>Measurement Unit 1 Control Register 2</description>
					<addressOffset>0x14</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>CAL_EN</name>
							<description>Calibration Enable for Channels 0 to 13</description>
							<lsb>0</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CH0_EN</name>
									<description>Channel 0 calibration enable</description>
									<value>0x0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH1_EN</name>
									<description>Channel 1 calibration enable</description>
									<value>0x0002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH2_EN</name>
									<description>Channel 2 calibration enable</description>
									<value>0x0004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH3_EN</name>
									<description>Channel 3 calibration enable</description>
									<value>0x0008</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH4_EN</name>
									<description>Channel 4 calibration enable</description>
									<value>0x0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH5_EN</name>
									<description>Channel 5 calibration enable</description>
									<value>0x0020</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH6_EN</name>
									<description>Channel 6 calibration enable</description>
									<value>0x0040</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH7_EN</name>
									<description>Channel 7 calibration enable</description>
									<value>0x0080</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH8_EN</name>
									<description>Channel 8 calibration enable</description>
									<value>0x0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH9_EN</name>
									<description>Channel 9 calibration enable</description>
									<value>0x0200</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH10_EN</name>
									<description>Channel 10 calibration enable</description>
									<value>0x0400</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH11_EN</name>
									<description>Channel 11 calibration enable</description>
									<value>0x0800</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH12_EN</name>
									<description>Channel 12 calibration enable</description>
									<value>0x1000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH13_EN</name>
									<description>Channel 13 calibration enable</description>
									<value>0x2000</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CTRL3</name>
					<description>Measurement Unit 1 Control Register 3</description>
					<addressOffset>0x18</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>SAMPLE_TIME_LVCH</name>
							<description>Sample time of ADC1</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ADCCLK4</name>
									<description>4 ADC_CLK clock periods</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCCLK6</name>
									<description>6 ADC_CLK clock periods</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCCLK8</name>
									<description>8 ADC_CLK clock periods(default)</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCCLK10</name>
									<description>10 ADC_CLK clock periods</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCCLK12</name>
									<description>12 ADC_CLK clock periods</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCCLK14</name>
									<description>14 ADC_CLK clock periods</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCCLK16</name>
									<description>16 ADC_CLK clock periods</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCCLK18</name>
									<description>18 ADC_CLK clock periods</description>
									<value>0x7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCCLK20</name>
									<description>20 ADC_CLK clock periods</description>
									<value>0x8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCCLK22</name>
									<description>22 ADC_CLK clock periods</description>
									<value>0x9</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SAMPLE_TIME_HVCH</name>
							<description>Sample time of ADC1</description>
							<lsb>8</lsb>
							<msb>12</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ADCCLK4</name>
									<description>4 ADC_CLK clock periods</description>
									<value>0x00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCCLK6</name>
									<description>6 ADC_CLK clock periods</description>
									<value>0x01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCCLK8</name>
									<description>8 ADC_CLK clock periods</description>
									<value>0x02</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCCLK10</name>
									<description>10 ADC_CLK clock periods</description>
									<value>0x03</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCCLK12</name>
									<description>12 ADC_CLK clock periods</description>
									<value>0x04</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCCLK14</name>
									<description>14 ADC_CLK clock periods</description>
									<value>0x05</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCCLK16</name>
									<description>16 ADC_CLK clock periods</description>
									<value>0x06</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCCLK18</name>
									<description>18 ADC_CLK clock periods</description>
									<value>0x07</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCCLK20</name>
									<description>20 ADC_CLK clock periods</description>
									<value>0x08</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCCLK22</name>
									<description>22 ADC_CLK clock periods</description>
									<value>0x09</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCCLK24</name>
									<description>24 ADC_CLK clock periods (default)</description>
									<value>0x0A</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCCLK26</name>
									<description>26 ADC_CLK clock periods</description>
									<value>0x0B</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCCLK28</name>
									<description>28 ADC_CLK clock periods</description>
									<value>0x0C</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCCLK30</name>
									<description>30 ADC_CLK clock periods</description>
									<value>0x0D</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCCLK32</name>
									<description>32 ADC_CLK clock periods</description>
									<value>0x0E</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCCLK34</name>
									<description>34 ADC_CLK clock periods</description>
									<value>0x0F</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCCLK36</name>
									<description>36 ADC_CLK clock periods</description>
									<value>0x10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCCLK38</name>
									<description>38 ADC_CLK clock periods</description>
									<value>0x11</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCCLK40</name>
									<description>40 ADC_CLK clock periods</description>
									<value>0x12</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCCLK42</name>
									<description>42 ADC_CLK clock periods</description>
									<value>0x13</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCCLK44</name>
									<description>44 ADC_CLK clock periods</description>
									<value>0x14</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCCLK46</name>
									<description>46 ADC_CLK clock periods</description>
									<value>0x15</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCCLK48</name>
									<description>48 ADC_CLK clock periods</description>
									<value>0x16</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCCLK50</name>
									<description>50 ADC_CLK clock periods</description>
									<value>0x17</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCCLK52</name>
									<description>52 ADC_CLK clock periods</description>
									<value>0x18</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCCLK54</name>
									<description>54 ADC_CLK clock periods</description>
									<value>0x19</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCCLK56</name>
									<description>56 ADC_CLK clock periods</description>
									<value>0x1A</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCCLK58</name>
									<description>58 ADC_CLK clock periods</description>
									<value>0x1B</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCCLK60</name>
									<description>60 ADC_CLK clock periods</description>
									<value>0x1C</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCCLK62</name>
									<description>62 ADC_CLK clock periods</description>
									<value>0x1D</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MCM_RDY</name>
							<description>Ready Signal for MCM after Power On or Reset</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>MCM Not Ready</name>
									<description>Measurement Core Module in startup phase</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MCM Ready</name>
									<description>Measurement Core Module start-up phase finished</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EoC_FAIL</name>
							<description>Fail of ADC End of Conversion Signal</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ADC EoC available</name>
									<description>End of Conversion Signal was sent properly by ADC</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADC EoC not available</name>
									<description>End of Conversion Signal was not sent properly by ADC</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EoC_FAIL_CLR</name>
							<description>Fail of ADC End of Conversion Signal Clear</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ADC EoC Fail not clear</name>
									<description>no clear of EoC_FAIL flag</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADC EoC Fail clear</name>
									<description>Clear of EoC_FAIL flag</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SW_MODE</name>
							<description>Flag to enter SW Mode</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Software Mode Disable</name>
									<description>Sequencer running</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Software Mode Enabled</name>
									<description>Sequencer stopped</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MCM_PD_N</name>
							<description>Power Down Signal for MCM</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>MCM Disabled</name>
									<description>Measurement Core Module Disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MCM Enabled</name>
									<description>Measurement Core Module Enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CTRL5</name>
					<description>Measurement Unit 1 Control Register 5</description>
					<addressOffset>0x1C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>FILT_OUT_SEL_13_0</name>
							<description>Output Filter Selection for Channels 0 to 13</description>
							<lsb>0</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
