cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
				<register>
					<name>CTRL_STS</name>
					<description>ADC1 Control and Status Register</description>
					<addressOffset>0x00</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>STRTUP_DIS</name>
							<description>DPP1 Startup Disable</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Startup Enable</name>
									<description>DPP1 Startup enabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Startup Disable</name>
									<description>DPP1 Startup disable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SW_CH_SEL</name>
							<description>Channel for software mode</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CH0_EN</name>
									<description>Channel 0 enable</description>
									<value>0b0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH1_EN</name>
									<description>Channel 1 enable</description>
									<value>0b0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH2_EN</name>
									<description>Channel 2 enable</description>
									<value>0b0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH3_EN</name>
									<description>Channel 3 enable</description>
									<value>0b0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH4_EN</name>
									<description>Channel 4 enable</description>
									<value>0b0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH5_EN</name>
									<description>Channel 5 enable</description>
									<value>0b0101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH6_EN</name>
									<description>Channel 6 enable</description>
									<value>0b0110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH7_EN</name>
									<description>Channel 7 enable</description>
									<value>0b0111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH8_EN</name>
									<description>Channel 8 enable</description>
									<value>0b1000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH9_EN</name>
									<description>Channel 9 enable</description>
									<value>0b1001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH12_EN</name>
									<description>Channel 12 enable</description>
									<value>0b1100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH13_EN</name>
									<description>Channel 13 enable</description>
									<value>0b1101</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EOC</name>
							<description>ADC1 End of Conversion (software mode)</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Pending</name>
									<description>conversion still running</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Finished</name>
									<description>conversion has finished</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAL_SIGN</name>
							<description>Output of Comparator to Steer Gain / Offset calibration</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>READY</name>
							<description>HVADC Ready bit</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not ready</name>
									<description>Module in power down or in init phase</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Ready</name>
									<description>set automatically 5 ADC clock cycles after module is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SOS</name>
							<description>ADC1 Start of Sampling/Conversion (software mode)</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>no conversion is started</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>conversion is started</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SOOC</name>
							<description>ADC1 Start of Offset Calibration (software mode)</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>no offset calibration is started</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>offset calibration is started</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PD_N</name>
							<description>ADC1 Power Down Signal</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>POWER DOWN</name>
									<description>ADC1 is powered down</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>ADC1 is switched on</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>DCHCNT1_4_LOWER</name>
					<description>Lower Counter Trigger Level DifferentialChannel 1</description>
					<addressOffset>0xE4</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>HYST_LO_DCH1</name>
							<description>Post-Processing-Channel 4 lower hysteresis</description>
							<lsb>3</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>HYSTOFF</name>
									<description>hysteresis switched off</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST4</name>
									<description>hysteresis = 4</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST8</name>
									<description>hysteresis = 8</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST16</name>
									<description>hysteresis = 16</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CNT_LO_DCH1</name>
							<description>Lower timer trigger threshold Post-Processing-Channel 4</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1</name>
									<description>1 measurement</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2</name>
									<description>2 measurements</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4</name>
									<description>4 measurements</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>7</name>
									<description>7 measurements</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>DCHCNT1_4_UPPER</name>
					<description>Upper Counter Trigger Level DifferentialChannel 1</description>
					<addressOffset>0xF4</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>HYST_UP_DCH1</name>
							<description>Post-Processing-Channel 4 upper hysteresis</description>
							<lsb>3</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>HYSTOFF</name>
									<description>hysteresis switched off</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST4</name>
									<description>hysteresis = 4</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST8</name>
									<description>hysteresis = 8</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST16</name>
									<description>hysteresis = 16</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CNT_UP_DCH1</name>
							<description>Upper timer trigger threshold Post-Processing-Channel 4</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1</name>
									<description>1 measurement</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2</name>
									<description>2 measurements</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4</name>
									<description>4 measurements</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>7</name>
									<description>7 measurements</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>DCHTH1_4_LOWER</name>
					<description>Lower Comparator Trigger Level Differential Channel 1</description>
					<addressOffset>0xC4</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>DCH1_LOW</name>
							<description>Differential Channel 1 lower trigger level</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DCHTH1_4_UPPER</name>
					<description>Upper Comparator Trigger Level Differential Channel 1</description>
					<addressOffset>0xD4</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>DCH1_UP</name>
							<description>Differential Channel 1 upper trigger level</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DIFFCH_OUT1</name>
					<description>ADC1 Differential Channel Output 1</description>
					<addressOffset>0xA0</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>DOF1</name>
							<description>Overrun Flag</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NO OVERRUN</name>
									<description>Result register not overwritten</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OVERRUN</name>
									<description>Result register overwritten</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DVF1</name>
							<description>Valid Flag</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT VALID</name>
									<description>No new valid data available</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VALID</name>
									<description>Result register contains valid data and has not yet been read</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DWFR1</name>
							<description>Wait for Read Mode</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>overwrite mode</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wait for read mode enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DCH1</name>
							<description>ADC differential output value 1</description>
							<lsb>0</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DUIN_SEL</name>
					<description>Measurement Unit 1 - Differential Unit Input Selection Register</description>
					<addressOffset>0xFC</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>DU1RES_NEG</name>
							<description>Differential Unit 1 result negative</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DU1 Result positive</name>
									<description>Differential Unit 1 result positive after calculation</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DU1 Result negative</name>
									<description>Differential Unit 1 result negative after calculation</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DU1_EN</name>
							<description>Differential Unit 1 enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DU1 disable</name>
									<description>Differential Unit 1 is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DU1 enable</name>
									<description>Differential Unit 1 is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>FILT_OUT0</name>
					<description>ADC1 or Filter Output Channel 0</description>
					<addressOffset>0x70</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>OF0</name>
							<description>Overrun Flag</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NO OVERRUN</name>
									<description>Result register not overwritten</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OVERRUN</name>
									<description>Result register overwritten</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VF0</name>
							<description>Valid Flag</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT VALID</name>
									<description>No new valid data available</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VALID</name>
									<description>Result register contains valid data and has not yet been read</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WFR0</name>
							<description>Wait for Read Mode</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>overwrite mode</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wait for read mode enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FILT_OUT_CH0</name>
							<description>ADC or filter output value channel 0</description>
							<lsb>0</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FILT_OUT1</name>
					<description>ADC1 or Filter Output Channel 1</description>
					<addressOffset>0x74</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>OF1</name>
							<description>Overrun Flag</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NO OVERRUN</name>
									<description>Result register not overwritten</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OVERRUN</name>
									<description>Result register overwritten</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VF1</name>
							<description>Valid Flag</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT VALID</name>
									<description>No new valid data available</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VALID</name>
									<description>Result register contains valid data and has not yet been read</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WFR1</name>
							<description>Wait for Read Mode</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>overwrite mode</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wait for read mode enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FILT_OUT_CH1</name>
							<description>ADC or filter output value channel 1</description>
							<lsb>0</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FILT_OUT10</name>
					<description>ADC1 or Filter Output Channel 10</description>
					<addressOffset>0x98</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>OF10</name>
							<description>Overrun Flag</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NO OVERRUN</name>
									<description>Result register not overwritten</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OVERRUN</name>
									<description>Result register overwritten</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VF10</name>
							<description>Valid Flag</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT VALID</name>
									<description>No new valid data available</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VALID</name>
									<description>Result register contains valid data and has not yet been read</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WFR10</name>
							<description>Wait for Read Mode</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>overwrite mode</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wait for read mode enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FILT_OUT_CH10</name>
							<description>ADC or filter output value channel 10</description>
							<lsb>0</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
