cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
				<register>
					<name>FILT_OUT11</name>
					<description>ADC1 or Filter Output Channel 11</description>
					<addressOffset>0x9C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>OF11</name>
							<description>Overrun Flag</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NO OVERRUN</name>
									<description>Result register not overwritten</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OVERRUN</name>
									<description>Result register overwritten</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VF11</name>
							<description>Valid Flag</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT VALID</name>
									<description>No new valid data available</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VALID</name>
									<description>Result register contains valid data and has not yet been read</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WFR11</name>
							<description>Wait for Read Mode</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>overwrite mode</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wait for read mode enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FILT_OUT_CH11</name>
							<description>ADC or filter output value channel 11</description>
							<lsb>0</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FILT_OUT12</name>
					<description>ADC1 or Filter Output Channel 12</description>
					<addressOffset>0x110</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>OF12</name>
							<description>Overrun Flag</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NO OVERRUN</name>
									<description>Result register not overwritten</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OVERRUN</name>
									<description>Result register overwritten</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VF12</name>
							<description>Valid Flag</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT VALID</name>
									<description>No new valid data available</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VALID</name>
									<description>Result register contains valid data and has not yet been read</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WFR12</name>
							<description>Wait for Read Mode</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>overwrite mode</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wait for read mode enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FILT_OUT_CH12</name>
							<description>ADC or filter output value channel 12</description>
							<lsb>0</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FILT_OUT13</name>
					<description>ADC1 or Filter Output Channel 13</description>
					<addressOffset>0x140</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>OF13</name>
							<description>Overrun Flag</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NO OVERRUN</name>
									<description>Result register not overwritten</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OVERRUN</name>
									<description>Result register overwritten</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VF13</name>
							<description>Valid Flag</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT VALID</name>
									<description>No new valid data available</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VALID</name>
									<description>Result register contains valid data and has not yet been read</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WFR13</name>
							<description>Wait for Read Mode</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>overwrite mode</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wait for read mode enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FILT_OUT_CH13</name>
							<description>ADC or filter output value channel 13</description>
							<lsb>0</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FILT_OUT2</name>
					<description>ADC1 or Filter Output Channel 2</description>
					<addressOffset>0x78</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>OF2</name>
							<description>Overrun Flag</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NO OVERRUN</name>
									<description>Result register not overwritten</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OVERRUN</name>
									<description>Result register overwritten</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VF2</name>
							<description>Valid Flag</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT VALID</name>
									<description>No new valid data available</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VALID</name>
									<description>Result register contains valid data and has not yet been read</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WFR2</name>
							<description>Wait for Read Mode</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>overwrite mode</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wait for read mode enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FILT_OUT_CH2</name>
							<description>ADC or filter output value channel 2</description>
							<lsb>0</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FILT_OUT3</name>
					<description>ADC1 or Filter Output Channel 3</description>
					<addressOffset>0x7C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>OF3</name>
							<description>Overrun Flag</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NO OVERRUN</name>
									<description>Result register not overwritten</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OVERRUN</name>
									<description>Result register overwritten</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VF3</name>
							<description>Valid Flag</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT VALID</name>
									<description>No new valid data available</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VALID</name>
									<description>Result register contains valid data and has not yet been read</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WFR3</name>
							<description>Wait for Read Mode</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>overwrite mode</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wait for read mode enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FILT_OUT_CH3</name>
							<description>ADC or filter output value channel 3</description>
							<lsb>0</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FILT_OUT4</name>
					<description>ADC1 or Filter Output Channel 4</description>
					<addressOffset>0x80</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>OF4</name>
							<description>Overrun Flag</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NO OVERRUN</name>
									<description>Result register not overwritten</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OVERRUN</name>
									<description>Result register overwritten</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VF4</name>
							<description>Valid Flag</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT VALID</name>
									<description>No new valid data available</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VALID</name>
									<description>Result register contains valid data and has not yet been read</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WFR4</name>
							<description>Wait for Read Mode</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>overwrite mode</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wait for read mode enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FILT_OUT_CH4</name>
							<description>ADC or filter output value channel 4</description>
							<lsb>0</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FILT_OUT5</name>
					<description>ADC1 or Filter Output Channel 5</description>
					<addressOffset>0x84</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>OF5</name>
							<description>Overrun Flag</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NO OVERRUN</name>
									<description>Result register not overwritten</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OVERRUN</name>
									<description>Result register overwritten</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VF5</name>
							<description>Valid Flag</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT VALID</name>
									<description>No new valid data available</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VALID</name>
									<description>Result register contains valid data and has not yet been read</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WFR5</name>
							<description>Wait for Read Mode</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>overwrite mode</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wait for read mode enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FILT_OUT_CH5</name>
							<description>ADC or filter output value channel 5</description>
							<lsb>0</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FILT_OUT6</name>
					<description>ADC1 or Filter Output Channel 6</description>
					<addressOffset>0x88</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>OF6</name>
							<description>Overrun Flag</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NO OVERRUN</name>
									<description>Result register not overwritten</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OVERRUN</name>
									<description>Result register overwritten</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VF6</name>
							<description>Valid Flag</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT VALID</name>
									<description>No new valid data available</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VALID</name>
									<description>Result register contains valid data and has not yet been read</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WFR6</name>
							<description>Wait for Read Mode</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>overwrite mode</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wait for read mode enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FILT_OUT_CH6</name>
							<description>ADC or filter output value channel 6</description>
							<lsb>0</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FILT_OUT7</name>
					<description>ADC1 or Filter Output Channel 7</description>
					<addressOffset>0x8C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>OF7</name>
							<description>Overrun Flag</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NO OVERRUN</name>
									<description>Result register not overwritten</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OVERRUN</name>
									<description>Result register overwritten</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VF7</name>
							<description>Valid Flag</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT VALID</name>
									<description>No new valid data available</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VALID</name>
									<description>Result register contains valid data and has not yet been read</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WFR7</name>
							<description>Wait for Read Mode</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>overwrite mode</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wait for read mode enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FILT_OUT_CH7</name>
							<description>ADC or filter output value channel 7</description>
							<lsb>0</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FILT_OUT8</name>
					<description>ADC1 or Filter Output Channel 8</description>
					<addressOffset>0x90</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>OF8</name>
							<description>Overrun Flag</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NO OVERRUN</name>
									<description>Result register not overwritten</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OVERRUN</name>
									<description>Result register overwritten</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VF8</name>
							<description>Valid Flag</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT VALID</name>
									<description>No new valid data available</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VALID</name>
									<description>Result register contains valid data and has not yet been read</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WFR8</name>
							<description>Wait for Read Mode</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>overwrite mode</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wait for read mode enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FILT_OUT_CH8</name>
							<description>ADC or filter output value channel 8</description>
							<lsb>0</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
