cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
				<register>
					<name>FILT_OUT9</name>
					<description>ADC1 or Filter Output Channel 9</description>
					<addressOffset>0x94</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>OF9</name>
							<description>Overrun Flag</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NO OVERRUN</name>
									<description>Result register not overwritten</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OVERRUN</name>
									<description>Result register overwritten</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VF9</name>
							<description>Valid Flag</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT VALID</name>
									<description>No new valid data available</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VALID</name>
									<description>Result register contains valid data and has not yet been read</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WFR9</name>
							<description>Wait for Read Mode</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>overwrite mode</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wait for read mode enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FILT_OUT_CH9</name>
							<description>ADC or filter output value channel 9</description>
							<lsb>0</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FILT_OUTEIM</name>
					<description>ADC1 or Filter Output of EIM</description>
					<addressOffset>0x120</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>OF_EIM</name>
							<description>Overrun Flag</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NO OVERRUN</name>
									<description>Result register not overwritten</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OVERRUN</name>
									<description>Result register overwritten</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VF_EIM</name>
							<description>Valid Flag</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT VALID</name>
									<description>No new valid data available</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VALID</name>
									<description>Result register contains valid data and has not yet been read</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WFR_EIM</name>
							<description>Wait for Read Mode</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>overwrite mode</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wait for read mode enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FILT_OUT_EIM</name>
							<description>ADC or filter output value for last EIM measurement</description>
							<lsb>0</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FILT_UPLO_CTRL</name>
					<description>Upper And Lower Threshold Filter Enable</description>
					<addressOffset>0xB0</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>FUL_PP_CH7_EN</name>
							<description>Upper and lower threshold IIR filter enable Post-Processing-Channel 7</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FUL_PP_CH6_EN</name>
							<description>Upper and lower threshold IIR filter enable Post-Processing-Channel 6</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FUL_PP_CH5_EN</name>
							<description>Upper and lower threshold IIR filter enable Post-Processing-Channel 5</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FUL_PP_CH4_EN</name>
							<description>Upper and lower threshold IIR filter enable Post-Processing-Channel 4</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FUL_PP_CH3_EN</name>
							<description>Upper and lower threshold IIR filter enable Post-Processing-Channel 3</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FUL_PP_CH2_EN</name>
							<description>Upper and lower threshold IIR filter enable Post-Processing-Channel 2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FUL_PP_CH1_EN</name>
							<description>Upper and lower threshold IIR filter enable Post-Processing-Channel 1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FUL_PP_CH0_EN</name>
							<description>Upper and lower threshold IIR filter enable Post-Processing-Channel 0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>FILTCOEFF0_13</name>
					<description>Filter Coefficients Measurement Unit Channel 0-13</description>
					<addressOffset>0x60</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>CH13</name>
							<description>Filter Coefficients ADC channel 13</description>
							<lsb>26</lsb>
							<msb>27</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1/2</name>
									<description>weight of current sample</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/4</name>
									<description>weight of current sample</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/8</name>
									<description>weight of current sample</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/16</name>
									<description>weight of current sample</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH12</name>
							<description>Filter Coefficients ADC channel 12</description>
							<lsb>24</lsb>
							<msb>25</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1/2</name>
									<description>weight of current sample</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/4</name>
									<description>weight of current sample</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/8</name>
									<description>weight of current sample</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/16</name>
									<description>weight of current sample</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH11</name>
							<description>Filter Coefficients ADC channel 11</description>
							<lsb>22</lsb>
							<msb>23</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1/2</name>
									<description>weight of current sample</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/4</name>
									<description>weight of current sample</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/8</name>
									<description>weight of current sample</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/16</name>
									<description>weight of current sample</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH10</name>
							<description>Filter Coefficients ADC channel 10</description>
							<lsb>20</lsb>
							<msb>21</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1/2</name>
									<description>weight of current sample</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/4</name>
									<description>weight of current sample</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/8</name>
									<description>weight of current sample</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/16</name>
									<description>weight of current sample</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH9</name>
							<description>Filter Coefficients ADC channel 9</description>
							<lsb>18</lsb>
							<msb>19</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1/2</name>
									<description>weight of current sample</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/4</name>
									<description>weight of current sample</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/8</name>
									<description>weight of current sample</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/16</name>
									<description>weight of current sample</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH8</name>
							<description>Filter Coefficients ADC channel 8</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1/2</name>
									<description>weight of current sample</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/4</name>
									<description>weight of current sample</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/8</name>
									<description>weight of current sample</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/16</name>
									<description>weight of current sample</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH7</name>
							<description>Filter Coefficients ADC channel 7</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1/2</name>
									<description>weight of current sample</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/4</name>
									<description>weight of current sample</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/8</name>
									<description>weight of current sample</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/16</name>
									<description>weight of current sample</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH6</name>
							<description>Filter Coefficients ADC channel 6</description>
							<lsb>12</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1/2</name>
									<description>weight of current sample</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/4</name>
									<description>weight of current sample</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/8</name>
									<description>weight of current sample</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/16</name>
									<description>weight of current sample</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH5</name>
							<description>Filter Coefficients ADC channel 5</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1/2</name>
									<description>weight of current sample</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/4</name>
									<description>weight of current sample</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/8</name>
									<description>weight of current sample</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/16</name>
									<description>weight of current sample</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH4</name>
							<description>Filter Coefficients ADC channel 4</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1/2</name>
									<description>weight of current sample</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/4</name>
									<description>weight of current sample</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/8</name>
									<description>weight of current sample</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/16</name>
									<description>weight of current sample</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH3</name>
							<description>Filter Coefficients ADC channel 3</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1/2</name>
									<description>weight of current sample</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/4</name>
									<description>weight of current sample</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/8</name>
									<description>weight of current sample</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/16</name>
									<description>weight of current sample</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH2</name>
							<description>Filter Coefficients ADC channel 2</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1/2</name>
									<description>weight of current sample</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/4</name>
									<description>weight of current sample</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/8</name>
									<description>weight of current sample</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/16</name>
									<description>weight of current sample</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH1</name>
							<description>Filter Coefficients ADC channel 1</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1/2</name>
									<description>weight of current sample</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/4</name>
									<description>weight of current sample</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/8</name>
									<description>weight of current sample</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/16</name>
									<description>weight of current sample</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CH0</name>
							<description>Filter Coefficients ADC channel 0</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1/2</name>
									<description>weight of current sample</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/4</name>
									<description>weight of current sample</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/8</name>
									<description>weight of current sample</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/16</name>
									<description>weight of current sample</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
