cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
				<register>
					<name>IRQCLR_1</name>
					<description>ADC1 Interrupt Status Clear 1 Register</description>
					<addressOffset>0x6C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>DU1UP_ISC</name>
							<description>Differential Unit 1 lower Interrupt Status Clear</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>interrupt status is not cleared</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt status is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DU1LO_ISC</name>
							<description>Differential Unit 1 lower Interrupt Status Clear</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>interrupt status is not cleared</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt status is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ESM_ISC</name>
							<description>Exceptional Sequence Measurement (ESM) Status Clear</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>No ESM has cleared</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>ESM cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EIM_ISC</name>
							<description>Exceptional Interrupt Measurement (EIM) Status Clear</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>No EIM cleared</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>EIM cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IIR_CH13_ISC</name>
							<description>ADC1 IIR-Filter-Channel 13 Interrupt Status Clear</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>interrupt status is not cleared</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt status is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IIR_CH12_ISC</name>
							<description>ADC1 IIR-Filter-Channel 12 Interrupt Status Clear</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>interrupt status is not cleared</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt status is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IIR_CH11_ISC</name>
							<description>ADC1 IIR-Filter-Channel 11 Interrupt Status Clear</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>interrupt status is not cleared</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt status is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IIR_CH10_ISC</name>
							<description>ADC1 IIR-Filter-Channel 10 Interrupt Status Clear</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>interrupt status is not cleared</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt status is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IIR_CH9_ISC</name>
							<description>ADC1 IIR-Filter-Channel 9 Interrupt Status Clear</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>interrupt status is not cleared</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt status is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IIR_CH8_ISC</name>
							<description>ADC1 IIR-Filter-Channel 8 Interrupt Status Clear</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>interrupt status is not cleared</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt status is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IIR_CH7_ISC</name>
							<description>ADC1 IIR-Filter-Channel 7 Interrupt Status Clear</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>interrupt status is not cleared</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt status is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IIR_CH6_ISC</name>
							<description>ADC1 IIR-Filter-Channel 6 Interrupt Status Clear</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>interrupt status is not cleared</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt status is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IIR_CH5_ISC</name>
							<description>ADC1 IIR-Filter-Channel 5 Interrupt Status Clear</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>interrupt status is not cleared</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt status is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IIR_CH4_ISC</name>
							<description>ADC1 IIR-Filter-Channel 4 Interrupt Status Clear</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>interrupt status is not cleared</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt status is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IIR_CH3_ISC</name>
							<description>ADC1 IIR-Filter-Channel 3 Interrupt Status Clear</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>interrupt status is not cleared</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt status is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IIR_CH2_ISC</name>
							<description>ADC1 IIR-Filter-Channel 2 Interrupt Status Clear</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>interrupt status is not cleared</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt status is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VS_ISC</name>
							<description>ADC1 IIR-Filter-Channel 1 Interrupt Status Clear</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>interrupt status is not cleared</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt status is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IIR_CH0_ISC</name>
							<description>ADC1 IIR-Filter-Channel 0 Interrupt Status Clear</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>interrupt status is not cleared</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt status is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>IRQCLR_2</name>
					<description>ADC1 Interrupt Status Clear 2 Register</description>
					<addressOffset>0x108</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>PP_CH7_UP_ISC</name>
							<description>ADC1 Post-Processing-Channel 7 Upper Threshold Interrupt Status Clear</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>interrupt status is not cleared</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt status is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP_CH6_UP_ISC</name>
							<description>ADC1 Post-Processing-Channel 6 Upper Threshold Interrupt Status Clear</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>interrupt status is not cleared</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt status is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP_CH5_UP_ISC</name>
							<description>ADC1 Post-Processing-Channel 5 Upper Threshold Interrupt Status Clear</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>interrupt status is not cleared</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt status is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP_CH4_UP_ISC</name>
							<description>ADC1 Post-Processing-Channel 4 Upper Threshold Interrupt Status Clear</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>interrupt status is not cleared</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt status is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP_CH3_UP_ISC</name>
							<description>ADC1 Post-Processing-Channel 3 Upper Threshold Interrupt Status Clear</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>interrupt status is not cleared</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt status is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP_CH2_UP_ISC</name>
							<description>ADC1 Post-Processing-Channel 2 Upper Threshold Interrupt Status Clear</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>interrupt status is not cleared</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt status is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VS_UP_ISC</name>
							<description>ADC1 Post-Processing-Channel 1 Upper Threshold Interrupt Status Clear</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>interrupt status is not cleared</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt status is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP_CH0_UP_ISC</name>
							<description>ADC1 Post-Processing-Channel 0 Upper Threshold Interrupt Status Clear</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>interrupt status is not cleared</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt status is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP_CH7_LO_ISC</name>
							<description>ADC1 Post-Processing-Channel 7 Lower Threshold Interrupt Status Clear</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>interrupt status is not cleared</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt status is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP_CH6_LO_ISC</name>
							<description>ADC1 Post-Processing-Channel 6 Lower Threshold Interrupt Status Clear</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>interrupt status is not cleared</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt status is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP_CH5_LO_ISC</name>
							<description>ADC1 Post-Processing-Channel 5 Lower Threshold Interrupt Status Clear</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>interrupt status is not cleared</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt status is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP_CH4_LO_ISC</name>
							<description>ADC1 Post-Processing-Channel 4 Lower Threshold Interrupt Status Clear</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>interrupt status is not cleared</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt status is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP_CH3_LO_ISC</name>
							<description>ADC1 Post-Processing-Channel 3 Lower Threshold Interrupt Status Clear</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>interrupt status is not cleared</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt status is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP_CH2_LO_ISC</name>
							<description>ADC1 Post-Processing-Channel 2 Lower Threshold Interrupt Status Clear</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>interrupt status is not cleared</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt status is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VS_LO_ISC</name>
							<description>ADC1 Post-Processing-Channel 1 Lower Threshold Interrupt Status Clear</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>interrupt status is not cleared</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt status is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP_CH0_LO_ISC</name>
							<description>ADC1 Post-Processing-Channel 0 Lower Threshold Interrupt Status Clear</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>interrupt status is not cleared</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt status is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
