cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
				<register>
					<name>IRQS_1</name>
					<description>ADC1 Interrupt Status 1 Register</description>
					<addressOffset>0x64</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>DU1UP_IS</name>
							<description>ADC1 Differential Unit 1 (DU1) upper Channel Interrupt Status</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>No DU upper Channel Interrupt has occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>DU upper Channel Interrupt has occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DU1LO_IS</name>
							<description>ADC1 Differential Unit 1 (DU1) lower Channel Interrupt Status</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>No DU lower Channel Interrupt has occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>DU lower Channel Interrupt has occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ESM_IS</name>
							<description>Exceptional Sequence Measurement (ESM) Status</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>No ESM has occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>ESM occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EIM_IS</name>
							<description>Exceptional Interrupt Measurement (EIM) Status</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>No EIM occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>EIM occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IIR_CH13_IS</name>
							<description>ADC1 IIR-Filter-Channel 13 Interrupt Status</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>No Channel 13 Interrupt has occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>Channel 13 Interrupt has occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IIR_CH12_IS</name>
							<description>ADC1 IIR-Filter-Channel 12 Interrupt Status</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>No Channel 12 Interrupt has occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>Channel 12 Interrupt has occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IIR_CH11_IS</name>
							<description>ADC1 IIR-Filter-Channel 11 Interrupt Status</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>No Channel 11 Interrupt has occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>Channel 11 Interrupt has occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IIR_CH10_IS</name>
							<description>ADC1 IIR-Filter-Channel 10 Interrupt Status</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>No Channel 10 Interrupt has occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>Channel 10 Interrupt has occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IIR_CH9_IS</name>
							<description>ADC1 IIR-Filter-Channel 9 Interrupt Status</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>No Channel 9 Interrupt has occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>Channel 9 Interrupt has occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IIR_CH8_IS</name>
							<description>ADC1 IIR-Filter-Channel 8 Interrupt Status</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>No Channel 8 Interrupt has occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>Channel 8 Interrupt has occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IIR_CH7_IS</name>
							<description>ADC1 IIR-Filter-Channel 7 Interrupt Status</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>No Channel 7 Interrupt has occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>Channel 7 Interrupt has occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IIR_CH6_IS</name>
							<description>ADC1 IIR-Filter-Channel 6 Interrupt Status</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>No Channel 6 Interrupt has occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>Channel 6 Interrupt has occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IIR_CH5_IS</name>
							<description>ADC1 IIR-Filter-Channel 5 Interrupt Status</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>No Channel 5 Interrupt has occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>Channel 5 Interrupt has occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IIR_CH4_IS</name>
							<description>ADC1 IIR-Filter-Channel 4 Interrupt Status</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>No Channel 4 Interrupt has occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>Channel 4 Interrupt has occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IIR_CH3_IS</name>
							<description>ADC1 IIR-Filter-Channel 3 Interrupt Status</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>No Channel 3 Interrupt has occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>Channel 3 Interrupt has occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IIR_CH2_IS</name>
							<description>ADC1 IIR-Filter-Channel 2 Interrupt Status</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>No Channel 2 Interrupt has occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>Channel 2 Interrupt has occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VS_IS</name>
							<description>ADC1 IIR-Filter-Channel 1 Interrupt Status</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>No Channel 1 Interrupt has occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>Channel 1 Interrupt has occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IIR_CH0_IS</name>
							<description>ADC1 IIR-Filter-Channel 0 Interrupt Status</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>No Channel 0 Interrupt has occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>Channel 0 Interrupt has occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>IRQS_2</name>
					<description>ADC1 Interrupt Status 2 Register</description>
					<addressOffset>0x100</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>PP_CH7_UP_IS</name>
							<description>ADC1 Post-Processing-Channel 7 Upper Threshold Interrupt Status</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt has occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt has occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP_CH6_UP_IS</name>
							<description>ADC1 Post-Processing-Channel 6 Upper Threshold Interrupt Status</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt has occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt has occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP_CH5_UP_IS</name>
							<description>ADC1 Post-Processing-Channel 5 Upper Threshold Interrupt Status</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt has occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt has occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP_CH4_UP_IS</name>
							<description>ADC1 Post-Processing-Channel 4 Upper Threshold Interrupt Status</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt has occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt has occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP_CH3_UP_IS</name>
							<description>ADC1 Post-Processing-Channel 3 Upper Threshold Interrupt Status</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt has occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt has occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP_CH2_UP_IS</name>
							<description>ADC1 Post-Processing-Channel 2 Upper Threshold Interrupt Status</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt has occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt has occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VS_UP_IS</name>
							<description>ADC1 Post-Processing-Channel 1 Upper Threshold Interrupt Status</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt has occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt has occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP_CH0_UP_IS</name>
							<description>ADC1 Post-Processing-Channel 0 Upper Threshold Interrupt Status</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt has occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt has occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP_CH7_LO_IS</name>
							<description>ADC1 Post-Processing-Channel 7 Lower Threshold Interrupt Status</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt has occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt has occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP_CH6_LO_IS</name>
							<description>ADC1 Post-Processing-Channel 6 Lower Threshold Interrupt Status</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt has occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt has occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP_CH5_LO_IS</name>
							<description>ADC1 Post-Processing-Channel 5 Lower Threshold Interrupt Status</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt has occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt has occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP_CH4_LO_IS</name>
							<description>ADC1 Post-Processing-Channel 4 Lower Threshold Interrupt Status</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt has occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt has occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP_CH3_LO_IS</name>
							<description>ADC1 Post-Processing-Channel 3 Lower Threshold Interrupt Status</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt has occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt has occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP_CH2_LO_IS</name>
							<description>ADC1 Post-Processing-Channel 2 Lower Threshold Interrupt Status</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt has occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt has occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VS_LO_IS</name>
							<description>ADC1 Post-Processing-Channel 1 Lower Threshold Interrupt Status</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt has occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt has occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP_CH0_LO_IS</name>
							<description>ADC1 Post-Processing-Channel 0 Lower Threshold Interrupt Status</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt has occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>interrupt has occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>MAX_TIME</name>
					<description>Maximum Time for Software Mode</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>MAX_TIME</name>
							<description>Maximum Time in Software Mode</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>min</name>
									<description>Software mode is immediately left</description>
									<value>0x00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>max</name>
									<description>Software mode is active for 12.75 us</description>
									<value>0xFF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
