cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
				<register>
					<name>MMODE0_7</name>
					<description>Overvoltage Measurement Mode of Post-Processing-Channel 0-7</description>
					<addressOffset>0xF8</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>MMODE_D1</name>
							<description>Measurement mode Differential Channel 1</description>
							<lsb>24</lsb>
							<msb>25</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>MMODE0</name>
									<description>upper and lower voltage/limit measurement</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEUV</name>
									<description>undervoltage/-limit measurement</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEOV</name>
									<description>overvoltage/-limit measurement</description>
									<value>0b10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MMODE_7</name>
							<description>Measurement mode Post-Processing-Channel 7</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>MMODE0</name>
									<description>upper and lower voltage/limit measurement</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEUV</name>
									<description>undervoltage/-limit measurement</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEOV</name>
									<description>overvoltage/-limit measurement</description>
									<value>0b10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MMODE_6</name>
							<description>Measurement mode Post-Processing-Channel 6</description>
							<lsb>12</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>MMODE0</name>
									<description>upper and lower voltage/limit measurement</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEUV</name>
									<description>undervoltage/-limit measurement</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEOV</name>
									<description>overvoltage/-limit measurement</description>
									<value>0b10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MMODE_5</name>
							<description>Measurement mode Post-Processing-Channel 5</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>MMODE0</name>
									<description>upper and lower voltage/limit measurement</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEUV</name>
									<description>undervoltage/-limit measurement</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEOV</name>
									<description>overvoltage/-limit measurement</description>
									<value>0b10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MMODE_4</name>
							<description>Measurement mode Post-Processing-Channel 4</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>MMODE0</name>
									<description>upper and lower voltage/limit measurement</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEUV</name>
									<description>undervoltage/-limit measurement</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEOV</name>
									<description>overvoltage/-limit measurement</description>
									<value>0b10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MMODE_3</name>
							<description>Measurement mode Post-Processing-Channel 3</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>MMODE0</name>
									<description>upper and lower voltage/limit measurement</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEUV</name>
									<description>undervoltage/-limit measurement</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEOV</name>
									<description>overvoltage/-limit measurement</description>
									<value>0b10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MMODE_2</name>
							<description>Measurement mode Post-Processing-Channel 2</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>MMODE0</name>
									<description>upper and lower voltage/limit measurement</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEUV</name>
									<description>undervoltage/-limit measurement</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEOV</name>
									<description>overvoltage/-limit measurement</description>
									<value>0b10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MMODE_1</name>
							<description>Measurement mode Post-Processing-Channel 1</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>MMODE0</name>
									<description>upper and lower voltage/limit measurement</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEUV</name>
									<description>undervoltage/-limit measurement</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEOV</name>
									<description>overvoltage/-limit measurement</description>
									<value>0b10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MMODE_0</name>
							<description>Measurement mode Post-Processing-Channel 0</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>MMODE0</name>
									<description>upper and lower voltage/limit measurement</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEUV</name>
									<description>undervoltage/-limit measurement</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEOV</name>
									<description>overvoltage/-limit measurement</description>
									<value>0b10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>OFFSETCALIB</name>
					<description>ADC1 Offset Calibration Register</description>
					<addressOffset>0x3C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>OFFSET_DAC</name>
							<description>Set the Value of the Offset Calibration DAC</description>
							<lsb>8</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OFFSET_SHIFT</name>
							<description>Set the Value of the Offset Shift DAC</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PP_MAP0_3</name>
					<description>Post-Processing Mapping Channel 0-3</description>
					<addressOffset>0x118</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>EN_PP_MAP3</name>
							<description>Mapping Enable for Post-Processing-Channel 3</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Mapping Disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled</name>
									<description>Mapping Enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESET_PP_MAP3</name>
							<description>Post-Processing Reset for Mapped Post-Processing-Channel 3</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Running</name>
									<description>Post-Processing running</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>Post-Processing reset</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP_MAP3</name>
							<description>Mapping of Entry Channel to Post-Processing-Channel 3</description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Ch0</name>
									<description>Entry Channel 0</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Ch13</name>
									<description>Entry Channel 13</description>
									<value>0xD</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EN_PP_MAP2</name>
							<description>Mapping Enable for Post-Processing-Channel 2</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Mapping Disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled</name>
									<description>Mapping Enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESET_PP_MAP2</name>
							<description>Post-Processing Reset for Mapped Post-Processing-Channel 2</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Running</name>
									<description>Post-Processing running</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>Post-Processing reset</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP_MAP2</name>
							<description>Mapping of Entry Channel to Post-Processing-Channel 2</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Ch0</name>
									<description>Entry Channel 0</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Ch13</name>
									<description>Entry Channel 13</description>
									<value>0xD</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EN_PP_MAP1</name>
							<description>Mapping Enable for Post-Processing-Channel 1</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Mapping Disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled</name>
									<description>Mapping Enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESET_PP_MAP1</name>
							<description>Post-Processing Reset for Mapped Post-Processing-Channel 1</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Running</name>
									<description>Post-Processing running</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>Post-Processing reset</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EN_PP_MAP0</name>
							<description>Mapping Enable for Post-Processing-Channel 0</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Mapping Disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled</name>
									<description>Mapping Enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESET_PP_MAP0</name>
							<description>Post-Processing Reset for Mapped Post-Processing-Channel 0</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Running</name>
									<description>Post-Processing running</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>Post-Processing reset</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PP_MAP4_7</name>
					<description>Post-Processing Mapping Channel 4-7</description>
					<addressOffset>0x11C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>EN_PP_MAP7</name>
							<description>Mapping Enable for Post-Processing-Channel 7</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Mapping Disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled</name>
									<description>Mapping Enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESET_PP_MAP7</name>
							<description>Post-Processing Reset for Mapped Post-Processing-Channel 7</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Running</name>
									<description>Post-Processing running</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>Post-Processing reset</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP_MAP7</name>
							<description>Mapping of Entry Channel to Post-Processing-Channel 7</description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Ch0</name>
									<description>Entry Channel 0</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Ch13</name>
									<description>Entry Channel 13</description>
									<value>0xD</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EN_PP_MAP6</name>
							<description>Mapping Enable for Post-Processing-Channel 6</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Mapping Disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled</name>
									<description>Mapping Enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESET_PP_MAP6</name>
							<description>Post-Processing Reset for Mapped Post-Processing-Channel 6</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Running</name>
									<description>Post-Processing running</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>Post-Processing reset</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP_MAP6</name>
							<description>Mapping of Entry Channel to Post-Processing-Channel 6</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Ch0</name>
									<description>Entry Channel 0</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Ch13</name>
									<description>Entry Channel 13</description>
									<value>0xD</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EN_PP_MAP5</name>
							<description>Mapping Enable for Post-Processing-Channel 5</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Mapping Disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled</name>
									<description>Mapping Enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESET_PP_MAP5</name>
							<description>Post-Processing Reset for Mapped Post-Processing-Channel 5</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Running</name>
									<description>Post-Processing running</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>Post-Processing reset</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP_MAP5</name>
							<description>Mapping of Entry Channel to Post-Processing-Channel 5</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Ch0</name>
									<description>Entry Channel 0</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Ch13</name>
									<description>Entry Channel 13</description>
									<value>0xD</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EN_PP_MAP4</name>
							<description>Mapping Enable for Post-Processing-Channel 4</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Mapping Disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled</name>
									<description>Mapping Enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESET_PP_MAP4</name>
							<description>Post-Processing Reset for Mapped Post-Processing-Channel 4</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Running</name>
									<description>Post-Processing running</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>Post-Processing reset</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP_MAP4</name>
							<description>Mapping of Entry Channel to Post-Processing-Channel 4</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Ch0</name>
									<description>Entry Channel 0</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Ch13</name>
									<description>Entry Channel 13</description>
									<value>0xD</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SQ0_1</name>
					<description>Measurement Unit 1 Channel Enable Bits for Cycle 0-1</description>
					<addressOffset>0x20</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>SQ1</name>
							<description>Sequence 1 channel enable</description>
							<lsb>16</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SQ0</name>
							<description>Sequence 0 channel enable</description>
							<lsb>0</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SQ10_11</name>
					<description>Measurement Unit 1 Channel Enable Bits for Cycle 10-11</description>
					<addressOffset>0x34</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>SQ11</name>
							<description>Sequence 11 channel enable</description>
							<lsb>16</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SQ10</name>
							<description>Sequence 10 channel enable</description>
							<lsb>0</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
