cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
				<register>
					<name>SQ12_13</name>
					<description>Measurement Unit 1 Channel Enable Bits for Cycle 12-13</description>
					<addressOffset>0x130</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>SQ13</name>
							<description>Sequence 13 channel enable</description>
							<lsb>16</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SQ12</name>
							<description>Sequence 12 channel enable</description>
							<lsb>0</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SQ2_3</name>
					<description>Measurement Unit 1 Channel Enable Bits for Cycle 2-3</description>
					<addressOffset>0x24</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>SQ3</name>
							<description>Sequence 3 channel enable</description>
							<lsb>16</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SQ2</name>
							<description>Sequence 2 channel enable</description>
							<lsb>0</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SQ4_5</name>
					<description>Measurement Unit 1 Channel Enable Bits for Cycle 4-5</description>
					<addressOffset>0x28</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>SQ5</name>
							<description>Sequence 5 channel enable</description>
							<lsb>16</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SQ4</name>
							<description>Sequence 4 channel enable</description>
							<lsb>0</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SQ6_7</name>
					<description>Measurement Unit 1 Channel Enable Bits for Cycle 6-7</description>
					<addressOffset>0x2C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>SQ7</name>
							<description>Sequence 7 channel enable</description>
							<lsb>16</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SQ6</name>
							<description>Sequence 6 channel enable</description>
							<lsb>0</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SQ8_9</name>
					<description>Measurement Unit 1 Channel Enable Bits for Cycle 8-9</description>
					<addressOffset>0x30</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>SQ9</name>
							<description>Sequence 9 channel enable</description>
							<lsb>16</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SQ8</name>
							<description>Sequence 8 channel enable</description>
							<lsb>0</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SQ_CH_MAP</name>
					<description>ADC1 Channel Mapping for Sequencer</description>
					<addressOffset>0x38</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>SQ_CH12_MAP</name>
							<description>ADC mapping to CH12</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>P2.7</name>
									<description>P2.7 mapped to CH12</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>P2.4</name>
									<description>P2.4 mapped to CH12</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SQ_CH6_MAP</name>
							<description>ADC mapping to CH6</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>P2.0</name>
									<description>P2.0 mapped to CH6</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>P2.8</name>
									<description>P2.8 mapped to CH6</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SQ_CH5_MAP</name>
							<description>ADC mapping to CH5</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>MON4</name>
									<description>MON4 mapped to CH5</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MON5</name>
									<description>MON5 mapped to CH5</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SQ_FB</name>
					<description>Sequencer Feedback Register</description>
					<addressOffset>0x04</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>CHx</name>
							<description>Current ADC1 Channel</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CH0</name>
									<description>Channel 0 enable</description>
									<value>0b0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH1</name>
									<description>Channel 1 enable</description>
									<value>0b0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH2</name>
									<description>Channel 2 enable</description>
									<value>0b0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH3</name>
									<description>Channel 3 enable</description>
									<value>0b0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH4</name>
									<description>Channel 4 enable</description>
									<value>0b0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH5</name>
									<description>Channel 5 enable</description>
									<value>0b0101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH6</name>
									<description>Channel 6 enable</description>
									<value>0b0110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH7</name>
									<description>Channel 7 enable</description>
									<value>0b0111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH8</name>
									<description>Channel 8 enable</description>
									<value>0b1000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH9</name>
									<description>Channel 9 enable</description>
									<value>0b1001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH10</name>
									<description>Channel 10 enable</description>
									<value>0b1010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH11</name>
									<description>Channel 11 enable</description>
									<value>0b1011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH12</name>
									<description>Channel 12 enable</description>
									<value>0b1100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH13</name>
									<description>Channel 13 enable</description>
									<value>0b1101</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SQx</name>
							<description>Current Active ADC1 Sequence</description>
							<lsb>11</lsb>
							<msb>14</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>SQ0</name>
									<description>Sequence 0 enable</description>
									<value>0b0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ1</name>
									<description>Sequence 1 enable</description>
									<value>0b0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ2</name>
									<description>Sequence 2 enable</description>
									<value>0b0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ3</name>
									<description>Sequence 3 enable</description>
									<value>0b0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ4</name>
									<description>Sequence 4 enable</description>
									<value>0b0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ5</name>
									<description>Sequence 5 enable</description>
									<value>0b0101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ6</name>
									<description>Sequence 6 enable</description>
									<value>0b0110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ7</name>
									<description>Sequence 7 enable</description>
									<value>0b0111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ8</name>
									<description>Sequence 8 enable</description>
									<value>0b1000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ9</name>
									<description>Sequence 9 enable</description>
									<value>0b1001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ10</name>
									<description>Sequence 10 enable</description>
									<value>0b1010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ11</name>
									<description>Sequence 11 enable</description>
									<value>0b1011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ12</name>
									<description>Sequence 12 enable</description>
									<value>0b1100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ13</name>
									<description>Sequence 13 enable</description>
									<value>0b1101</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ESM_ACTIVE</name>
							<description>ADC1 ESM active</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not active</name>
									<description>ESM not active</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>active</name>
									<description>ESM active</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EIM_ACTIVE</name>
							<description>ADC1 EIM active</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not active</name>
									<description>EIM not active</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>active</name>
									<description>EIM active</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SQ_STOP</name>
							<description>ADC1 Sequencer Stop Signal for DPP</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DPP Running</name>
									<description>Postprocessing Sequencer in running mode</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DPP Stopped</name>
									<description>Postprocessing Sequencer stopped / Software Mode entered</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SQ_FB</name>
							<description>Current Sequence that caused software mode</description>
							<lsb>0</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>SQ0</name>
									<description>Sequence 0 enable</description>
									<value>0b00000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ1</name>
									<description>Sequence 1 enable</description>
									<value>0b00001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ2</name>
									<description>Sequence 2 enable</description>
									<value>0b00010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ3</name>
									<description>Sequence 3 enable</description>
									<value>0b00011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ4</name>
									<description>Sequence 4 enable</description>
									<value>0b00100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ5</name>
									<description>Sequence 5 enable</description>
									<value>0b00101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ6</name>
									<description>Sequence 6 enable</description>
									<value>0b00110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ7</name>
									<description>Sequence 7 enable</description>
									<value>0b00111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ8</name>
									<description>Sequence 8 enable</description>
									<value>0b01000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ9</name>
									<description>Sequence 9 enable</description>
									<value>0b01001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ10</name>
									<description>Sequence 10 enable</description>
									<value>0b01010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ11</name>
									<description>Sequence 11 enable</description>
									<value>0b01011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ12</name>
									<description>Sequence 12 enable</description>
									<value>0b01100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ13</name>
									<description>Sequence 13 enable</description>
									<value>0b01101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ESM</name>
									<description>ESM</description>
									<value>0b11010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SUSPEND</name>
									<description>SW Mode per Flag</description>
									<value>0b11100</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>STATUS</name>
					<description>ADC1 Status Register</description>
					<addressOffset>0xBC</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>SD_FEEDB_ON</name>
							<description>Sigma Delta Feedback Loop</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SOC_JITTER</name>
							<description>Programs Soc Clock Jitter</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>0n</name>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3.5n</name>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>5.5n</name>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8n</name>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DAC_IN</name>
							<description>Programs the 2-bit DAC for functional test</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>0</name>
									<description>added 0 LSB</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1</name>
									<description>added 1 LSB</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2</name>
									<description>added 2 LSB</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3</name>
									<description>added 3 LSB</description>
									<value>0b011</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>STS_1</name>
					<description>ADC1 Status 1Register</description>
					<addressOffset>0x124</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>DU1UP_STS</name>
							<description>ADC1 Differential Unit 1 (DU1) upper Channel Status</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>No DU upper Channel Status has occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>DU upper Channel Status has occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DU1LO_STS</name>
							<description>ADC1 Differential Unit 1 (DU1) lower Channel Status</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>No DU lower Channel Status has occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>DU lower Channel Status has occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
