cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
				<register>
					<name>STS_2</name>
					<description>ADC1 Status 2 Register</description>
					<addressOffset>0x104</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>PP_CH7_UP_STS</name>
							<description>ADC1 Post-Processing-Channel 7 Upper Threshold Status</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Below limit</name>
									<description>Status below upper threshold</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Above limit</name>
									<description>Upper threshold exceeded</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP_CH6_UP_STS</name>
							<description>ADC1 Post-Processing-Channel 6 Upper Threshold Status</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Below limit</name>
									<description>Status below upper threshold</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Above limit</name>
									<description>Upper threshold exceeded</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP_CH5_UP_STS</name>
							<description>ADC1 Post-Processing-Channel 5 Upper Threshold Status</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Below limit</name>
									<description>Status below upper threshold</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Above limit</name>
									<description>Upper threshold exceeded</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP_CH4_UP_STS</name>
							<description>ADC1 Post-Processing-Channel 4 Upper Threshold Status</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Below limit</name>
									<description>Status below upper threshold</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Above limit</name>
									<description>Upper threshold exceeded</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP_CH3_UP_STS</name>
							<description>ADC1 Post-Processing-Channel 3 Upper Threshold Status</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Below limit</name>
									<description>Status below upper threshold</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Above limit</name>
									<description>Upper threshold exceeded</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP_CH2_UP_STS</name>
							<description>ADC1 Post-Processing-Channel 2 Upper Threshold Status</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Below limit</name>
									<description>Status below upper threshold</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Above limit</name>
									<description>Upper threshold exceeded</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VS_UP_STS</name>
							<description>ADC1 Post-Processing-Channel 1 Upper Threshold Status</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Below limit</name>
									<description>Status below upper threshold</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Above limit</name>
									<description>Upper threshold exceeded</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP_CH0_UP_STS</name>
							<description>ADC1 Post-Processing-Channel 0 Upper Threshold Status</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Below limit</name>
									<description>Status below upper threshold</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Above limit</name>
									<description>Upper threshold exceeded</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP_CH7_LO_STS</name>
							<description>ADC1 Post-Processing-Channel 7 Lower Threshold Status</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Below limit</name>
									<description>Status below upper threshold</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Above limit</name>
									<description>Upper threshold exceeded</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP_CH6_LO_STS</name>
							<description>ADC1 Post-Processing-Channel 6 Lower Threshold Status</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Below limit</name>
									<description>Status below upper threshold</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Above limit</name>
									<description>Upper threshold exceeded</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP_CH5_LO_STS</name>
							<description>ADC1 Post-Processing-Channel 5 Lower Threshold Status</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Below limit</name>
									<description>Status below upper threshold</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Above limit</name>
									<description>Upper threshold exceeded</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP_CH4_LO_STS</name>
							<description>ADC1 Post-Processing-Channel 4 Lower Threshold Status</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Below limit</name>
									<description>Status below upper threshold</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Above limit</name>
									<description>Upper threshold exceeded</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP_CH3_LO_STS</name>
							<description>ADC1 Post-Processing-Channel 3 Lower Threshold Status</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Below limit</name>
									<description>Status below upper threshold</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Above limit</name>
									<description>Upper threshold exceeded</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP_CH2_LO_STS</name>
							<description>ADC1 Post-Processing-Channel 2 Lower Threshold Status</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Below limit</name>
									<description>Status below upper threshold</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Above limit</name>
									<description>Upper threshold exceeded</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VS_LO_STS</name>
							<description>ADC1 Post-Processing-Channel 1 Lower Threshold Status</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Below limit</name>
									<description>Status below upper threshold</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Above limit</name>
									<description>Upper threshold exceeded</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP_CH0_LO_STS</name>
							<description>ADC1 Post-Processing-Channel 0 Lower Threshold Status</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Below limit</name>
									<description>Status below upper threshold</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Above limit</name>
									<description>Upper threshold exceeded</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>STSCLR_1</name>
					<description>ADC1 Status Clear 1 Register</description>
					<addressOffset>0x128</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>DU1UP_SC</name>
							<description>ADC1 Differential Unit 1 (DU1) upper Channel Status Clear</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>No DU upper Channel Status has occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>DU upper Channel Status has occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DU1LO_SC</name>
							<description>ADC1 Differential Unit 1 (DU1) lower Channel Status Clear</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>No DU lower Channel Status has occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>DU lower Channel Status has occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>TH0_3_LOWER</name>
					<description>Lower Comparator Trigger Level Post-Processing-Channel 0-3</description>
					<addressOffset>0x40</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>PP_CH3_LOW</name>
							<description>Post-Processing-Channel 3 lower trigger level</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PP_CH2_LOW</name>
							<description>Post-Processing-Channel 2 lower trigger level</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PP_CH1_LOW</name>
							<description>Post-Processing-Channel 1 lower trigger level</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PP_CH0_LOW</name>
							<description>Post-Processing-Channel 0 lower trigger level</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TH0_3_UPPER</name>
					<description>Upper Comparator Trigger Level Post-Processing-Channel 0-3</description>
					<addressOffset>0xC8</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>PP_CH3_UP</name>
							<description>Post-Processing-Channel 3 upper trigger level</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PP_CH2_UP</name>
							<description>Post-Processing-Channel 2 upper trigger level</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PP_CH1_UP</name>
							<description>Post-Processing-Channel 1 upper trigger level</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PP_CH0_UP</name>
							<description>Post-Processing-Channel 0 upper trigger level</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TH4_7_LOWER</name>
					<description>Lower Comparator Trigger Level Post-Processing-Channel 4-7</description>
					<addressOffset>0x44</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>PP_CH7_LOW</name>
							<description>Post-Processing-Channel 7 lower trigger level</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PP_CH6_LOW</name>
							<description>Post-Processing-Channel 6 lower trigger level</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PP_CH5_LOW</name>
							<description>Post-Processing-Channel 5 lower trigger level</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PP_CH4_LOW</name>
							<description>Post-Processing-Channel 4 lower trigger level</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TH4_7_UPPER</name>
					<description>Upper Comparator Trigger Level Post-Processing-Channel 4-7</description>
					<addressOffset>0xCC</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>PP_CH7_UP</name>
							<description>Post-Processing-Channel 7 upper trigger level</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PP_CH6_UP</name>
							<description>Post-Processing-Channel 6upper trigger level</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PP_CH5_UP</name>
							<description>Post-Processing-Channel 5 upper trigger level</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PP_CH4_UP</name>
							<description>Post-Processing-Channel 4 upper trigger level</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
