cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>ADC2</name>
			<description>ADC2</description>
			<baseAddress>0x4801C000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x2000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>INTISR2</name>
				<description>Interrupt node 2: ADC2, Timer3</description>
				<value>2</value>
			</interrupt>
			<registers>
				<register>
					<name>CAL_CH0_1</name>
					<description>Calibration for Channel 0 and 1</description>
					<addressOffset>0x34</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>GAIN_CH1</name>
							<description>Gain Calibration for channel 1</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OFFS_CH1</name>
							<description>Offset Calibration for channel 1</description>
							<lsb>16</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>GAIN_CH0</name>
							<description>Gain Calibration for channel 0</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OFFS_CH0</name>
							<description>Offset Calibration for channel 0</description>
							<lsb>0</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CAL_CH2_3</name>
					<description>Calibration for Channel 2 and 3</description>
					<addressOffset>0x38</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>GAIN_CH3</name>
							<description>Gain Calibration for channel 3</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OFFS_CH3</name>
							<description>Offset Calibration for channel 3</description>
							<lsb>16</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>GAIN_CH2</name>
							<description>Gain Calibration for channel 2</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OFFS_CH2</name>
							<description>Offset Calibration for channel 2</description>
							<lsb>0</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CAL_CH4_5</name>
					<description>Calibration for Channel 4 and 5</description>
					<addressOffset>0x3C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>GAIN_CH5</name>
							<description>Gain Calibration for channel 5</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OFFS_CH5</name>
							<description>Offset Calibration for channel 5</description>
							<lsb>16</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>GAIN_CH4</name>
							<description>Gain Calibration for channel 4</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OFFS_CH4</name>
							<description>Offset Calibration for channel 4</description>
							<lsb>0</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CAL_CH6_7</name>
					<description>Calibration for Channel 6 and 7</description>
					<addressOffset>0x40</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>GAIN_CH7</name>
							<description>Gain Calibration for channel 7</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OFFS_CH7</name>
							<description>Offset Calibration for channel 7</description>
							<lsb>16</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>GAIN_CH6</name>
							<description>Gain Calibration for channel 6</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OFFS_CH6</name>
							<description>Offset Calibration for channel 6</description>
							<lsb>0</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CAL_CH8_9</name>
					<description>Calibration for Channel 8</description>
					<addressOffset>0x44</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>GAIN_CH8</name>
							<description>Gain Calibration for channel 8</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OFFS_CH8</name>
							<description>Offset Calibration for channel 8</description>
							<lsb>0</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CHx_EIM</name>
					<description>Channel Settings Bits for Exceptional Interrupt Measurement</description>
					<addressOffset>0x08</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>SEL</name>
							<description>Exceptional interrupt measurement (EIM) Trigger select</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>GPT12PISEL.T3_GPT12_SEL</name>
									<description>Signal according to SCU_GPT12PISEL.T3_GPT12SEL setting</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CP_clk</name>
									<description>Charge-pump clock</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EN</name>
							<description>Exceptional interrupt measurement (EIM) Trigger Event enable</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>start of EIM disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>start of IEM enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>REP</name>
							<description>Repeat count for exceptional interrupt measurement (EIM)</description>
							<lsb>8</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1</name>
									<description>Measurement (minimum or continuous measurement as long as trigger signals stays high, 1 / continuous SOC generated for ADC8)</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2</name>
									<description>Measurements (2 SOC generated for ADC8)</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4</name>
									<description>Measurements (4 SOC generated for ADC8)</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8</name>
									<description>Measurements (8 SOC generated for ADC8)</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16</name>
									<description>Measurements (16 SOC generated for ADC8)</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>32</name>
									<description>Measurements (32 SOC generated for ADC8)</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>64</name>
									<description>Measurements (64 SOC generated for ADC8)</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>128</name>
									<description>Measurements (128 SOC generated for ADC8)</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CHx_SEL</name>
							<description>Channel set for exceptional interrupt measurement (EIM)</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CH0_EN</name>
									<description>Channel 0 enable</description>
									<value>0b0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH1_EN</name>
									<description>Channel 1 enable</description>
									<value>0b0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH2_EN</name>
									<description>Channel 2 enable</description>
									<value>0b0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH3_EN</name>
									<description>Channel 3 enable</description>
									<value>0b0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH4_EN</name>
									<description>Channel 4 enable</description>
									<value>0b0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH5_EN</name>
									<description>Channel 5 enable</description>
									<value>0b0101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH6_EN</name>
									<description>Channel 6 enable</description>
									<value>0b0110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH7_EN</name>
									<description>Channel 7 enable</description>
									<value>0b0111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH8_EN</name>
									<description>Channel 8 enable</description>
									<value>0b1000</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CNT0_3_LOWER</name>
					<description>Lower Counter Trigger Level Channel 0 - 3</description>
					<addressOffset>0x98</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>HYST_LO_CH3</name>
							<description>Channel 3 lower hysteresis</description>
							<lsb>27</lsb>
							<msb>28</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>HYSTOFF</name>
									<description>hysteresis switched off</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST4</name>
									<description>hysteresis = 4</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST8</name>
									<description>hysteresis = 8</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST16</name>
									<description>hysteresis = 16</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CNT_LO_CH3</name>
							<description>Lower timer trigger threshold channel 3</description>
							<lsb>24</lsb>
							<msb>25</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1</name>
									<description>1 measurement</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2</name>
									<description>2 measurements</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4</name>
									<description>4 measurements</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>7</name>
									<description>7 measurements</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HYST_LO_CH2</name>
							<description>Channel 2 lower hysteresis</description>
							<lsb>19</lsb>
							<msb>20</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>HYSTOFF</name>
									<description>hysteresis switched off</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST4</name>
									<description>hysteresis = 4</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST8</name>
									<description>hysteresis = 8</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST16</name>
									<description>hysteresis = 16</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CNT_LO_CH2</name>
							<description>Lower timer trigger threshold channel 2</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1</name>
									<description>1 measurement</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2</name>
									<description>2 measurements</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4</name>
									<description>4 measurements</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>7</name>
									<description>7 measurements</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HYST_LO_CH1</name>
							<description>Channel 1 lower hysteresis</description>
							<lsb>11</lsb>
							<msb>12</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>HYSTOFF</name>
									<description>hysteresis switched off</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST4</name>
									<description>hysteresis = 4</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST8</name>
									<description>hysteresis = 8</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST16</name>
									<description>hysteresis = 16</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CNT_LO_CH1</name>
							<description>Lower timer trigger threshold channel 1</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1</name>
									<description>1 measurement</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2</name>
									<description>2 measurements</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4</name>
									<description>4 measurements</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>7</name>
									<description>7 measurements</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HYST_LO_CH0</name>
							<description>Channel 0 lower hysteresis</description>
							<lsb>3</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>HYSTOFF</name>
									<description>hysteresis switched off</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST4</name>
									<description>hysteresis = 4</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST8</name>
									<description>hysteresis = 8</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST16</name>
									<description>hysteresis = 16</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CNT_LO_CH0</name>
							<description>Lower timer trigger threshold channel 0</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1</name>
									<description>1 measurement</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2</name>
									<description>2 measurements</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4</name>
									<description>4 measurements</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>7</name>
									<description>7 measurements</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
