cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
				<register>
					<name>CNT8_11_LOWER</name>
					<description>Lower Counter Trigger Level Channel 8</description>
					<addressOffset>0xA0</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>HYST_LO_CH8</name>
							<description>Channel 8 lower hysteresis</description>
							<lsb>3</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>HYSTOFF</name>
									<description>hysteresis switched off</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST4</name>
									<description>hysteresis = 4</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST8</name>
									<description>hysteresis = 8</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST16</name>
									<description>hysteresis = 16</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CNT_LO_CH8</name>
							<description>Lower timer trigger threshold channel 8</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1</name>
									<description>1 measurement</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2</name>
									<description>2 measurements</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4</name>
									<description>4 measurements</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>7</name>
									<description>7 measurements</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CNT8_11_UPPER</name>
					<description>Upper Counter Trigger Level Channel 8</description>
					<addressOffset>0xAC</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>HYST_UP_CH8</name>
							<description>Channel 8 upper hysteresis</description>
							<lsb>3</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>HYSTOFF</name>
									<description>hysteresis switched off</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST4</name>
									<description>hysteresis = 4</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST8</name>
									<description>hysteresis = 8</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HYST16</name>
									<description>hysteresis = 16</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CNT_UP_CH8</name>
							<description>Upper timer trigger threshold channel 8</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1</name>
									<description>1 measurement</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2</name>
									<description>2 measurements</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4</name>
									<description>4 measurements</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>7</name>
									<description>7 measurements</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CTRL1</name>
					<description>Measurement Unit Control Register 1</description>
					<addressOffset>0x14</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>CALIB_EN_8_0</name>
							<description>Calibration Enable for Channels 8 to 0</description>
							<lsb>0</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CH0_EN</name>
									<description>Channel 0 calibration enable</description>
									<value>0b000000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH1_EN</name>
									<description>Channel 1 calibration enable</description>
									<value>0b000000010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH2_EN</name>
									<description>Channel 2 calibration enable</description>
									<value>0b000000100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH3_EN</name>
									<description>Channel 3 calibration enable</description>
									<value>0b000001000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH4_EN</name>
									<description>Channel 4 calibration enable</description>
									<value>0b000010000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH5_EN</name>
									<description>Channel 5 calibration enable</description>
									<value>0b000100000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH6_EN</name>
									<description>Channel 6 calibration enable</description>
									<value>0b001000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH7_EN</name>
									<description>Channel 7 calibration enable</description>
									<value>0b010000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH8_EN</name>
									<description>Channel 8 calibration enable</description>
									<value>0b100000000</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CTRL2</name>
					<description>Measurement Unit Control Register 2</description>
					<addressOffset>0x18</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>SAMPLE_TIME_int</name>
							<description>Sample time of ADC2</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>MICLK4</name>
									<description>4 MI_CLK clock periods</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MICLK6</name>
									<description>6 MI_CLK clock periods</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MICLK8</name>
									<description>8 MI_CLK clock periods</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MICLK10</name>
									<description>10 MI_CLK clock periods</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MICLK12</name>
									<description>12 MI_CLK clock periods (default)</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MICLK14</name>
									<description>14 MI_CLK clock periods</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MICLK16</name>
									<description>16 MI_CLK clock periods</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MICLK18</name>
									<description>18 MI_CLK clock periods</description>
									<value>0x7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MICLK20</name>
									<description>20 MI_CLK clock periods</description>
									<value>0x8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MICLK22</name>
									<description>22 MI_CLK clock periods</description>
									<value>0x9</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MCM_RDY</name>
							<description>Ready Signal for MCM after Power On or Reset</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>MCM Not Ready</name>
									<description>Measurement Core Module in startup phase</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MCM Ready</name>
									<description>Measurement Core Module start-up phase finished</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MCM_PD_N</name>
							<description>Power Down Signal for MCM</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>MCM Disabled</name>
									<description>Measurement Core Module disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MCM Enabled</name>
									<description>Measurement Core Module enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CTRL4</name>
					<description>Measurement Unit Control Register 4</description>
					<addressOffset>0x1C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>FILT_OUT_SEL_8_0</name>
							<description>Output Filter Selection for Channels 0 to 8</description>
							<lsb>0</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CTRL_STS</name>
					<description>ADC2 Control and Status Register</description>
					<addressOffset>0x00</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>IN_MUX_SEL</name>
							<description>Channel for software mode</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CH0_EN</name>
									<description>Channel 0 enable</description>
									<value>0b0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH1_EN</name>
									<description>Channel 1 enable</description>
									<value>0b0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH2_EN</name>
									<description>Channel 2 enable</description>
									<value>0b0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH3_EN</name>
									<description>Channel 3 enable</description>
									<value>0b0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH4_EN</name>
									<description>Channel 4 enable</description>
									<value>0b0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH5_EN</name>
									<description>Channel 5 enable</description>
									<value>0b0101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH6_EN</name>
									<description>Channel 6 enable</description>
									<value>0b0110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH7_EN</name>
									<description>Channel 7 enable</description>
									<value>0b0111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH8_EN</name>
									<description>Channel 8 enable</description>
									<value>0b1000</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EOC</name>
							<description>ADC2 End of Conversion in software mode</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Pending</name>
									<description>conversion still running</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Finished</name>
									<description>conversion has finished</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SOS</name>
							<description>ADC2 Start of Sampling/Conversion (software mode)</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>no conversion is started</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>conversion is started</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PD_N</name>
							<description>ADC2 Power Down Signal</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>POWER DOWN</name>
									<description>ADC2 is powered down</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>ADC2 is switched on</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>FILT_OUT0</name>
					<description>ADC or Filter Output Channel 0</description>
					<addressOffset>0x50</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>OUT_CH0</name>
							<description>ADC or filter output value channel 0</description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FILT_OUT1</name>
					<description>ADC or Filter Output Channel 1</description>
					<addressOffset>0x54</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>OUT_CH1</name>
							<description>ADC or filter output value channel 1</description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FILT_OUT2</name>
					<description>ADC or Filter Output Channel 2</description>
					<addressOffset>0x58</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>OUT_CH2</name>
							<description>ADC or filter output value channel 2</description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FILT_OUT3</name>
					<description>ADC or Filter Output Channel 3</description>
					<addressOffset>0x5C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>OUT_CH3</name>
							<description>ADC or filter output value channel 3</description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FILT_OUT4</name>
					<description>ADC or Filter Output Channel 4</description>
					<addressOffset>0x60</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>OUT_CH4</name>
							<description>ADC or filter output value channel 4</description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FILT_OUT5</name>
					<description>ADC or Filter Output Channel 5</description>
					<addressOffset>0x64</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>OUT_CH5</name>
							<description>ADC or filter output value channel 5</description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FILT_OUT6</name>
					<description>ADC or Filter Output Channel 6</description>
					<addressOffset>0x68</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>OUT_CH6</name>
							<description>ADC or filter output value channel 6</description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FILT_OUT7</name>
					<description>ADC or Filter Output Channel 7</description>
					<addressOffset>0x6C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>OUT_CH7</name>
							<description>ADC or filter output value channel 7</description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FILT_OUT8</name>
					<description>ADC or Filter Output Channel 8</description>
					<addressOffset>0x70</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>OUT_CH8</name>
							<description>ADC or filter output value channel 8</description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FILT_UPLO_CTRL</name>
					<description>Upper and Lower Threshold Filter Enable</description>
					<addressOffset>0x78</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>UPLOEN_Ch8</name>
							<description>Upper and lower threshold IIR filter enable ch 8</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>UPLOEN_Ch7</name>
							<description>Upper and lower threshold IIR filter enable ch 7</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>UPLOEN_Ch6</name>
							<description>Upper and lower threshold IIR filter enable ch 6</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>UPLOEN_Ch5</name>
							<description>Upper and lower threshold IIR filter enable ch 5</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>UPLOEN_Ch4</name>
							<description>Upper and lower threshold IIR filter enable ch 4</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>UPLOEN_Ch3</name>
							<description>Upper and lower threshold IIR filter enable ch 3</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>UPLOEN_Ch2</name>
							<description>Upper and lower threshold IIR filter enable ch 2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>UPLOEN_Ch1</name>
							<description>Upper and lower threshold IIR filter enable ch 1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>UPLOEN_Ch0</name>
							<description>Upper and lower threshold IIR filter enable ch 0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
