cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
				<register>
					<name>FILTCOEFF0_8</name>
					<description>Filter Coefficients ADC Channel 0-8</description>
					<addressOffset>0x48</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>A_CH8</name>
							<description>Filter Coefficient A for ADC channel 8</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1/2</name>
									<description>weight of current sample</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/4</name>
									<description>weight of current sample</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/8</name>
									<description>weight of current sample</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/16</name>
									<description>weight of current sample</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>A_CH7</name>
							<description>Filter Coefficient A for ADC channel 7</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1/2</name>
									<description>weight of current sample</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/4</name>
									<description>weight of current sample</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/8</name>
									<description>weight of current sample</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/16</name>
									<description>weight of current sample</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>A_CH6</name>
							<description>Filter Coefficient A for ADC channel 6</description>
							<lsb>12</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1/2</name>
									<description>weight of current sample</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/4</name>
									<description>weight of current sample</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/8</name>
									<description>weight of current sample</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/16</name>
									<description>weight of current sample</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>A_CH5</name>
							<description>Filter Coefficient A for ADC channel 5</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1/2</name>
									<description>weight of current sample</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/4</name>
									<description>weight of current sample</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/8</name>
									<description>weight of current sample</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/16</name>
									<description>weight of current sample</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>A_CH4</name>
							<description>Filter Coefficient A for ADC channel 4</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1/2</name>
									<description>weight of current sample</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/4</name>
									<description>weight of current sample</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/8</name>
									<description>weight of current sample</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/16</name>
									<description>weight of current sample</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>A_CH3</name>
							<description>Filter Coefficient A for ADC channel 3</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1/2</name>
									<description>weight of current sample</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/4</name>
									<description>weight of current sample</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/8</name>
									<description>weight of current sample</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/16</name>
									<description>weight of current sample</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>A_CH2</name>
							<description>Filter Coefficient A for ADC channel 2</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1/2</name>
									<description>weight of current sample</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/4</name>
									<description>weight of current sample</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/8</name>
									<description>weight of current sample</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/16</name>
									<description>weight of current sample</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>A_CH1</name>
							<description>Filter Coefficient A for ADC channel 1</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1/2</name>
									<description>weight of current sample</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/4</name>
									<description>weight of current sample</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/8</name>
									<description>weight of current sample</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/16</name>
									<description>weight of current sample</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>A_CH0</name>
							<description>Filter Coefficient A for ADC channel 0</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1/2</name>
									<description>weight of current sample</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/4</name>
									<description>weight of current sample</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/8</name>
									<description>weight of current sample</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1/16</name>
									<description>weight of current sample</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>MAX_TIME</name>
					<description>Maximum Time for Software Mode</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>MAX_TIME</name>
							<description>Maximum Time in Software Mode</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>min</name>
									<description>Software mode is not entered</description>
									<value>0x00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>01</name>
									<description>Software mode is active for 3 clock cycles</description>
									<value>0x01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>max</name>
									<description>Software mode is active for 257 clock cycles (typ. 12.85 us)</description>
									<value>0xFF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>MMODE0_8</name>
					<description>Measurement Mode of Ch 0-8</description>
					<addressOffset>0xB0</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>MSEL_Ch8</name>
							<description>Measurement mode ch 8</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>MMODE0</name>
									<description>upper and lower voltage/limit measurement</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEUV</name>
									<description>undervoltage/-limit measurement</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEOV</name>
									<description>overvoltage/-limit measurement</description>
									<value>0b10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MSEL_Ch7</name>
							<description>Measurement mode ch 7</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>MMODE0</name>
									<description>upper and lower voltage/limit measurement</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEUV</name>
									<description>undervoltage/-limit measurement</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEOV</name>
									<description>overvoltage/-limit measurement</description>
									<value>0b10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MSEL_Ch6</name>
							<description>Measurement mode ch 6</description>
							<lsb>12</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>MMODE0</name>
									<description>upper and lower voltage/limit measurement</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEUV</name>
									<description>undervoltage/-limit measurement</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEOV</name>
									<description>overvoltage/-limit measurement</description>
									<value>0b10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MSEL_Ch5</name>
							<description>Measurement mode ch 5</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>MMODE0</name>
									<description>upper and lower voltage/limit measurement</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEUV</name>
									<description>undervoltage/-limit measurement</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEOV</name>
									<description>overvoltage/-limit measurement</description>
									<value>0b10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MSEL_Ch4</name>
							<description>Measurement mode ch 4</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>MMODE0</name>
									<description>upper and lower voltage/limit measurement</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEUV</name>
									<description>undervoltage/-limit measurement</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEOV</name>
									<description>overvoltage/-limit measurement</description>
									<value>0b10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MSEL_Ch3</name>
							<description>Measurement mode ch 3</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>MMODE0</name>
									<description>upper and lower voltage/limit measurement</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEUV</name>
									<description>undervoltage/-limit measurement</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEOV</name>
									<description>overvoltage/-limit measurement</description>
									<value>0b10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MSEL_Ch2</name>
							<description>Measurement mode ch 2</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>MMODE0</name>
									<description>upper and lower voltage/limit measurement</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEUV</name>
									<description>undervoltage/-limit measurement</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEOV</name>
									<description>overvoltage/-limit measurement</description>
									<value>0b10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MSEL_Ch1</name>
							<description>Measurement mode ch 1</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>MMODE0</name>
									<description>upper and lower voltage/limit measurement</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEUV</name>
									<description>undervoltage/-limit measurement</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEOV</name>
									<description>overvoltage/-limit measurement</description>
									<value>0b10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MSEL_Ch0</name>
							<description>Measurement mode ch 0</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>MMODE0</name>
									<description>upper and lower voltage/limit measurement</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEUV</name>
									<description>undervoltage/-limit measurement</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MMODEOV</name>
									<description>overvoltage/-limit measurement</description>
									<value>0b10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SQ0_1</name>
					<description>Measurement Channel Enable Bits for Sequence 0-1</description>
					<addressOffset>0x20</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>SQ1</name>
							<description>Sequence 1 channel enable</description>
							<lsb>16</lsb>
							<msb>24</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CH0_EN</name>
									<description>Channel 0 enable</description>
									<value>0b000000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH1_EN</name>
									<description>Channel 1 enable</description>
									<value>0b000000010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH2_EN</name>
									<description>Channel 2 enable</description>
									<value>0b000000100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH3_EN</name>
									<description>Channel 3 enable</description>
									<value>0b000001000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH4_EN</name>
									<description>Channel 4 enable</description>
									<value>0b000010000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH5_EN</name>
									<description>Channel 5 enable</description>
									<value>0b000100000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH6_EN</name>
									<description>Channel 6 enable</description>
									<value>0b001000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH7_EN</name>
									<description>Channel 7 enable</description>
									<value>0b010000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH8_EN</name>
									<description>Channel 8 enable</description>
									<value>0b100000000</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SQ0</name>
							<description>Sequence 0 channel enable</description>
							<lsb>0</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CH0_EN</name>
									<description>Channel 0 enable</description>
									<value>0b000000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH1_EN</name>
									<description>Channel 1 enable</description>
									<value>0b000000010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH2_EN</name>
									<description>Channel 2 enable</description>
									<value>0b000000100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH3_EN</name>
									<description>Channel 3 enable</description>
									<value>0b000001000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH4_EN</name>
									<description>Channel 4 enable</description>
									<value>0b000010000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH5_EN</name>
									<description>Channel 5 enable</description>
									<value>0b000100000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH6_EN</name>
									<description>Channel 6 enable</description>
									<value>0b001000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH7_EN</name>
									<description>Channel 7 enable</description>
									<value>0b010000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH8_EN</name>
									<description>Channel 8 enable</description>
									<value>0b100000000</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
