cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
				<register>
					<name>SQ2_3</name>
					<description>Measurement Channel Enable Bits for Sequence 2-3</description>
					<addressOffset>0x28</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>SQ3</name>
							<description>Sequence 3 channel enable</description>
							<lsb>16</lsb>
							<msb>24</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CH0_EN</name>
									<description>Channel 0 enable</description>
									<value>0b000000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH1_EN</name>
									<description>Channel 1 enable</description>
									<value>0b000000010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH2_EN</name>
									<description>Channel 2 enable</description>
									<value>0b000000100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH3_EN</name>
									<description>Channel 3 enable</description>
									<value>0b000001000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH4_EN</name>
									<description>Channel 4 enable</description>
									<value>0b000010000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH5_EN</name>
									<description>Channel 5 enable</description>
									<value>0b000100000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH6_EN</name>
									<description>Channel 6 enable</description>
									<value>0b001000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH7_EN</name>
									<description>Channel 7 enable</description>
									<value>0b010000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH8_EN</name>
									<description>Channel 8 enable</description>
									<value>0b100000000</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SQ2</name>
							<description>Sequence 2 channel enable</description>
							<lsb>0</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CH0_EN</name>
									<description>Channel 0 enable</description>
									<value>0b000000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH1_EN</name>
									<description>Channel 1 enable</description>
									<value>0b000000010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH2_EN</name>
									<description>Channel 2 enable</description>
									<value>0b000000100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH3_EN</name>
									<description>Channel 3 enable</description>
									<value>0b000001000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH4_EN</name>
									<description>Channel 4 enable</description>
									<value>0b000010000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH5_EN</name>
									<description>Channel 5 enable</description>
									<value>0b000100000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH6_EN</name>
									<description>Channel 6 enable</description>
									<value>0b001000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH7_EN</name>
									<description>Channel 7 enable</description>
									<value>0b010000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH8_EN</name>
									<description>Channel 8 enable</description>
									<value>0b100000000</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SQ4_5</name>
					<description>Measurement Channel Enable Bits for Sequence 4 - 5</description>
					<addressOffset>0x24</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>SQ5</name>
							<description>Sequence 5 channel enable</description>
							<lsb>16</lsb>
							<msb>24</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CH0_EN</name>
									<description>Channel 0 enable</description>
									<value>0b000000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH1_EN</name>
									<description>Channel 1 enable</description>
									<value>0b000000010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH2_EN</name>
									<description>Channel 2 enable</description>
									<value>0b000000100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH3_EN</name>
									<description>Channel 3 enable</description>
									<value>0b000001000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH4_EN</name>
									<description>Channel 4 enable</description>
									<value>0b000010000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH5_EN</name>
									<description>Channel 5 enable</description>
									<value>0b000100000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH6_EN</name>
									<description>Channel 6 enable</description>
									<value>0b001000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH7_EN</name>
									<description>Channel 7 enable</description>
									<value>0b010000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH8_EN</name>
									<description>Channel 8 enable</description>
									<value>0b100000000</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SQ4</name>
							<description>Sequence 4 channel enable</description>
							<lsb>0</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CH0_EN</name>
									<description>Channel 0 enable</description>
									<value>0b000000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH1_EN</name>
									<description>Channel 1 enable</description>
									<value>0b000000010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH2_EN</name>
									<description>Channel 2 enable</description>
									<value>0b000000100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH3_EN</name>
									<description>Channel 3 enable</description>
									<value>0b000001000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH4_EN</name>
									<description>Channel 4 enable</description>
									<value>0b000010000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH5_EN</name>
									<description>Channel 5 enable</description>
									<value>0b000100000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH6_EN</name>
									<description>Channel 6 enable</description>
									<value>0b001000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH7_EN</name>
									<description>Channel 7 enable</description>
									<value>0b010000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH8_EN</name>
									<description>Channel 8 enable</description>
									<value>0b100000000</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SQ6_7</name>
					<description>Measurement Channel Enable Bits for Sequence 6 - 7</description>
					<addressOffset>0x2C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>SQ7</name>
							<description>Sequence 7 channel enable</description>
							<lsb>16</lsb>
							<msb>24</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CH0_EN</name>
									<description>Channel 0 enable</description>
									<value>0b000000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH1_EN</name>
									<description>Channel 1 enable</description>
									<value>0b000000010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH2_EN</name>
									<description>Channel 2 enable</description>
									<value>0b000000100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH3_EN</name>
									<description>Channel 3 enable</description>
									<value>0b000001000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH4_EN</name>
									<description>Channel 4 enable</description>
									<value>0b000010000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH5_EN</name>
									<description>Channel 5 enable</description>
									<value>0b000100000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH6_EN</name>
									<description>Channel 6 enable</description>
									<value>0b001000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH7_EN</name>
									<description>Channel 7 enable</description>
									<value>0b010000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH8_EN</name>
									<description>Channel 8 enable</description>
									<value>0b100000000</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SQ6</name>
							<description>Sequence 6 channel enable</description>
							<lsb>0</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CH0_EN</name>
									<description>Channel 0 enable</description>
									<value>0b000000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH1_EN</name>
									<description>Channel 1 enable</description>
									<value>0b000000010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH2_EN</name>
									<description>Channel 2 enable</description>
									<value>0b000000100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH3_EN</name>
									<description>Channel 3 enable</description>
									<value>0b000001000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH4_EN</name>
									<description>Channel 4 enable</description>
									<value>0b000010000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH5_EN</name>
									<description>Channel 5 enable</description>
									<value>0b000100000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH6_EN</name>
									<description>Channel 6 enable</description>
									<value>0b001000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH7_EN</name>
									<description>Channel 7 enable</description>
									<value>0b010000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH8_EN</name>
									<description>Channel 8 enable</description>
									<value>0b100000000</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SQ8_9</name>
					<description>Measurement Channel Enable Bits for Sequence 8</description>
					<addressOffset>0x30</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>SQ8</name>
							<description>Sequence 8 channel enable</description>
							<lsb>0</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CH0_EN</name>
									<description>Channel 0 enable</description>
									<value>0b000000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH1_EN</name>
									<description>Channel 1 enable</description>
									<value>0b000000010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH2_EN</name>
									<description>Channel 2 enable</description>
									<value>0b000000100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH3_EN</name>
									<description>Channel 3 enable</description>
									<value>0b000001000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH4_EN</name>
									<description>Channel 4 enable</description>
									<value>0b000010000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH5_EN</name>
									<description>Channel 5 enable</description>
									<value>0b000100000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH6_EN</name>
									<description>Channel 6 enable</description>
									<value>0b001000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH7_EN</name>
									<description>Channel 7 enable</description>
									<value>0b010000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH8_EN</name>
									<description>Channel 8 enable</description>
									<value>0b100000000</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SQ_FB</name>
					<description>Sequencer Feedback Register</description>
					<addressOffset>0x04</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>CHx</name>
							<description>Current active ADC2 Channel (in normal mode)</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CH0</name>
									<description>Channel 0</description>
									<value>0b0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH1</name>
									<description>Channel 1</description>
									<value>0b0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH2</name>
									<description>Channel 2</description>
									<value>0b0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH3</name>
									<description>Channel 3</description>
									<value>0b0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH4</name>
									<description>Channel 4</description>
									<value>0b0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH5</name>
									<description>Channel 5</description>
									<value>0b0101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH6</name>
									<description>Channel 6</description>
									<value>0b0110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH7</name>
									<description>Channel 7</description>
									<value>0b0111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH8</name>
									<description>Channel 8</description>
									<value>0b1000</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SQx</name>
							<description>Current active ADC2 Sequence (in normal mode)</description>
							<lsb>11</lsb>
							<msb>14</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>SQ0</name>
									<description>Sequence 0</description>
									<value>0b0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ1</name>
									<description>Sequence 1</description>
									<value>0b0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ2</name>
									<description>Sequence 2</description>
									<value>0b0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ3</name>
									<description>Sequence 3</description>
									<value>0b0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ4</name>
									<description>Sequence 4</description>
									<value>0b0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ5</name>
									<description>Sequence 5</description>
									<value>0b0101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ6</name>
									<description>Sequence 6</description>
									<value>0b0110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ7</name>
									<description>Sequence 7</description>
									<value>0b0111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ8</name>
									<description>Sequence 8</description>
									<value>0b1000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ9</name>
									<description>Startup sequence</description>
									<value>0b1001</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EIM_ACTIVE</name>
							<description>ADC2 EIM active</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not active</name>
									<description>EIM not active</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>active</name>
									<description>EIM active</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SQ_STOP</name>
							<description>ADC2 Sequencer Stop Signal for DPP</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DPP Running</name>
									<description>Postprocessing Sequencer in running mode</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DPP Stopped</name>
									<description>Postprocessing Sequencer stopped / Software Mode entered</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SQ_FB</name>
							<description>Current Sequence that caused software mode</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>SQ0</name>
									<description>Sequence 0</description>
									<value>0b0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ1</name>
									<description>Sequence 1</description>
									<value>0b0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ2</name>
									<description>Sequence 2</description>
									<value>0b0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ3</name>
									<description>Sequence 3</description>
									<value>0b0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ4</name>
									<description>Sequence 4</description>
									<value>0b0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ5</name>
									<description>Sequence 5</description>
									<value>0b0101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ6</name>
									<description>Sequence 6</description>
									<value>0b0110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ7</name>
									<description>Sequence 7</description>
									<value>0b0111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SQ8</name>
									<description>Sequence 8</description>
									<value>0b1000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH_MASK</name>
									<description>Sequence was 0 only after masking; SWM not entered</description>
									<value>0b1011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SUSPEND</name>
									<description>Debug Suspend Mode</description>
									<value>0b1100</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>STATUS</name>
					<description>ADC2 HV Status Register</description>
					<addressOffset>0xBC</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>READY</name>
							<description>HVADC Ready bit</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not ready</name>
									<description>Module in power down or in init phase</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Ready</name>
									<description>set automatically 5 ADC clock cycles after module is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>TH0_3_LOWER</name>
					<description>Lower Comparator Trigger Level Channel 0 -3</description>
					<addressOffset>0x80</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>THLO_CH3</name>
							<description>Channel 3 lower trigger level</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>THLO_CH2</name>
							<description>Channel 2 lower trigger level</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>THLO_CH1</name>
							<description>Channel 1 lower trigger level</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>THLO_CH0</name>
							<description>Channel 0 lower trigger level</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TH0_3_UPPER</name>
					<description>Upper Comparator Trigger Level Channel 0-3</description>
					<addressOffset>0x8C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>THUP_CH3</name>
							<description>Channel 3 upper trigger level</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>THUP_CH2</name>
							<description>Channel 2 upper trigger level</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>THUP_CH1</name>
							<description>Channel 1 upper trigger level</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>THUP_CH0</name>
							<description>Channel 0 upper trigger level</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
