cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
				<register>
					<name>TH4_7_LOWER</name>
					<description>Lower Comparator Trigger Level Channel 4 to 7</description>
					<addressOffset>0x84</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>THLO_CH7</name>
							<description>Channel 7 lower trigger level</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>THLO_CH6</name>
							<description>Channel 6 lower trigger level</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>THLO_CH5</name>
							<description>Channel 5 lower trigger level</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>THLO_CH4</name>
							<description>Channel 4 lower trigger level</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TH4_7_UPPER</name>
					<description>Upper Comparator Trigger Level Channel 4 -7</description>
					<addressOffset>0x90</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>THUP_CH7</name>
							<description>Channel 7 upper trigger level</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>THUP_CH6</name>
							<description>Channel 6 upper trigger level</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>THUP_CH5</name>
							<description>Channel 5 upper trigger level</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>THUP_CH4</name>
							<description>Channel 4 upper trigger level</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TH8_11_LOWER</name>
					<description>Lower Comparator Trigger Level Channel 8</description>
					<addressOffset>0x88</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>THLO_CH8</name>
							<description>Channel 8 lower trigger level</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TH8_11_UPPER</name>
					<description>Upper Comparator Trigger Level Channel 8</description>
					<addressOffset>0x94</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>THUP_CH8</name>
							<description>Channel 8 upper trigger level</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>BDRV</name>
			<description>BDRV</description>
			<baseAddress>0x40034000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x4000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>INTISR17</name>
				<description>Interrupt node 17: BDRV LS1, OC, OT, OL</description>
				<value>17</value>
			</interrupt>
			<interrupt>
				<name>INTISR18</name>
				<description>Interrupt node 18: BDRV LS2, OC, OT, OL</description>
				<value>18</value>
			</interrupt>
			<interrupt>
				<name>INTISR19</name>
				<description>Interrupt node 19: BDRV HS1, OC, OT, OL</description>
				<value>19</value>
			</interrupt>
			<interrupt>
				<name>INTISR20</name>
				<description>Interrupt node 20: BDRV HS2, OC, OT, OL</description>
				<value>20</value>
			</interrupt>
			<registers>
				<register>
					<name>ASEQC</name>
					<description>Adaptive Slewrate Sequencer Control Register</description>
					<addressOffset>0x90</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>HB2OFFHYSTEN</name>
							<description>Half Bridge 2 Optimizer Hysteresis for Switch Off Enable Bit</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>OFF</name>
									<description>current optimizer hysteresis is not enabled</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ON</name>
									<description>current optimizer hysteresis is enabled</description>
									<value>0x1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB2ONHYSTEN</name>
							<description>Half Bridge 2 Optimizer Hysteresis for Switch On Enable Bit</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>OFF</name>
									<description>current optimizer hysteresis is not enabled</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ON</name>
									<description>current optimizer hysteresis is enabled</description>
									<value>0x1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB2OPTOFFACT</name>
							<description>Half Bridge 2 Optimizer for Switch Off Active Bit</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>OFF</name>
									<description>current optimizer is not active</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ON</name>
									<description>current optimizer is active</description>
									<value>0x1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB2OPTONACT</name>
							<description>Half Bridge 2 Optimizer for Switch On Active Bit</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>OFF</name>
									<description>current optimizer is not active</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ON</name>
									<description>current optimizer is active</description>
									<value>0x1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB2ASMOFFEN</name>
							<description>Half Bridge 2 Adaptive Sequencer Mode for Switch Off Enable</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>adaptive slew rate sequencer is disabled</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>adaptive slew rate sequencer is enabled</description>
									<value>0x1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB2ASMONEN</name>
							<description>Half Bridge 2 Adaptive Sequencer Mode for Switch On Enable</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>adaptive slew rate sequencer is disabled</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>adaptive slew rate sequencer is enabled</description>
									<value>0x1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB1OFFHYSTEN</name>
							<description>Half Bridge 1 Optimizer Hysteresis for Switch Off Enable Bit</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>OFF</name>
									<description>current optimizer hysteresis is not enabled</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ON</name>
									<description>current optimizer hysteresis is enabled</description>
									<value>0x1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB1ONHYSTEN</name>
							<description>Half Bridge 1 Optimizer Hysteresis for Switch On Enable Bit</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>OFF</name>
									<description>current optimizer hysteresis is not enabled</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ON</name>
									<description>current optimizer hysteresis is enabled</description>
									<value>0x1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB1OPTOFFACT</name>
							<description>Half Bridge 1 Optimizer for Switch Off Active Bit</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>OFF</name>
									<description>current optimizer is not active</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ON</name>
									<description>current optimizer is active</description>
									<value>0x1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB1OPTONACT</name>
							<description>Half Bridge 1 Optimizer for Switch On Active Bit</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>OFF</name>
									<description>current optimizer is not active</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ON</name>
									<description>current optimizer is active</description>
									<value>0x1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB1ASMOFFEN</name>
							<description>Half Bridge 1 Adaptive Sequencer Mode for Switch Off Enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>adaptive slew rate sequencer is disabled</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>adaptive slew rate sequencer is enabled</description>
									<value>0x1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB1ASMONEN</name>
							<description>Half Bridge 1 Adaptive Sequencer Mode for Switch On Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>adaptive slew rate sequencer is disabled</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>adaptive slew rate sequencer is enabled</description>
									<value>0x1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ASEQERRCNT</name>
					<description>Adaptive Slewrate Sequencer Error Counter Control Register</description>
					<addressOffset>0xD8</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>HB2MFERRCNT</name>
							<description>Half Bridge 2-Measurement Failure Error Counter Setting</description>
							<lsb>20</lsb>
							<msb>21</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>2 Events</name>
									<description>Error Flag is set after 2 Events</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4 Events</name>
									<description>Error Flag is set after 4 Events</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8 Events</name>
									<description>Error Flag is set after 8 Events</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>15 Events</name>
									<description>Error Flag is set after 15 Events</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB2T12ONERRCNT</name>
							<description>Half Bridge 2-T12 On Error Counter Setting</description>
							<lsb>18</lsb>
							<msb>19</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>2 Events</name>
									<description>Error Flag is set after 2 Events</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4 Events</name>
									<description>Error Flag is set after 4 Events</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8 Events</name>
									<description>Error Flag is set after 8 Events</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>15 Events</name>
									<description>Error Flag is set after 15 Events</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB2T1OFFERRCNT</name>
							<description>Half Bridge 2-T1 Off Error Counter Setting</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>2 Events</name>
									<description>Error Flag is set after 2 Events</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4 Events</name>
									<description>Error Flag is set after 4 Events</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8 Events</name>
									<description>Error Flag is set after 8 Events</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>15 Events</name>
									<description>Error Flag is set after 15 Events</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB1MFERRCNT</name>
							<description>Half Bridge 1-Measurement Failure Error Counter Setting</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>2 Events</name>
									<description>Error Flag is set after 2 Events</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4 Events</name>
									<description>Error Flag is set after 4 Events</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8 Events</name>
									<description>Error Flag is set after 8 Events</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>15 Events</name>
									<description>Error Flag is set after 15 Events</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB1T12ONERRCNT</name>
							<description>Half Bridge 1-T12 On Error Counter Setting</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>2 Events</name>
									<description>Error Flag is set after 2 Events</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4 Events</name>
									<description>Error Flag is set after 4 Events</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8 Events</name>
									<description>Error Flag is set after 8 Events</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>15 Events</name>
									<description>Error Flag is set after 15 Events</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB1T1OFFERRCNT</name>
							<description>Half Bridge 1-T1 Off Error Counter Setting</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>2 Events</name>
									<description>Error Flag is set after 2 Events</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4 Events</name>
									<description>Error Flag is set after 4 Events</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8 Events</name>
									<description>Error Flag is set after 8 Events</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>15 Events</name>
									<description>Error Flag is set after 15 Events</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ASEQIOFFMAX</name>
					<description>Adaptive Slewrate Sequencer Off Phase Maximum Current Setting</description>
					<addressOffset>0xB4</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>I1OFFMAX</name>
							<description>Slew rate sequencer off-phase 1 max. current setting</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>min. current</name>
									<description>IDISCHGmin</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>max. current</name>
									<description>IDISCHGmax</description>
									<value>0x3F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ASEQIOFFMIN</name>
					<description>Adaptive Slewrate Sequencer Off Phase Minimum Current Setting</description>
					<addressOffset>0xA4</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>I1OFFMIN</name>
							<description>Slew rate sequencer off-phase 1 min. current setting</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>min. current</name>
									<description>IDISCHGmin</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>max. current</name>
									<description>IDISCHGmax</description>
									<value>0x3F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ASEQIONMAX</name>
					<description>Adaptive Slewrate Sequencer On Phase Maximum Current Setting</description>
					<addressOffset>0xB0</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>I1ONMAX</name>
							<description>Slew rate sequencer on-phase 1 max. current setting</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>min. current</name>
									<description>ICHGmin</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>max. current</name>
									<description>ICHGmax</description>
									<value>0x3F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ASEQIONMIN</name>
					<description>Adaptive Slewrate Sequencer On Phase Minimum Current Setting</description>
					<addressOffset>0xA0</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>I1ONMIN</name>
							<description>Slew rate sequencer on-phase 1 min. current setting</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>min. current</name>
									<description>ICHGmin</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>max. current</name>
									<description>ICHGmax</description>
									<value>0x3F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
