cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
				<register>
					<name>ASEQSTS</name>
					<description>Adaptive Slewrate Sequencer Status Register</description>
					<addressOffset>0x94</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>HB2ONMF</name>
							<description>Half Bridge 2- On Adaptive Mode Measurement Failure</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Error</name>
									<description>No Measurement Failure</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Error</name>
									<description>Measurement Failure</description>
									<value>0x1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB2OFFMF</name>
							<description>Half Bridge 2- Off Adaptive Mode Measurement Failure</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Error</name>
									<description>No Measurement Failure</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Error</name>
									<description>Measurement Failure</description>
									<value>0x1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB2I1ONMIN</name>
							<description>Half Bridge 2-I1 On Min Value reached</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Error</name>
									<description>Min Value not reached</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Error</name>
									<description>Min Value reached</description>
									<value>0x1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB2T12ONMIN</name>
							<description>Half Bridge 2-T12 On Min Value reached</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Error</name>
									<description>Min Value not reached</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Error</name>
									<description>Min Value reached</description>
									<value>0x1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB2I1ONMAX</name>
							<description>Half Bridge 2-I1 On Max Value reached</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Error</name>
									<description>Max Value not reached</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Error</name>
									<description>Max Value reached</description>
									<value>0x1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB2T12ONMAX</name>
							<description>Half Bridge 2-T12 On Max Value reached</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Error</name>
									<description>Max Value not reached</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Error</name>
									<description>Max Value reached</description>
									<value>0x1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB2I1OFFMIN</name>
							<description>Half Bridge 2-I1 Off Min Value reached</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Error</name>
									<description>Min Value not reached</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Error</name>
									<description>Min Value reached</description>
									<value>0x1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB2T1OFFMIN</name>
							<description>Half Bridge 2-T1 Off Min Value reached</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Error</name>
									<description>Min Value not reached</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Error</name>
									<description>Min Value reached</description>
									<value>0x1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB2I1OFFMAX</name>
							<description>Half Bridge 2-I1 Off Max Value reached</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Error</name>
									<description>Max Value not reached</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Error</name>
									<description>Max Value reached</description>
									<value>0x1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB2T1OFFMAX</name>
							<description>Half Bridge 2-T1 Off Max Value reached</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Error</name>
									<description>Max Value not reached</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Error</name>
									<description>Max Value reached</description>
									<value>0x1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB1ONMF</name>
							<description>Half Bridge 1-On Adaptive Mode Measurement Failure</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Error</name>
									<description>No Measurement Failure</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Error</name>
									<description>Measurement Failure</description>
									<value>0x1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB1OFFMF</name>
							<description>Half Bridge 1-Off Adaptive Mode Measurement Failure</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Error</name>
									<description>No Measurement Failure</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Error</name>
									<description>Measurement Failure</description>
									<value>0x1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB1I1ONMIN</name>
							<description>Half Bridge 1-I1 On Min Value reached</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Error</name>
									<description>Min Value not reached</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Error</name>
									<description>Min Value reached</description>
									<value>0x1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB1T12ONMIN</name>
							<description>Half Bridge 1-T12 On Min Value reached</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Error</name>
									<description>Min Value not reached</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Error</name>
									<description>Min Value reached</description>
									<value>0x1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB1I1ONMAX</name>
							<description>Half Bridge 1-I1 On Max Value reached</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Error</name>
									<description>Max Value not reached</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Error</name>
									<description>Max Value reached</description>
									<value>0x1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB1T12ONMAX</name>
							<description>Half Bridge 1-T12 On Max Value reached</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Error</name>
									<description>Max Value not reached</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Error</name>
									<description>Max Value reached</description>
									<value>0x1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB1I1OFFMIN</name>
							<description>Half Bridge 1-I1 Off Min Value reached</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Error</name>
									<description>Min Value not reached</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Error</name>
									<description>Min Value reached</description>
									<value>0x1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB1T1OFFMIN</name>
							<description>Half Bridge 1-T1 Off Min Value reached</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Error</name>
									<description>Min Value not reached</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Error</name>
									<description>Min Value reached</description>
									<value>0x1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB1I1OFFMAX</name>
							<description>Half Bridge 1-I1 Off Max Value reached</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Error</name>
									<description>Max Value not reached</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Error</name>
									<description>Max Value reached</description>
									<value>0x1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB1T1OFFMAX</name>
							<description>Half Bridge 1-T1 Off Max Value reached</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Error</name>
									<description>Max Value not reached</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Error</name>
									<description>Max Value reached</description>
									<value>0x1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CP_CLK_CTRL</name>
					<description>Charge Pump Clock Control Register</description>
					<addressOffset>0x24</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>CPCLKDIS_SET</name>
							<description>Charge Pump Clock Set If Disabled</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>Charge Pump Clock is 0 if disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>Charge Pump Clock is 1 if disabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CPCLK_EN</name>
							<description>Charge Pump Clock Enable</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Charge Pump Clock is switched off and has value of according to CPCLKDIS_SET</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Charge Pump Clock is running</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>F_CP</name>
							<description>MSB of CP_CLK divider</description>
							<lsb>13</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DITH_UPPER</name>
							<description>CP_CLK upper frequency boundary during dithering</description>
							<lsb>8</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DITH_LOWER</name>
							<description>CP_CLK lower frequency boundary during dithering</description>
							<lsb>0</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
