cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
				<register>
					<name>CP_CTRL</name>
					<description>Charge Pump Control and Status Register</description>
					<addressOffset>0x20</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>CP_STAGE_SEL</name>
							<description>Charge Pump Output Voltage Trimming</description>
							<lsb>29</lsb>
							<msb>30</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>2-stage</name>
									<description>2-stage mode enabled</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1-stage1</name>
									<description>single stage mode enable (1st stage)</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1-stage2</name>
									<description>single stage mode enable (2nd stage)</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>auto</name>
									<description>automatic switch to single stage mode above 18V VSD (2nd stage) and switching back to 2-stage mode below 17V VSD</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCP14_15V_SEL</name>
							<description>Charge Pump 15V/14V Output Voltage Sel</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>14V</name>
									<description>output voltage set to 14V</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>15V</name>
									<description>output voltage set to 15V</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VTHVCP_TRIM</name>
							<description>Charge Pump Output Voltage Trimming</description>
							<lsb>26</lsb>
							<msb>27</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>0.0_V</name>
									<description>default</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>0.5_V</name>
									<description>plus 0.5V nom at 15V</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1.0_V</name>
									<description>plus 1.0V nom at 15V</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1.5_V</name>
									<description>plus 1.5V nom at 15V</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCP9V_SET</name>
							<description>Charge Pump 9 V Output Voltage Set</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>15_14V Set</name>
									<description>output voltage set according to VCP14_15V_SEL</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>9V Set</name>
									<description>output voltage set to 9V</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CPLOPWRM_EN</name>
							<description>Charge Pump Low Power Mode Enable</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Low Power Mode Disable</name>
									<description>low power mode inactive</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Low Power Mode Enable</name>
									<description>low power mode active</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRVx_VSDUP_DIS</name>
							<description>Driver On VSD Upper Voltage Disable</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Driver Enable</name>
									<description>DRVx on VSD overvoltage enable.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Driver Disable</name>
									<description>DRVx on VSD overvoltage disable.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRVx_VSDLO_DIS</name>
							<description>Driver On VSD Lower Voltage Disable</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Driver Enable</name>
									<description>DRVx on VSD undervoltage enable.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Driver Disable</name>
									<description>DRVx on VSD undervoltage disable.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRVx_VCPUP_DIS</name>
							<description>Driver On Charge Pump Upper Voltage Disable</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Driver Enable</name>
									<description>DRVx on Charge Pumpe overvoltage enable.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Driver Disable</name>
									<description>DRVx on Charge Pump overvoltage disable.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRVx_VCPLO_SDEN</name>
							<description>Driver Charge Pump Low Voltage Shut-Down</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Shut-Down Disable</name>
									<description>DRVx Shut-Down for Charge Pump undervoltage disable.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Shut-Down Enable</name>
									<description>DRVx Shut-Down for Charge Pump undervoltage enable.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRVx_VCPLO_DIS</name>
							<description>Driver On Charge Pump Low Voltage Disable</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Driver Enable</name>
									<description>DRVx on Charge Pump undervoltage enable.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Driver Disable</name>
									<description>DRVx on Charge Pump undervoltage disable.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCP_LOWTH2</name>
							<description>Charge Pump Output Voltage Lower Threshold Detection Level</description>
							<lsb>8</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>7.325_V</name>
									<description>Threshold 0</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>7.654_V</name>
									<description>Threshold 1</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>7.982_V</name>
									<description>Threshold 2</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8.309_V</name>
									<description>Threshold 3</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8.638_V</name>
									<description>Threshold 4</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8.966_V</name>
									<description>Threshold 5</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>9.293_V</name>
									<description>Threshold 6</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>9.620_V</name>
									<description>Threshold 7</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CP_RDY_EN</name>
							<description>Bridge Driver on Charge Pump Ready Enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>OFF</name>
									<description>Bridge Driver can be immediately enabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ON</name>
									<description>Bridge Driver can only be enabled when Charge Pump is ready</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CP_EN</name>
							<description>Charge Pump Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Charge Pump, circuit power off</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Charge Pump, circuit power on</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CP_IRQCLR</name>
					<description>Charge Pump Interrupt Status Clear Register</description>
					<addressOffset>0x44</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>VSD_UPTH_SC</name>
							<description>Driver Supply MU High Status Clear</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VSD_LOTH_SC</name>
							<description>Driver Supply MU Low Status Clear</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCP_UPTH_SC</name>
							<description>Charge Pump MU High Status Clear</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCP_LOTH1_SC</name>
							<description>Charge Pump MU Low Status Clear</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCP_LOTH2_SC</name>
							<description>Charge Pump Low Status Clear</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCP_OTSD_SC</name>
							<description>Charge Pump Over-temperature Shutdown Status Clear</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCP_OTW_SC</name>
							<description>Charge Pump Over-temperature Warning Status Clear</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VSD_UPTH_ISC</name>
							<description>Driver Supply MU High Interrupt Status Clear</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VSD_LOTH_ISC</name>
							<description>Driver Supply MU Low Interrupt Status Clear</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCP_UPTH_ISC</name>
							<description>Charge Pump MU High Interrupt Status Clear</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCP_LOTH1_ISC</name>
							<description>Charge Pump MU Low Interrupt Status Clear</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCP_LOTH2_ISC</name>
							<description>Charge Pump Low Interrupt Status Clear</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCP_OTSD_ISC</name>
							<description>Charge Pump Over-temperature Shutdown Interrupt Status Clear</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCP_OTW_ISC</name>
							<description>Charge Pump Over-temperature Warning Interrupt Status Clear</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CP_IRQEN</name>
					<description>Charge Pump Interrupt Enable Register</description>
					<addressOffset>0x48</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>VSD_UPTH_IEN</name>
							<description>Driver Supply MU High Interrupt Enable</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VSD_LOTH_IEN</name>
							<description>Driver Supply MU Low Interrupt Enable</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCP_UPTH_IEN</name>
							<description>Charge Pump MU High Interrupt Enable</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCP_LOTH1_IEN</name>
							<description>Charge Pump MU Low Interrupt Enable</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCP_LOTH2_IEN</name>
							<description>Charge Pump Low Interrupt Enable</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCP_OTSD_IEN</name>
							<description>Charge Pump Over-temperature Shutdown Interrupt Enable</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCP_OTW_IEN</name>
							<description>Charge Pump Over-temperature Warning Interrupt Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
