cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
				<register>
					<name>CP_IRQS</name>
					<description>Charge Pump Status Register</description>
					<addressOffset>0x40</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>VSD_UPTH_STS</name>
							<description>Driver Supply MU High Status</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ok</name>
									<description>Driver Supply Voltage ok, no overvoltage detected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>too_high</name>
									<description>Driver Supply Voltage too high, overvoltage on VSD Pin detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VSD_LOTH_STS</name>
							<description>Driver Supply MU Low Status</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ok</name>
									<description>Driver Supply Voltage ok, no undervoltage detected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>too_low</name>
									<description>Driver Supply Voltage too low, undervoltage on VSD Pin detected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCP_UPTH_STS</name>
							<description>Charge Pump MU High Status</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ok</name>
									<description>Charge Pump Output Voltage ok, no overvoltage detected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>too_high</name>
									<description>Charge Pump Output Voltage too high, overvoltage on charge pump output detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCP_LOTH1_STS</name>
							<description>Charge Pump MU Low Status</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ok</name>
									<description>Charge Pump Output Voltage ok, no undervoltage detected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>too_low</name>
									<description>Charge Pump Output Voltage too low, undervoltage on chargepump output detected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCP_LOTH2_STS</name>
							<description>Charge Pump Low Status</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ok</name>
									<description>Charge Pump Output Voltage ok, no undervoltage detected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>too_low</name>
									<description>Charge Pump Output Voltage too low, undervoltage on chargepump output detected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCP_OTSD_STS</name>
							<description>Charge Pump Overtemperature Shutdown Status</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ok</name>
									<description>Charge Pump Overtemperature Shutdown Threshold not reached, no charge pump overtemperature shutdown detected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>shutdown</name>
									<description>Charge Pump Overtemperature Shutdown, overtemperature shutdown on charge pump occured.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCP_OTW_STS</name>
							<description>Charge Pump Overtemperature Warning Status</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ok</name>
									<description>Charge Pump Temperature ok, no charge pump overtemperature warning detected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>warning</name>
									<description>harge Pump Overtemperature Warning, overtemperature threshold on charge pump reached.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VSD_UPTH_IS</name>
							<description>Driver Supply MU High Interrupt Status</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ok</name>
									<description>Driver Supply Voltage ok, no overvoltage detected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>too_high</name>
									<description>Driver Supply Voltage too high, overvoltage on VSD Pin detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VSD_LOTH_IS</name>
							<description>Driver Supply MU Low Interrupt Status</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ok</name>
									<description>Driver Supply Voltage ok, no undervoltage detected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>too_low</name>
									<description>Driver Supply Voltage too low, undervoltage on VSD Pin detected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCP_UPTH_IS</name>
							<description>Charge Pump MU High Interrupt Status</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ok</name>
									<description>Charge Pump Output Voltage ok, no overvoltage detected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>too_high</name>
									<description>Charge Pump Output Voltage too high, overvoltage on charge pump output detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCP_LOTH1_IS</name>
							<description>Charge Pump MU Low Interrupt Status</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ok</name>
									<description>Charge Pump Output Voltage ok, no undervoltage detected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>too_low</name>
									<description>Charge Pump Output Voltage too low, undervoltage on charge pump output detected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCP_LOTH2_IS</name>
							<description>Charge Pump Low Interrupt Status</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ok</name>
									<description>Charge Pump Output Voltage ok, no undervoltage detected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>too_low</name>
									<description>Charge Pump Output Voltage too low, undervoltage on chargepump output detected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCP_OTSD_IS</name>
							<description>Charge Pump Overtemperature Shutdown Interrupt Status</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ok</name>
									<description>Charge Pump Overtemperature Shutdown Threshold not reached, no charge pump overtemperature shutdown detected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>shutdown</name>
									<description>Charge Pump Overtemperature Shutdown, overtemperature shutdown on charge pump occured.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCP_OTW_IS</name>
							<description>Charge Pump Overtemperature Warning Interrupt Status</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ok</name>
									<description>Charge Pump Temperature ok, no charge pump overtemperature warning detected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>warning</name>
									<description>Charge Pump Overtemperature Warning, overtemperature threshold on charge pump reached.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
