cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
				<register>
					<name>CTRL1</name>
					<description>H-Bridge Driver Control 1</description>
					<addressOffset>0x00</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>HS2_OC_DIS</name>
							<description>High Side Driver Overcurrent Shutdown Select</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Global_Shutdown</name>
									<description>all bridges will be shut down in case of overcurrent</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Local_Shutdown</name>
									<description>only local driver will be shut down in case of overcurrent</description>
									<value>0x1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS2_SUPERR_STS</name>
							<description>High Side Driver 2 Supply Error Status</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>supply is in required range.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SUPPLY_ERROR</name>
									<description>detected; this flag is an OR of the VSD_x_STS and VCP_x_STS flags.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS2_DCS_EN</name>
							<description>High Side Driver 2 Diagnosis Current Source Enable</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>disable current source</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>enable current source; short diagnosis can be performed by evaluating the LSx/HSx_DS_STS Flag</description>
									<value>0x1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS2_ON</name>
							<description>High Side Driver 2 On</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>OFF</name>
									<description>Driver off</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ON</name>
									<description>Driver on</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS2_PWM</name>
							<description>High Side Driver 2 PWM Enable</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>disables control by PWM input</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>enables control by PWM input</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS2_EN</name>
							<description>High Side Driver 2 Enable</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Driver circuit power off</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Driver circuit power on</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS1_OC_DIS</name>
							<description>High Side Driver Overcurrent Shutdown Select</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Global_Shutdown</name>
									<description>all bridges will be shut down in case of overcurrent</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Local_Shutdown</name>
									<description>only local driver will be shut down in case of overcurrent</description>
									<value>0x1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS1_SUPERR_STS</name>
							<description>High Side Driver 1 Supply Error Status</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>supply is in required range.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SUPPLY_ERROR</name>
									<description>detected; this flag is an OR of the VDS_x_STS and VCP_x_STS flags.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS1_DCS_EN</name>
							<description>High Side Driver 1 Diagnosis Current Source Enable</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>disable current source</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>enable current source; short diagnosis can be performed by evaluating the LSx/HSx_DS_STS Flag</description>
									<value>0x1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS1_ON</name>
							<description>High Side Driver 1 On</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>OFF</name>
									<description>Driver off</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ON</name>
									<description>Driver on</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS1_PWM</name>
							<description>High Side Driver 1 PWM Enable</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>disables control by PWM input</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>enables control by PWM input</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS1_EN</name>
							<description>High Side Driver 1 Enable</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Driver circuit power off</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Driver circuit power on</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS2_OC_DIS</name>
							<description>Low Side Driver Overcurrent Shutdown Select</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Global_Shutdown</name>
									<description>all bridges will be shut down in case of overcurrent</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Local_Shutdown</name>
									<description>only local driver will be shut down in case of overcurrent</description>
									<value>0x1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS2_SUPERR_STS</name>
							<description>Low Side Driver 2 Supply Error Status</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>supply is in required range.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SUPPLY_ERROR</name>
									<description>detected; this flag is an OR of the VDS_x_STS and VCP_x_STS flags.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS2_ON</name>
							<description>Low Side Driver 2 On</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>OFF</name>
									<description>Driver off</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ON</name>
									<description>Driver on</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS2_PWM</name>
							<description>Low Side Driver 2 PWM Enable</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>disables control by PWM input</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>enables control by PWM input</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS2_EN</name>
							<description>Low Side Driver 2 Enable</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Driver circuit power off</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Driver circuit power on</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS1_OC_DIS</name>
							<description>Low Side Driver 1 Overcurrent Shutdown Select</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Global_Shutdown</name>
									<description>all bridges will be shut down in case of overcurrent</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Local_Shutdown</name>
									<description>only local driver will be shut down in case of overcurrent</description>
									<value>0x1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS1_SUPERR_STS</name>
							<description>Low Side Driver 1 Supply Error Status</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>supply is in required range.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SUPPLY_ERROR</name>
									<description>detected; this flag is an OR of the VDS_x_STS and VCP_x_STS flags.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS1_ON</name>
							<description>Low Side Driver 1 On</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>OFF</name>
									<description>Driver off</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ON</name>
									<description>Driver on</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS1_PWM</name>
							<description>Low Side Driver 1 PWM Enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>disables control by PWM input</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>enables control by PWM input</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS1_EN</name>
							<description>Low Side Driver 1 Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Driver circuit power off</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Driver circuit power on</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CTRL2</name>
					<description>H-Bridge Driver Control 2</description>
					<addressOffset>0x04</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>DLY_DIAG_DIRSEL</name>
							<description>Ext. power diag timer on / off select</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>TURN OFF</name>
									<description>measure turn off time</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TURN ON</name>
									<description>measure turn on time</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DLY_DIAG_CHSEL</name>
							<description>Ext. power diag timer channel select</description>
							<lsb>28</lsb>
							<msb>30</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>diag timer deactivated.</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HB1 LS select</name>
									<description>measure LS1 on/off delay time.</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HB2 LS select</name>
									<description>measure LS2 on/off delay time.</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HB1 HS select</name>
									<description>measure HS1 on/off delay time.</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HB2 HS select</name>
									<description>measure HS2 on/off delay time.</description>
									<value>0b110</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DLY_DIAG_STS</name>
							<description>Ext. power diag timer valid flag</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Diag_timer_invalid</name>
									<description>diag timer measurement ongoing</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Diag_timer_valid</name>
									<description>diag timer measurement finished</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DLY_DIAG_SCLR</name>
							<description>Ext. power diag timer valid flag clear</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Diag timer valid not clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Diag timer valid clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DLY_DIAG_TIM</name>
							<description>Ext. power diag timer result register</description>
							<lsb>16</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>HB2OFFSEQCNF</name>
							<description>Half Bridge 2 Off Sequencer Configuration</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Normal Mode</name>
									<description>OFF-Sequencer is disabled and driver operates with constant current.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Sequencer Mode</name>
									<description>OFF-Sequencer is enabled.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB1OFFSEQCNF</name>
							<description>Half Bridge 1 Off Sequencer Configuration</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Normal Mode</name>
									<description>OFF-Sequencer is disabled and driver operates with constant current.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Sequencer Mode</name>
									<description>OFF-Sequencer is enabled.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB2ONSEQCNF</name>
							<description>Half Bridge 2 On Sequencer Configuration</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Normal Mode</name>
									<description>ON-Sequencer is disabled and driver operates with constant current.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Sequencer Mode</name>
									<description>ON-Sequencer is enabled.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB1ONSEQCNF</name>
							<description>Half Bridge 1 On Sequencer Configuration</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Normal Mode</name>
									<description>ON-Sequencer is disabled and driver operates with constant current.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Sequencer Mode</name>
									<description>ON-Sequencer is enabled.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
