cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
				<register>
					<name>CTRL3</name>
					<description>H-Bridge Driver Control 3</description>
					<addressOffset>0x08</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>DRV_CCP_DIS</name>
							<description>Dynamic cross conduction protection Disable</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CCP Enable</name>
									<description>dynamic ccp is active.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCP Disable</name>
									<description>dynamic ccp is disabled, delayed gate clamp remains active.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRV_CCP_TMUL</name>
							<description>Multiplier bits for cross conduction time settings in register DRV_CCP_TIMSEL</description>
							<lsb>28</lsb>
							<msb>29</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>MUL1</name>
									<description>DRV_CCP_TIMSEL value is multiplied by 1</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MUL2</name>
									<description>DRV_CCP_TIMSEL value is multiplied by 2</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MUL4</name>
									<description>DRV_CCP_TIMSEL value is multiplied by 4</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MUL8</name>
									<description>DRV_CCP_TIMSEL value is multiplied by 8</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRV_CCP_TIMSEL</name>
							<description>Minimum cross conduction protection time setting</description>
							<lsb>24</lsb>
							<msb>25</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>0.2us</name>
									<description>200ns cross conduction protection time</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>0.4us</name>
									<description>400ns cross conduction protection time</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>0.8us</name>
									<description>800ns cross conduction protection time</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1.6us</name>
									<description>1.6us cross conduction protection time</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DSMONVTH</name>
							<description>Voltage Threshold for Drain-Source Monitoring of external FETs</description>
							<lsb>16</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>0.125_V</name>
									<description>Threshold 0 for VDS at 0.125 V</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>0.25_V</name>
									<description>Threshold 1 for VDS at 0.25 V</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>0.50_V</name>
									<description>Threshold 2 for VDS at 0.50 V</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>0.75_V</name>
									<description>Threshold 3 for VDS at 0.75 V</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1.00_V</name>
									<description>Threshold 4 for VDS at 1.00 V</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1.25_V</name>
									<description>Threshold 5 for VDS at 1.25 V</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1.50_V</name>
									<description>Threshold 6 for VDS at 1.50 V</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1.75_V</name>
									<description>Threshold 7 for VDS at 1.75 V</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>DCTRIM_DRVx</name>
					<description>Current Trimming of Driver</description>
					<addressOffset>0xE0</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>COMPENS_LS</name>
							<description>Gain Settings for Low Side Charge Current Compensation</description>
							<lsb>16</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Dynamic Compensation is disabled.</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>gain_1</name>
									<description>gain setting 1 (min)</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>gain_2</name>
									<description>gain setting 2</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>gain_3</name>
									<description>gain setting 3</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>gain_4</name>
									<description>gain setting 4 (max)</description>
									<value>0b100</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>COMPENS_HS</name>
							<description>Current Settings for High Side Charge Current Compensation</description>
							<lsb>8</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Dynamic Compensation is disabled.</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>gain_1</name>
									<description>gain setting 1 (min)</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>gain_2</name>
									<description>gain setting 2</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>gain_3</name>
									<description>gain setting 3</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>gain_4</name>
									<description>gain setting 4 (max)</description>
									<value>0b100</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>HB1ASEQOFFVAL</name>
					<description>Half Bridge 1 Adaptive Sequencer Off Values</description>
					<addressOffset>0xBC</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>HB1_OFFVALVF_CLR</name>
							<description>Half Bridge 1-Turn off slew rate values Valid Flag - Clear.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT CLEAR</name>
									<description>no clear of HB1_OFFVALVF flag</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR</name>
									<description>clear of HB1_OFFVALVF flag</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB1_OFFVALVF</name>
							<description>Half Bridge 1-Turn off slew rate values - Valid Flag.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT VALID</name>
									<description>no new valid LS1/HS1_OFF values available</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VALID</name>
									<description>LS1/HS1_OFF fields contain valid data and have not been read</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB1_T2MERR</name>
							<description>Half Bridge 1-T2 Measurement Error.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>VALID</name>
									<description>T2 value valid</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ERROR</name>
									<description>T2 value not valid - Measurement Error</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB1_T2OFFCNT</name>
							<description>Half Bridge 1-Turn off slew rate-time value measured from beginning of phase 2 to end of phase 2.</description>
							<lsb>16</lsb>
							<msb>21</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3.2us</name>
									<description>3.2us phase duration</description>
									<value>0x3F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB1_I1OFFVAL</name>
							<description>Half Bridge 1-slew rate sequencer off-phase 1 current setting</description>
							<lsb>8</lsb>
							<msb>13</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>min. current</name>
									<description>ICHGmin</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>max. current</name>
									<description>ICHGmax</description>
									<value>0x3F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB1_T1OFFCNT</name>
							<description>Half Bridge 1-Turn off slew rate-time value measured from beginning of phase 1 to end of phase 1.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>12.8us</name>
									<description>12.8us phase duration</description>
									<value>0xFF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>HB1ASEQONVAL</name>
					<description>Half Bridge 1 Adaptive Sequencer On Values</description>
					<addressOffset>0xB8</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>HB1_ONVALVF_CLR</name>
							<description>Half Bridge 1-Turn on slew rate values Valid Flag - Clear.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT CLEAR</name>
									<description>no clear of HB1_ONVALVF flag</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR</name>
									<description>clear of HB1_ONVALVF flag</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB1_ONVALVF</name>
							<description>Half Bridge 1-Turn on slew rate values - Valid Flag.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT VALID</name>
									<description>no new valid LS1/HS1_ON values available</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VALID</name>
									<description>LS1/HS1_ON fields contain valid data and have not been read</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB1_T3MERR</name>
							<description>Half Bridge 1-T3 Measurement Error.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>VALID</name>
									<description>T3 value valid</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ERROR</name>
									<description>T3 value not valid - Measurement Error</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB1_T3ONCNT</name>
							<description>Half Bridge 1-Turn on slew rate-time value measured from beginning of phase 3 to end of phase 3.</description>
							<lsb>16</lsb>
							<msb>21</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3.2us</name>
									<description>3.2us phase duration</description>
									<value>0x3F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB1_I1ONVAL</name>
							<description>Half Bridge 1-slew rate sequencer on-phase 1 current setting</description>
							<lsb>8</lsb>
							<msb>13</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>min. current</name>
									<description>ICHGmin</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>max. current</name>
									<description>ICHGmax</description>
									<value>0x3F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB1_T12ONCNT</name>
							<description>Half Bridge 1-Turn on slew rate-time value measured from beginning of phase 1 to end of phase 2.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>12.8us</name>
									<description>12.8us phase duration</description>
									<value>0xFF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>HB2ASEQOFFVAL</name>
					<description>Half Bridge 2 Adaptive Sequencer Off Values</description>
					<addressOffset>0xD4</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>HB2_OFFVALVF_CLR</name>
							<description>Half Bridge 2-Turn off slew rate values Valid Flag - Clear.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT CLEAR</name>
									<description>no clear of HB2_OFFVALVF flag</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR</name>
									<description>clear of HB2_OFFVALVF flag</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB2_OFFVALVF</name>
							<description>Half Bridge 2-Turn off slew rate values - Valid Flag.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT VALID</name>
									<description>no new valid LS2/HS2_OFF values available</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VALID</name>
									<description>LS2/HS2_OFF fields contain valid data and have not been read</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB2_T2MERR</name>
							<description>Half Bridge 2-T2 Measurement Error.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>VALID</name>
									<description>T2 value valid</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ERROR</name>
									<description>T2 value not valid - Measurement Error</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB2_T2OFFCNT</name>
							<description>Half Bridge 2-Turn off slew rate-time value measured from beginning of phase 2 to end of phase 2.</description>
							<lsb>16</lsb>
							<msb>21</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3.2us</name>
									<description>3.2us phase duration</description>
									<value>0x3F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB2_I1OFFVAL</name>
							<description>Half Bridge 2-slew rate sequencer off-phase 1 current setting</description>
							<lsb>8</lsb>
							<msb>13</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>min. current</name>
									<description>ICHGmin</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>max. current</name>
									<description>ICHGmax</description>
									<value>0x3F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB2_T1OFFCNT</name>
							<description>Half Bridge 2-Turn off slew rate-time value measured from beginning of phase 1 to end of phase 1.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>12.8us</name>
									<description>12.8us phase duration</description>
									<value>0xFF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
