cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
				<register>
					<name>HB2ASEQONVAL</name>
					<description>Half Bridge 2 Adaptive Sequencer On Values</description>
					<addressOffset>0xD0</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>HB2_ONVALVF_CLR</name>
							<description>Half Bridge 2-Turn on slew rate values Valid Flag - Clear.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT CLEAR</name>
									<description>no clear of HB2_ONVALVF flag</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR</name>
									<description>clear of HB2_ONVALVF flag</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB2_ONVALVF</name>
							<description>Half Bridge 2-Turn on slew rate values - Valid Flag.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT VALID</name>
									<description>no new valid LS2/HS2_ON values available</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VALID</name>
									<description>LS2/HS2_ON fields contain valid data and have not been read</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB2_T3MERR</name>
							<description>Half Bridge 2-T3 Measurement Error.</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>VALID</name>
									<description>T3 value valid</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ERROR</name>
									<description>T3 value not valid - Measurement Error</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB2_T3ONCNT</name>
							<description>Half Bridge 2-Turn on slew rate-time value measured from beginning of phase 3 to end of phase 3.</description>
							<lsb>16</lsb>
							<msb>21</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3.2us</name>
									<description>3.2us phase duration</description>
									<value>0x3F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB2_I1ONVAL</name>
							<description>Half Bridge 2-slew rate sequencer on-phase 1 current setting</description>
							<lsb>8</lsb>
							<msb>13</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>min. current</name>
									<description>ICHGmin</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>max. current</name>
									<description>ICHGmax</description>
									<value>0x3F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB2_T12ONCNT</name>
							<description>Half Bridge 2-Turn on slew rate-time value measured from beginning of phase 1 to end of phase 2.</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>12.8us</name>
									<description>12.8us phase duration</description>
									<value>0xFF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>IGATECLMPOFFC</name>
					<description>Gate Current Clamping Value in OFF State</description>
					<addressOffset>0x34</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>HB2AF_ICLMPOFF</name>
							<description>Half Bridge 2-active freewheeling-current clamping value for OFF state</description>
							<lsb>24</lsb>
							<msb>29</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>min. current</name>
									<description>IDISCHGmin</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>max. current</name>
									<description>IDISCHGmax</description>
									<value>0x3F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB1AF_ICLMPOFF</name>
							<description>Half Bridge 1-active freewheeling-current clamping value for OFF state</description>
							<lsb>16</lsb>
							<msb>21</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>min. current</name>
									<description>IDISCHGmin</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>max. current</name>
									<description>IDISCHGmax</description>
									<value>0x3F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB2_ICLMPOFF</name>
							<description>Half Bridge 2-current clamping value for OFF state</description>
							<lsb>8</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>min. current</name>
									<description>IDISCHGmin</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>max. current</name>
									<description>IDISCHGmax</description>
									<value>0x3F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB1_ICLMPOFF</name>
							<description>Half Bridge 1-current clamping value for OFF state</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>min. current</name>
									<description>IDISCHGmin</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>max. current</name>
									<description>IDISCHGmax</description>
									<value>0x3F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>IGATECLMPONC</name>
					<description>Gate Current Clamping Value in ON State</description>
					<addressOffset>0x30</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>HB2AF_ICLMPON</name>
							<description>Half Bridge 2-active freewheeling-current clamping value for ON state</description>
							<lsb>24</lsb>
							<msb>29</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>min. current</name>
									<description>ICHGmin</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>max. current</name>
									<description>ICHGmax</description>
									<value>0x3F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB1AF_ICLMPON</name>
							<description>Half Bridge 1-active freewheeling-current clamping value for ON state</description>
							<lsb>16</lsb>
							<msb>21</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>min. current</name>
									<description>ICHGmin</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>max. current</name>
									<description>ICHGmax</description>
									<value>0x3F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB2_ICLMPON</name>
							<description>Half Bridge 2-current clamping value for ON state</description>
							<lsb>8</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>min. current</name>
									<description>ICHGmin</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>max. current</name>
									<description>ICHGmax</description>
									<value>0x3F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB1_ICLMPON</name>
							<description>Half Bridge 1-current clamping value for ON state</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>min. current</name>
									<description>ICHGmin</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>max. current</name>
									<description>ICHGmax</description>
									<value>0x3F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>IRQCLR</name>
					<description>H-Bridge Driver Interrupt Status Clear Register</description>
					<addressOffset>0xF4</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>SEQ_ERR_ISC</name>
							<description>Driver Sequence Error Status Clear</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS2_OC_ISC</name>
							<description>External High Side 2 FET Over-current Status Clear</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS2_DS_SC</name>
							<description>High Side Driver 2 Drain Source Monitoring Status Clear in OFF-State</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS2_DS_ISC</name>
							<description>High Side Driver 2 Drain Source Monitoring Interrupt Status Clear in OFF-State</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS1_OC_ISC</name>
							<description>External High Side 1 FET Over-current Status Clear</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS1_DS_SC</name>
							<description>High Side Driver 1 Drain Source Monitoring Status Clear in OFF-State</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS1_DS_ISC</name>
							<description>High Side Driver 1 Drain Source Monitoring Interrupt Status Clear in OFF-State</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS2_OC_ISC</name>
							<description>External Low Side 2 FET Over-current Status Clear</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS2_DS_SC</name>
							<description>Low Side Driver 2 Drain Source Monitoring Status Clear in OFF-State</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS2_DS_ISC</name>
							<description>Low Side Driver 2 Drain Source Monitoring Interrupt Status Clear in OFF-State</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS1_OC_ISC</name>
							<description>External Low Side 1 FET Over-current Status Clear</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS1_DS_SC</name>
							<description>Low Side Driver 1 Drain Source Monitoring Status Clear in OFF-State</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS1_DS_ISC</name>
							<description>Low Side Driver 1 Drain Source Monitoring Interrupt Status Clear in OFF-State</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB2_ASEQ_ISC</name>
							<description>Half Bridge 2 Adaptive Sequencer Interrupt Status Clear</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB1_ASEQ_ISC</name>
							<description>Half Bridge 1 Adaptive Sequencer Interrupt Status Clear</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>IRQEN</name>
					<description>H-Bridge Driver Control</description>
					<addressOffset>0xF8</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>SEQ_ERR_IEN</name>
							<description>Driver Sequence Error Interrupt Enable</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS2_OC_IEN</name>
							<description>External High Side 2 FET Over-current Interrupt Enable</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS2_DS_IEN</name>
							<description>High Side Driver 2 Drain Source Monitoring Interrupt Enable in OFF-State</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS1_OC_IEN</name>
							<description>External High Side 1 FET Over-current Interrupt Enable</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS1_DS_IEN</name>
							<description>High Side Driver 1 Drain Source Monitoring Interrupt Enable in OFF-State</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS2_OC_IEN</name>
							<description>External Low Side 2 FET Over-current Interrupt Enable</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS2_DS_IEN</name>
							<description>Low Side Driver 2 Drain Source Monitoring Interrupt Enable in OFF-State</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS1_OC_IEN</name>
							<description>External Low Side 1 FET Over-current Interrupt Enable</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS1_DS_IEN</name>
							<description>Low Side Driver 1 Drain Source Monitoring Interrupt Enable in OFF-State</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB2_ASEQ_IEN</name>
							<description>Half Bridge 2 Adaptive Sequencer Interrupt Enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB1_ASEQ_IEN</name>
							<description>Half Bridge 1 Adaptive Sequencer Interrupt Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
