cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
				<register>
					<name>IRQS</name>
					<description>H-Bridge Driver Interrupt Status</description>
					<addressOffset>0xF0</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>SEQ_ERR_IS</name>
							<description>Driver Sequence Error Interrupt Status</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Driver Sequence ok</name>
									<description>no cross current</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Driver Sequence fail</name>
									<description>HS and LS of same bridge concurrently activated, output protection activated</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS2_OC_IS</name>
							<description>External High Side 2 FET Over-current Interrupt Status</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Over-current</name>
									<description>no over-current Condition occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Over-current</name>
									<description>over-current occurred; switch is automatically shut down.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS2_DS_STS</name>
							<description>High Side Driver 2 Drain Source Monitoring Status in OFF-State</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no short on external FET</name>
									<description>no short detected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>short on external FET detected</name>
									<description>short detected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS2_DS_IS</name>
							<description>High Side Driver 2 Drain Source Monitoring Interrupt Status in OFF-State</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no short on external FET</name>
									<description>no short detected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>short on external FET detected</name>
									<description>short detected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS1_OC_IS</name>
							<description>External High Side 1 FET Over-current Interrupt Status</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Over-current</name>
									<description>no over-current Condition occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Over-current</name>
									<description>over-current occurred; switch is automatically shutdown.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS1_DS_STS</name>
							<description>High Side Driver 1 Drain Source Monitoring Status in OFF-State</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no short on external FET</name>
									<description>no short detected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>short on external FET detected</name>
									<description>short detected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS1_DS_IS</name>
							<description>High Side Driver 1 Drain Source Monitoring Interrupt Status in OFF-State</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no short on external FET</name>
									<description>no short detected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>short on external FET detected</name>
									<description>short detected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS2_OC_IS</name>
							<description>External Low Side 2 FET Over-current Interrupt Status</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Over-current</name>
									<description>no over-current Condition occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Over-current</name>
									<description>over-current occurred; switch is automatically shutdown.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS2_DS_STS</name>
							<description>Low Side Driver 2 Drain Source Monitoring Status in OFF-State</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no short on external FET</name>
									<description>no short detected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>short on external FET detected</name>
									<description>short detected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS2_DS_IS</name>
							<description>Low Side Driver 2 Drain Source Monitoring Interrupt Status in OFF-State</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no short on external FET</name>
									<description>no short detected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>short on external FET detected</name>
									<description>short detected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS1_OC_IS</name>
							<description>External Low Side 1 FET Over-current Interrupt Status</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Over-current</name>
									<description>no over-current Condition occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Over-current</name>
									<description>over-current occurred; switch is automatically shutdown.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS1_DS_STS</name>
							<description>Low Side Driver 1 Drain Source Monitoring Status in OFF-State</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no short on external FET</name>
									<description>no short detected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>short on external FET detected</name>
									<description>short detected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS1_DS_IS</name>
							<description>Low Side Driver 1 Drain Source Monitoring Interrupt Status in OFF-State</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no short on external FET</name>
									<description>no short detected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>short on external FET detected</name>
									<description>short detected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB2_ASEQ_IS</name>
							<description>Half Bridge 2 Adaptive Sequencer Interrupt Status</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no error in SEQ</name>
									<description>no sequencer Error detected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>error in SEQ</name>
									<description>sequencer Error detected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB1_ASEQ_IS</name>
							<description>Half Bridge 1 Adaptive Sequencer Interrupt Status</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no error in SEQ</name>
									<description>no sequencer Error detected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>error in SEQ</name>
									<description>sequencer Error detected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>OFFASEQTMAX</name>
					<description>Adaptive Slewrate Off Sequencer Maximum Time Setting</description>
					<addressOffset>0xAC</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>T1OFFMAX</name>
							<description>Slew rate sequencer off-phase 1 max. time setting</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>12.8us</name>
									<description>12.8us phase duration</description>
									<value>0xFF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>OFFASEQTMIN</name>
					<description>Turn OFF Adaptive Slewrate Sequencer Minimum Time Setting</description>
					<addressOffset>0x9C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>HB2T1OFFADDDLY</name>
							<description>HB2 adaptive sequencer T1OFF additional delay setting.</description>
							<lsb>12</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>0ns</name>
									<description>0ns added to HB2T1OFF</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>750ns</name>
									<description>750ns added to HB2T1OFF</description>
									<value>0xF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB1T1OFFADDDLY</name>
							<description>HB1 adaptive sequencer T1OFF additional delay setting.</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>0ns</name>
									<description>0ns added to HB1T1OFF</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>750ns</name>
									<description>750ns added to HB1T1OFF</description>
									<value>0xF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T1OFFMIN</name>
							<description>Slew rate sequencer off-phase 1 min. time setting</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>12.8us</name>
									<description>12.8us phase duration</description>
									<value>0xFF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>OFFSEQHB1IC</name>
					<description>Turn-off Slewrate Sequencer Half Bridge 1 Current Control</description>
					<addressOffset>0x54</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>HB1_I4OFF</name>
							<description>Half Bridge 1-slew rate sequencer off-phase 4 current setting</description>
							<lsb>24</lsb>
							<msb>29</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>min. current</name>
									<description>IDISCHGmin</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>max. current</name>
									<description>IDISCHGmax</description>
									<value>0x3F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB1_I3OFF</name>
							<description>Half Bridge 1-slew rate sequencer off-phase 3 current setting</description>
							<lsb>16</lsb>
							<msb>21</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>min. current</name>
									<description>IDISCHGmin</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>max. current</name>
									<description>IDISCHGmax</description>
									<value>0x3F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB1_I2OFF</name>
							<description>Half Bridge 1-slew rate sequencer-off phase 2 current setting</description>
							<lsb>8</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>min. current</name>
									<description>IDISCHGmin</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>max. current</name>
									<description>IDISCHGmax</description>
									<value>0x3F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB1_I1OFF</name>
							<description>Half Bridge 1-slew rate sequencer off-phase 1 current setting</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>min. current</name>
									<description>IDISCHGmin</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>max. current</name>
									<description>IDISCHGmax</description>
									<value>0x3F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>OFFSEQHB1TC</name>
					<description>Turn-off Slewrate Sequencer Half Bridge 1 Time Control</description>
					<addressOffset>0x50</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>HB1_T4OFF</name>
							<description>Half Bridge 1-slew rate sequencer off-phase 4 time setting</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>12.8us</name>
									<description>12.8us phase duration</description>
									<value>0xFF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB1_T3OFF</name>
							<description>Half Bridge 1-slew rate sequencer off-phase 3 time setting</description>
							<lsb>16</lsb>
							<msb>21</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3.2us</name>
									<description>3.2us phase duration</description>
									<value>0x3F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB1_T2OFF</name>
							<description>Half Bridge 1-slew rate sequencer off-phase 2 time setting</description>
							<lsb>8</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3.2us</name>
									<description>3.2us phase duration</description>
									<value>0x3F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB1_T1OFF</name>
							<description>Half Bridge 1-slew rate sequencer off-phase 1 time setting</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>12.8us</name>
									<description>12.8us phase duration</description>
									<value>0xFF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>OFFSEQHB2IC</name>
					<description>Turn-off Slewrate Sequencer Half Bridge 2 Current Control</description>
					<addressOffset>0x74</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>HB2_I4OFF</name>
							<description>Half Bridge 2-slew rate sequencer off-phase 4 current setting</description>
							<lsb>24</lsb>
							<msb>29</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>min. current</name>
									<description>IDISCHGmin</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>max. current</name>
									<description>IDISCHGmax</description>
									<value>0x3F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB2_I3OFF</name>
							<description>Half Bridge 2-slew rate sequencer off-phase 3 current setting</description>
							<lsb>16</lsb>
							<msb>21</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>min. current</name>
									<description>IDISCHGmin</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>max. current</name>
									<description>IDISCHGmax</description>
									<value>0x3F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB2_I2OFF</name>
							<description>Half Bridge 2-slew rate sequencer off-phase 2 current setting</description>
							<lsb>8</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>min. current</name>
									<description>IDISCHGmin</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>max. current</name>
									<description>IDISCHGmax</description>
									<value>0x3F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB2_I1OFF</name>
							<description>Half Bridge 2-slew rate sequencer off-phase 1 current setting</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>min. current</name>
									<description>IDISCHGmin</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>max. current</name>
									<description>IDISCHGmax</description>
									<value>0x3F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
