cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
				<register>
					<name>OFFSEQHB2TC</name>
					<description>Turn-off Slewrate Sequencer Half Bridge 2 Time Control</description>
					<addressOffset>0x70</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>HB2_T4OFF</name>
							<description>Half Bridge 2-slew rate sequencer off-phase 4 time setting</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>12.8us</name>
									<description>12.8us phase duration</description>
									<value>0xFF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB2_T3OFF</name>
							<description>Half Bridge 2-slew rate sequencer off-phase 3 time setting</description>
							<lsb>16</lsb>
							<msb>21</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3.2us</name>
									<description>3.2us phase duration</description>
									<value>0x3F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB2_T2OFF</name>
							<description>Half Bridge 2-slew rate sequencer off-phase 2 time setting</description>
							<lsb>8</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3.2us</name>
									<description>3.2us phase duration</description>
									<value>0x3F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB2_T1OFF</name>
							<description>Half Bridge 2-slew rate sequencer off-phase 1 time setting</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>12.8us</name>
									<description>12.8us phase duration</description>
									<value>0xFF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ONASEQTMAX</name>
					<description>Adaptive Slewrate On Sequencer Maximum Time Setting</description>
					<addressOffset>0xA8</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>T12ONMAX</name>
							<description>Slew rate sequencer on-phase 12 max. time setting</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>12.8us</name>
									<description>12.8us phase duration</description>
									<value>0xFF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ONASEQTMIN</name>
					<description>Turn ON Adaptive Slewrate Sequencer Minimum Time Setting</description>
					<addressOffset>0x98</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>T12ONMIN</name>
							<description>Slew rate sequencer on-phase 12 min. time setting</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>12.8us</name>
									<description>12.8us phase duration</description>
									<value>0xFF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ONSEQHB1IC</name>
					<description>Turn-on Slewrate Sequencer Half Bridge 1 Current Control</description>
					<addressOffset>0x5C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>HB1_I4ON</name>
							<description>Half Bridge 1-slew rate sequencer on-phase 4 current setting</description>
							<lsb>24</lsb>
							<msb>29</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>min. current</name>
									<description>ICHGmin</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>max. current</name>
									<description>ICHGmax</description>
									<value>0x3F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB1_I3ON</name>
							<description>Half Bridge 1-slew rate sequencer on-phase 3 current setting</description>
							<lsb>16</lsb>
							<msb>21</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>min. current</name>
									<description>ICHGmin</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>max. current</name>
									<description>ICHGmax</description>
									<value>0x3F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB1_I2ON</name>
							<description>Half Bridge 1-slew rate sequencer on-phase 2 current setting</description>
							<lsb>8</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>min. current</name>
									<description>ICHGmin</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>max. current</name>
									<description>ICHGmax</description>
									<value>0x3F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB1_I1ON</name>
							<description>Half Bridge 1-slew rate sequencer on-phase 1 current setting</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>min. current</name>
									<description>ICHGmin</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>max. current</name>
									<description>ICHGmax</description>
									<value>0x3F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ONSEQHB1TC</name>
					<description>Turn-on Slewrate Sequencer Half Bridge 1 Time Control</description>
					<addressOffset>0x58</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>HB1_T4ON</name>
							<description>Half Bridge 1-slew rate sequencer on-phase 4 time setting</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>12.8us</name>
									<description>12.8us phase duration</description>
									<value>0xFF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB1_T3ON</name>
							<description>Half Bridge 1-slew rate sequencer on-phase 3 time setting</description>
							<lsb>16</lsb>
							<msb>21</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3.2us</name>
									<description>3.2us phase duration</description>
									<value>0x3F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB1_T2ON</name>
							<description>Half Bridge 1-slew rate sequencer on-phase 2 time setting</description>
							<lsb>8</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3.2us</name>
									<description>3.2us phase duration</description>
									<value>0x3F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB1_T1ON</name>
							<description>Half Bridge 1-slew rate sequencer on-phase 1 time setting</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>12.8us</name>
									<description>12.8us phase duration</description>
									<value>0xFF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ONSEQHB2IC</name>
					<description>Turn-on Slewrate Sequencer Half Bridge 2 Current Control</description>
					<addressOffset>0x7C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>HB2_I4ON</name>
							<description>Half Bridge 2-slew rate sequencer on-phase 4 current setting</description>
							<lsb>24</lsb>
							<msb>29</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>min. current</name>
									<description>ICHGmin</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>max. current</name>
									<description>ICHGmax</description>
									<value>0x3F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB2_I3ON</name>
							<description>Half Bridge 2-slew rate sequencer on-phase 3 current setting</description>
							<lsb>16</lsb>
							<msb>21</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>min. current</name>
									<description>ICHGmin</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>max. current</name>
									<description>ICHGmax</description>
									<value>0x3F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB2_I2ON</name>
							<description>Half Bridge 2-slew rate sequencer on-phase 2 current setting</description>
							<lsb>8</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>min. current</name>
									<description>ICHGmin</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>max. current</name>
									<description>ICHGmax</description>
									<value>0x3F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB2_I1ON</name>
							<description>Half Bridge 2-slew rate sequencer on-phase 1 current setting</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>min. current</name>
									<description>ICHGmin</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>max. current</name>
									<description>ICHGmax</description>
									<value>0x3F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ONSEQHB2TC</name>
					<description>Turn-on Slewrate Sequencer Half Bridge 2 Time Control</description>
					<addressOffset>0x78</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>HB2_T4ON</name>
							<description>Half Bridge 2-slew rate sequencer on-phase 4 time setting</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>12.8us</name>
									<description>12.8us phase duration</description>
									<value>0xFF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB2_T3ON</name>
							<description>Half Bridge 2-slew rate sequencer on-phase 3 time setting</description>
							<lsb>16</lsb>
							<msb>21</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3.2us</name>
									<description>3.2us phase duration</description>
									<value>0x3F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB2_T2ON</name>
							<description>Half Bridge 2-slew rate sequencer on-phase 2 time setting</description>
							<lsb>8</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3.2us</name>
									<description>3.2us phase duration</description>
									<value>0x3F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB2_T1ON</name>
							<description>Half Bridge 2-slew rate sequencer on-phase 1 time setting</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>12.8us</name>
									<description>12.8us phase duration</description>
									<value>0xFF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PWMSRCSEL</name>
					<description>PWM Source Selection Register</description>
					<addressOffset>0x0C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>HS2_SRC_SEL</name>
							<description>HS2 PWM Source Selection</description>
							<lsb>19</lsb>
							<msb>20</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CC60</name>
									<description>PWM output of CCU6</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC61</name>
									<description>PWM output of CCU6</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUT60</name>
									<description>PWM output of CCU6</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUT61</name>
									<description>PWM output of CCU6</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS1_SRC_SEL</name>
							<description>HS1 PWM Source Selection</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CC60</name>
									<description>PWM output of CCU6</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC61</name>
									<description>PWM output of CCU6</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUT60</name>
									<description>PWM output of CCU6</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUT61</name>
									<description>PWM output of CCU6</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS2_SRC_SEL</name>
							<description>LS2 PWM Source Selection</description>
							<lsb>3</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CC60</name>
									<description>PWM output of CCU6</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC61</name>
									<description>PWM output of CCU6</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUT60</name>
									<description>PWM output of CCU6</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUT61</name>
									<description>PWM output of CCU6</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS1_SRC_SEL</name>
							<description>LS1 PWM Source Selection</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CC60</name>
									<description>PWM output of CCU6</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC61</name>
									<description>PWM output of CCU6</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUT60</name>
									<description>PWM output of CCU6</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUT61</name>
									<description>PWM output of CCU6</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SEQAFHB1CD</name>
					<description>Slewrate Sequencer-Active Freewheeling- Half Bridge 1 Clamping Current Delay</description>
					<addressOffset>0x68</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>HB1AF_TDICLMPON</name>
							<description>Clamping current delay during active freewheeling for switch on</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>12.8us</name>
									<description>12.8us phase duration</description>
									<value>0xFF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB1AF_TDICLMPOFF</name>
							<description>Clamping current delay during active freewheeling for switch off</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>12.8us</name>
									<description>12.8us phase duration</description>
									<value>0xFF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SEQAFHB1IC</name>
					<description>Slewrate Sequencer-Active Freewheeling-Half Bridge 1 Current Control</description>
					<addressOffset>0x64</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>HB1AF_ION</name>
							<description>Half Bridge 1-active freewheeling-slew rate sequencer on-phase current setting</description>
							<lsb>16</lsb>
							<msb>21</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>min. current</name>
									<description>IDISCHGmin</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>max. current</name>
									<description>IDISCHGmax</description>
									<value>0x3F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB1AF_IOFF</name>
							<description>Half Bridge 1-active freewheeling-slew rate sequencer off-phase current setting</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>min. current</name>
									<description>IDISCHGmin</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>max. current</name>
									<description>IDISCHGmax</description>
									<value>0x3F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
