cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
				<register>
					<name>SEQAFHB2CD</name>
					<description>Slewrate Sequencer-Active Freewheeling- Half Bridge 2 Clamping Current Delay</description>
					<addressOffset>0x88</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>HB2AF_TDICLMPON</name>
							<description>Clamping current delay during active freewheeling for switch on</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>12.8us</name>
									<description>12.8us phase duration</description>
									<value>0xFF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB2AF_TDICLMPOFF</name>
							<description>Clamping current delay during active freewheeling for switch off</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50ns</name>
									<description>50ns phase duration</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>12.8us</name>
									<description>12.8us phase duration</description>
									<value>0xFF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SEQAFHB2IC</name>
					<description>Slewrate Sequencer-Active Freewheeling- Half Bridge 2 Current Control</description>
					<addressOffset>0x84</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>HB2AF_ION</name>
							<description>Half Bridge 2-active freewheeling-slew rate sequencer on-phase current setting</description>
							<lsb>16</lsb>
							<msb>21</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>min. current</name>
									<description>IDISCHGmin</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>max. current</name>
									<description>IDISCHGmax</description>
									<value>0x3F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB2AF_IOFF</name>
							<description>Half Bridge 2-active freewheeling-slew rate sequencer off-phase current setting</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>min. current</name>
									<description>IDISCHGmin</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>max. current</name>
									<description>IDISCHGmax</description>
									<value>0x3F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SEQMAP</name>
					<description>Slewrate Sequencer Mapping Register</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>HB2_SEQMAP</name>
							<description>Half Bridge 2 Sequencer Mapping</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>LS2</name>
									<description>slew rate sequencer is mapped to LS2</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HS2</name>
									<description>slew rate sequencer is mapped to HS2</description>
									<value>0x1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB1_SEQMAP</name>
							<description>Half Bridge 1 Sequencer Mapping</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>LS1</name>
									<description>slew rate sequencer is mapped to LS1</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HS1</name>
									<description>slew rate sequencer is mapped to HS1</description>
									<value>0x1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>TRIM_DRVx</name>
					<description>Trimming of Driver</description>
					<addressOffset>0x18</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>CPLOW_TFILT_SEL</name>
							<description>Filter Time for Charge Pump Voltage Low Diagnosis</description>
							<lsb>28</lsb>
							<msb>29</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>4_us</name>
									<description>4 us filter time</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8_us</name>
									<description>8 us filter time</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16_us</name>
									<description>16 us filter time</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>32_us</name>
									<description>32 us filter time</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS2DRV_OCSDN_DIS</name>
							<description>High Side 2 Predriver in overcurrent situation disable</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Enable</name>
									<description>Predriver shutdown in overcurrent situation enable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disable</name>
									<description>Predriver shutdown in overcurrent situation disable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS1DRV_OCSDN_DIS</name>
							<description>High Side 1 Predriver in overcurrent situation disable</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Enable</name>
									<description>Predriver shutdown in overcurrent situation enable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disable</name>
									<description>Predriver shutdown in overcurrent situation disable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS2DRV_FDISCHG_DIS</name>
							<description>High Side 2 Predriver fast discharge disable</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Enable</name>
									<description>Predriver shutdown fast discharge enable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disable</name>
									<description>Predriver shutdown fast discharge disable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS1DRV_FDISCHG_DIS</name>
							<description>High Side 1 Predriver fast discharge disable</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Enable</name>
									<description>Predriver shutdown fast discharge enable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disable</name>
									<description>Predriver shutdown fast discharge disable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HSDRV_DS_TFILT_SEL</name>
							<description>Filter Time for Drain-Source Monitoring of High Side Drivers</description>
							<lsb>18</lsb>
							<msb>19</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1_us</name>
									<description>1 us filter time</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2_us</name>
									<description>2 us filter time</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4_us</name>
									<description>4 us filter time</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8_us</name>
									<description>8 us filter time</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS2DRV_OCSDN_DIS</name>
							<description>Low Side 2 Predriver in overcurrent situation disable</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Enable</name>
									<description>Predriver shutdown in overcurrent situation enable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disable</name>
									<description>Predriver shutdown in overcurrent situation disable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS1DRV_OCSDN_DIS</name>
							<description>Low Side 1 Predriver in overcurrent situation disable</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Enable</name>
									<description>Predriver shutdown in overcurrent situation enable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disable</name>
									<description>Predriver shutdown in overcurrent situation disable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS2DRV_FDISCHG_DIS</name>
							<description>Low Side 2 Predriver fast discharge disable</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Enable</name>
									<description>Predriver shutdown fast discharge enable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disable</name>
									<description>Predriver shutdown fast discharge disable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS1DRV_FDISCHG_DIS</name>
							<description>Low Side 1 Predriver fast discharge disable</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Enable</name>
									<description>Predriver shutdown fast discharge enable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disable</name>
									<description>Predriver shutdown fast discharge disable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LSDRV_DS_TFILT_SEL</name>
							<description>Filter Time for Drain-Source Monitoring of Low Side Drivers</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1_us</name>
									<description>1 us filter time</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2_us</name>
									<description>2 us filter time</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4_us</name>
									<description>4 us filter time</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8_us</name>
									<description>8 us filter time</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS_HS_BT_TFILT_SEL</name>
							<description>Blanking Time for Drain-Source Monitoring of Low / High Side Drivers</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1_us</name>
									<description>1 us filter time</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2_us</name>
									<description>2 us filter time</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4_us</name>
									<description>4 us filter time</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8_us</name>
									<description>8 us filter time</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
