cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
				<register>
					<name>IS</name>
					<description>Capture/Compare Interrupt Status Register</description>
					<addressOffset>0x68</addressOffset>
					<size>16</size>
					<fields>
						<field>
							<name>STR</name>
							<description>Multi-Channel Mode Shadow Transfer Request</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No</name>
									<description>The shadow transfer has not yet taken place.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Yes</name>
									<description>The shadow transfer has taken place.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IDLE</name>
							<description>IDLE State</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Idle</name>
									<description>Bit field MCMP is cleared and held to 0, the selected outputs are set to passive state.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WHE</name>
							<description>Wrong Hall Event</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not detected</name>
									<description>A transition to a wrong hall event (not the expected one) has not yet been detected since this bit has been reset for the last time.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Detected</name>
									<description>A transition to a wrong hall event (not the expected one) has been detected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CHE</name>
							<description>Correct Hall Event</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not detected</name>
									<description>A transition to a correct (= expected) hall event has not yet been detected since this bit has been reset for the last time.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Detected</name>
									<description>A transition to a correct (= expected) hall event has been detected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TRPS</name>
							<description>Trap State</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not active</name>
									<description>The trap state is not active.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Active</name>
									<description>The trap state is active. Bit TRPS is set while bit TRPF = 1. It is reset according to the mode selected in register TRPCTR.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TRPF</name>
							<description>Trap Flag</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not detected</name>
									<description>The trap condition has not been detected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Detected</name>
									<description>The trap condition has been detected (input CTRAP has been 0 or by software).</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T13PM</name>
							<description>Timer T13 Period-Match Flag</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not detected</name>
									<description>A timer T13 period-match has not yet been detected since this bit has been reset for the last time.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Detected</name>
									<description>A timer T13 period-match has been detected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T13CM</name>
							<description>Timer T13 Compare-Match Flag</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not detected</name>
									<description>A timer T13 compare-match has not yet been detected since this bit has been reset for the last time.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Detected</name>
									<description>A timer T13 compare-match has been detected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T12PM</name>
							<description>Timer T12 Period-Match Flag</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not detected</name>
									<description>A timer T12 period-match (while counting up) has not yet been detected since this bit has been reset for the last time.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Detected</name>
									<description>A timer T12 period-match (while counting up) has been detected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T12OM</name>
							<description>Timer T12 One-Match Flag</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not detected</name>
									<description>A timer T12 one-match (while counting down) has not yet been detected since this bit has been reset for the last time.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Detected</name>
									<description>A timer T12 one-match (while counting down) has been detected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ICC62F</name>
							<description>Capture, Compare-Match Falling Edge Flag</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not occurred</name>
									<description>The event has not yet occurred since this bit has been reset for the last time.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Detected</name>
									<description>The event described above has been detected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ICC62R</name>
							<description>Capture, Compare-Match Rising Edge Flag</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not occurred</name>
									<description>The event has not yet occurred since this bit has been reset for the last time.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Detected</name>
									<description>The event described above has been detected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ICC61F</name>
							<description>Capture, Compare-Match Falling Edge Flag</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not occurred</name>
									<description>The event has not yet occurred since this bit has been reset for the last time.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Detected</name>
									<description>The event described above has been detected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ICC61R</name>
							<description>Capture, Compare-Match Rising Edge Flag</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not occurred</name>
									<description>The event has not yet occurred since this bit has been reset for the last time.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Detected</name>
									<description>The event described above has been detected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ICC60F</name>
							<description>Capture, Compare-Match Falling Edge Flag</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not occurred</name>
									<description>The event has not yet occurred since this bit has been reset for the last time.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Detected</name>
									<description>The event described above has been detected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ICC60R</name>
							<description>Capture, Compare-Match Rising Edge Flag</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not occurred</name>
									<description>The event has not yet occurred since this bit has been reset for the last time.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Detected</name>
									<description>The event described above has been detected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ISR</name>
					<description>Capture/Compare Interrupt Status Reset Register</description>
					<addressOffset>0x0C</addressOffset>
					<size>16</size>
					<fields>
						<field>
							<name>RSTR</name>
							<description>Reset STR Flag</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>Bit STR in register IS will be reset.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RIDLE</name>
							<description>Reset IDLE Flag</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>Bit IDLE in register IS will be reset.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RWHE</name>
							<description>Reset Wrong Hall Event Flag</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>Bit WHE in register IS will be reset.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RCHE</name>
							<description>Reset Correct Hall Event Flag</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>Bit CHE in register IS will be reset.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RTRPF</name>
							<description>Reset Trap Flag</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>Bit TRPF in register IS will be reset (not taken into account while input CTRAP = 0 and TRPPEN = 1.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RT13PM</name>
							<description>Reset Timer T13 Period-Match Flag</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>Bit T13PM in register IS will be reset.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RT13CM</name>
							<description>Reset Timer T13 Compare-Match Flag</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>Bit T13CM in register IS will be reset.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RT12PM</name>
							<description>Reset Timer T12 Period-Match Flag</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>Bit T12PM in register IS will be reset.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RT12OM</name>
							<description>Reset Timer T12 One-Match Flag</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>Bit T12OM in register IS will be reset.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RCC62F</name>
							<description>Reset Capture, Compare-Match Falling Edge Flag</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>Bit CC62F in register IS will be reset.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RCC62R</name>
							<description>Reset Capture, Compare-Match Rising Edge Flag</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>Bit CC62R in register IS will be reset.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RCC61F</name>
							<description>Reset Capture, Compare-Match Falling Edge Flag</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>Bit CC61F in register IS will be reset.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RCC61R</name>
							<description>Reset Capture, Compare-Match Rising Edge Flag</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>Bit CC61R in register IS will be reset.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RCC60F</name>
							<description>Reset Capture, Compare-Match Falling Edge Flag</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>Bit CC60F in register IS will be reset.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RCC60R</name>
							<description>Reset Capture, Compare-Match Rising Edge Flag</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>Bit CC60R in register IS will be reset.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
