cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
				<register>
					<name>PISEL0</name>
					<description>Port Input Select Register 0</description>
					<addressOffset>0x6C</addressOffset>
					<size>16</size>
					<fields>
						<field>
							<name>IST12HR</name>
							<description>Input Select for T12HR</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>T12HRA</name>
									<description>Either signal T12HRA (if T12EXT = 0) or T12HRE (if T12EXT = 1) is selected.</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T12HRB</name>
									<description>Either signal T12HRB (if T12EXT = 0) or T12HRF (if T12EXT = 1) is selected.</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T12HRC</name>
									<description>Either signal T12HRC (if T12EXT = 0) or T12HRG (if T12EXT = 1) is selected.</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T12HRD</name>
									<description>Either signal T12HRD (if T12EXT = 0) or T12HRH (if T12EXT = 1) is selected.</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ISPOS2</name>
							<description>Input Select for CCPOS2</description>
							<lsb>12</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CCPOS2_0</name>
									<description>The input pin for CCPOS2_0.</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCPOS2_1</name>
									<description>The input pin for CCPOS2_1.</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCPOS2_2</name>
									<description>The input pin for CCPOS2_2.</description>
									<value>0b10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ISPOS1</name>
							<description>Input Select for CCPOS1</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CCPOS1_0</name>
									<description>The input pin for CCPOS1_0.</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCPOS1_1</name>
									<description>The input pin for CCPOS1_1.</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCPOS1_2</name>
									<description>The input pin for CCPOS1_2.</description>
									<value>0b10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ISPOS0</name>
							<description>Input Select for CCPOS0</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CCPOS0_0</name>
									<description>The input pin for CCPOS0_0.</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCPOS0_1</name>
									<description>The input pin for CCPOS0_1.</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCPOS0_2</name>
									<description>The input pin for CCPOS0_2.</description>
									<value>0b10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ISTRP</name>
							<description>Input Select for CTRAP</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CTRAP_0</name>
									<description>The input pin for CTRAP_0.</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CTRAP_1</name>
									<description>The input pin for CTRAP_1.</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CTRAP_2</name>
									<description>The input pin for CTRAP_2.</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DU1_UP_STS</name>
									<description>The output DU1_UP_STS of the Differential Measurement Unit is selected.</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ISCC62</name>
							<description>Input Select for CC62</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CC62_0</name>
									<description>The input pin for CC62_0.</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC62_1</name>
									<description>The input pin for CC62_1.</description>
									<value>0b01</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ISCC61</name>
							<description>Input Select for CC61</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CC61_0</name>
									<description>The input pin for CC61_0.</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC61_1</name>
									<description>The input pin for CC61_1.</description>
									<value>0b01</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ISCC60</name>
							<description>Input Select for CC60</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CC60_0</name>
									<description>The input pin for CC60_0.</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC60_1</name>
									<description>The input pin for CC60_1.</description>
									<value>0b01</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PISEL2</name>
					<description>Port Input Select Register 2</description>
					<addressOffset>0x74</addressOffset>
					<size>16</size>
					<fields>
						<field>
							<name>T13EXT</name>
							<description>Extension for T13HR Inputs</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>T13HR_D_A</name>
									<description>One of the signals T13HR[D:A] is selected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T13HR_H_E</name>
									<description>One of the signals T13HR[H:E] is selected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T12EXT</name>
							<description>Extension for T12HR Inputs</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>T12HR_D_A</name>
									<description>One of the signals T12HR[D:A] is selected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T12HR_H_E</name>
									<description>One of the signals T12HR[H:E] is selected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ISCNT13</name>
							<description>Input Select for T13 Counting Input</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>T13 prescaler</name>
									<description>The T13 prescaler generates the counting events. Bit TCTR4.T13CNT is not taken into account.</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TCTR4.T13CNT</name>
									<description>Bit TCTR4.T13CNT written with 1 is a counting event. The T13 prescaler is not taken into account.</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Rising edge</name>
									<description>The timer T13 is counting each rising edge detected in the selected T13HR signal.</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Falling Edge</name>
									<description>The timer T13 is counting each falling edge detected in the selected T13HR signal.</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ISCNT12</name>
							<description>Input Select for T12 Counting Input</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>T12 prescaler</name>
									<description>The T12 prescaler generates the counting events. Bit TCTR4.T12CNT is not taken into account.</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TCTR4.T12CNT</name>
									<description>Bit TCTR4.T12CNT written with 1 is a counting event. The T12 prescaler is not taken into account.</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Rising edge</name>
									<description>The timer T12 is counting each rising edge detected in the selected T12HR signal.</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Falling edge</name>
									<description>The timer T12 is counting each falling edge detected in the selected T12HR signal.</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IST13HR</name>
							<description>Input Select for T13HR</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>T13HRA</name>
									<description>Either signal T13HRA (if T13EXT = 0) or T13HRE (if T13EXT = 1) is selected.</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T13HRB</name>
									<description>Either signal T13HRB (if T13EXT = 0) or T13HRF (if T13EXT = 1) is selected.</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T13HRC</name>
									<description>Either signal T13HRC (if T13EXT = 0) or T13HRG (if T13EXT = 1) is selected.</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T13HRD</name>
									<description>Either signal T13HRD (if T13EXT = 0) or T13HRH (if T13EXT = 1) is selected.</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PSLR</name>
					<description>Passive State Level Register</description>
					<addressOffset>0x50</addressOffset>
					<size>16</size>
					<fields>
						<field>
							<name>PSL63</name>
							<description>Passive State Level of Output COUT63</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Level 0</name>
									<description>The passive level is 0.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Level 1</name>
									<description>The passive level is 1.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PSL</name>
							<description>Compare Outputs Passive State Level</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Level 0</name>
									<description>The passive level is 0.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Level 1</name>
									<description>The passive level is 1.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>T12</name>
					<description>Timer T12 Counter Register</description>
					<addressOffset>0x78</addressOffset>
					<size>16</size>
					<fields>
						<field>
							<name>T12CV</name>
							<description>Timer T12 Counter Value</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>T12DTC</name>
					<description>Dead-Time Control Register for Timer T12 Low</description>
					<addressOffset>0x2C</addressOffset>
					<size>16</size>
					<fields>
						<field>
							<name>DTR2</name>
							<description>Dead-Time Run Indication Bit 2</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Zero</name>
									<description>The value of the corresponding dead-time counter channel is 0.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Not Zero</name>
									<description>The value of the corresponding dead-time counter channel is not 0.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DTR1</name>
							<description>Dead-Time Run Indication Bit 1</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Zero</name>
									<description>The value of the corresponding dead-time counter channel is 0.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Not Zero</name>
									<description>The value of the corresponding dead-time counter channel is not 0.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DTR0</name>
							<description>Dead-Time Run Indication Bit 0</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Zero</name>
									<description>The value of the corresponding dead-time counter channel is 0.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Not Zero</name>
									<description>The value of the corresponding dead-time counter channel is not 0.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DTE2</name>
							<description>Dead-Time Enable Bit 2</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Dead-time generation is disabled. The corresponding outputs switch from the passive state to the active state (according to the actual compare status) without any delay.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled</name>
									<description>Dead-time generation is enabled. The corresponding outputs switch from the passive state to the active state (according to the compare status) with the delay programmed in bit field DTM.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DTE1</name>
							<description>Dead-Time Enable Bit 1</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Dead-time generation is disabled. The corresponding outputs switch from the passive state to the active state (according to the actual compare status) without any delay.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled</name>
									<description>Dead-time generation is enabled. The corresponding outputs switch from the passive state to the active state (according to the compare status) with the delay programmed in bit field DTM.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DTE0</name>
							<description>Dead-Time Enable Bit 0</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Dead-time generation is disabled. The corresponding outputs switch from the passive state to the active state (according to the actual compare status) without any delay.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled</name>
									<description>Dead-time generation is enabled. The corresponding outputs switch from the passive state to the active state (according to the compare status) with the delay programmed in bit field DTM.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DTM</name>
							<description>Dead-Time</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
