cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
				<register>
					<name>TCTR2</name>
					<description>Timer Control Register 2</description>
					<addressOffset>0x58</addressOffset>
					<size>16</size>
					<fields>
						<field>
							<name>T13RSEL</name>
							<description>Timer T13 External Run Selection</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>The external setting of T13R is disabled.</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Rising edge</name>
									<description>Bit T13R is set if a rising edge of signal T13HR is detected.</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Falling edge</name>
									<description>Bit T13R is set if a falling edge of signal T13HR is detected.</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Edge</name>
									<description>Bit T13R is set if an edge of signal T13HR is detected.</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T12RSEL</name>
							<description>Timer T12 External Run Selection</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>The external setting of T12R is disabled.</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Rising edge</name>
									<description>Bit T12R is set if a rising edge of signal T12HR is detected.</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Falling edge</name>
									<description>Bit T12R is set if a falling edge of signal T12HR is detected.</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Edge</name>
									<description>Bit T12R is set if an edge of signal T12HR is detected.</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T13TED</name>
							<description>Timer T13 Trigger Event Direction</description>
							<lsb>5</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Up</name>
									<description>while T12 is counting up</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Down</name>
									<description>while T12 is counting down</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Independent</name>
									<description>independent on the count direction of T12</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T13TEC</name>
							<description>T13 Trigger Event Control</description>
							<lsb>2</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Channel 0</name>
									<description>set T13R on a T12 compare event on channel 0</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Channel 1</name>
									<description>set T13R on a T12 compare event on channel 1</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Channel 2</name>
									<description>set T13R on a T12 compare event on channel 2</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Channel 0,1,2</name>
									<description>set T13R on any T12 compare event on the channels 0, 1, or 2</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Period-match</name>
									<description>set T13R upon a period-match of T12</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Zero-match</name>
									<description>set T13R upon a zero-match of T12 (while counting up)</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCPOSx</name>
									<description>set T13R on any edge of inputs CCPOSx</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T13SSC</name>
							<description>Timer T13 Single Shot Control</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<description>No hardware action on T13R</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled</name>
									<description>The single-shot mode is enabled, the bit T13R is reset by hardware if T13 reaches its period value. In parallel to the reset action of bit T13R, the bit CC63ST is reset.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T12SSC</name>
							<description>Timer T12 Single Shot Control</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>The single-shot mode is disabled, no hardware action on T12R.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled</name>
									<description>The single shot mode is enabled, the bit T12R is reset by hardware if: - T12 reaches its period value in edge-aligned mode - T12 reaches the value 1 while down counting in center-aligned mode. In parallel to the reset action of bit T12R, the bits CC6xST (x = 0, 1, 2) are reset.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>TCTR4</name>
					<description>Timer Control Register 4</description>
					<addressOffset>0x04</addressOffset>
					<size>16</size>
					<fields>
						<field>
							<name>T13STD</name>
							<description>Timer T13 Shadow Transfer Disable</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>STE13 reset</name>
									<description>STE13 is reset without triggering the shadow transfer.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T13STR</name>
							<description>Timer T13 Shadow Transfer Request</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>STE13 set</name>
									<description>STE13 is set, enabling the shadow transfer.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T13CNT</name>
							<description>Timer T13 Count Event</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Count</name>
									<description>If enabled (PISEL2), timer T13 counts one step.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T13RES</name>
							<description>Timer T13 Reset</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No effect</name>
									<description>No effect on T13.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Zero</name>
									<description>The T13 counter register is reset to zero. The switching of the output signals is according to the switching rules. Setting of T13RES has no impact on bit T13R.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T13RS</name>
							<description>Timer T13 Run Set</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No influence</name>
									<description>T13R is not influenced.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T13R set</name>
									<description>T13R is set, T13 counts.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T13RR</name>
							<description>Timer T13 Run Reset</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No influence</name>
									<description>T13R is not influenced.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T13R cleared</name>
									<description>T13R is cleared, T13 stops counting.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T12STD</name>
							<description>Timer T12 Shadow Transfer Disable</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>STE12 reset</name>
									<description>STE12 is reset without triggering the shadow transfer.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T12STR</name>
							<description>Timer T12 Shadow Transfer Request</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>STE12 set</name>
									<description>STE12 is set, enabling the shadow transfer.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T12CNT</name>
							<description>Timer T12 Count Event</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No action</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Count</name>
									<description>If enabled (PISEL2), timer T12 counts one step.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DTRES</name>
							<description>Dead-Time Counter Reset</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No effect</name>
									<description>No effect on the dead-time counters.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Zero</name>
									<description>The three dead-time counter channels are reset to zero.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T12RES</name>
							<description>Timer T12 Reset</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No effect</name>
									<description>No effect on T12.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Zero</name>
									<description>The T12 counter register is reset to zero. The switching of the output signals is according to the switching rules. Setting of T12RES has no impact on bit T12R.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T12RS</name>
							<description>Timer T12 Run Set</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No influence</name>
									<description>T12R is not influenced.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T12R set</name>
									<description>T12R is set, T12 counts.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T12RR</name>
							<description>Timer T12 Run Reset</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No influence</name>
									<description>T12R is not influenced.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T12R cleared</name>
									<description>T12R is cleared, T12 stops counting.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>TRPCTR</name>
					<description>Trap Control Register</description>
					<addressOffset>0x60</addressOffset>
					<size>16</size>
					<fields>
						<field>
							<name>TRPPEN</name>
							<description>Trap Pin Enable</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>The trap functionality based on the input pin CTRAP is disabled. A trap can only be generated by software by setting bit TRPF.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled</name>
									<description>The trap functionality based on the input pin CTRAP is enabled. A trap can be generated by software by setting bit TRPF or by CTRAP = 0.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TRPEN13</name>
							<description>Trap Enable Control for Timer T13</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>The trap functionality for T13 is disabled. Timer T13 (if selected and enabled) provides PWM functionality even while TRPS = 1.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled</name>
									<description>The trap functionality for T13 is enabled. The timer T13 PWM output signal is set to the passive state while TRPS = 1.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TRPEN</name>
							<description>Trap Enable Control</description>
							<lsb>8</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>The trap functionality of the corresponding output signal is disabled. The output state is independent from bit TRPS.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled</name>
									<description>The trap functionality of the corresponding output signal is enabled. The output is set to the passive state while TRPS = 1.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TRPM2</name>
							<description>Trap Mode Control Bit 2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Hardware reset</name>
									<description>The trap state can be left (return to normal operation = bit TRPS = 0) as soon as the input CTRAP becomes inactive. Bit TRPF is automatically cleared by hardware if the input pin CTRAP becomes 1. Bit TRPS is automatically cleared by hardware if bit TRPF is 0 and if the synchronization condition (according to TRPM10) is detected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Software reset</name>
									<description>The trap state can be left (return to normal operation = bit TRPS = 0) as soon as bit TRPF is reset by software after the input CTRAP becomes inactive (TRPF is not cleared by hardware). Bit TRPS is automatically cleared by hardware if bit TRPF = 0 and if the synchronization condition (according to TRPM10) is detected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TRPM10</name>
							<description>Trap Mode Control Bits 1, 0</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>T12 zero-match</name>
									<description>The trap state is left (return to normal operation according to TRPM2) when a zero-match of T12 (while counting up) is detected (synchronization to T12).</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T13 zero-match</name>
									<description>The trap state is left (return to normal operation according to TRPM2) when a zero-match of T13 is detected (synchronization to T13).</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Immediately</name>
									<description>The trap state is left (return to normal operation according to TRPM2) immediately without any synchronization to T12 or T13.</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
