cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>CPU</name>
			<description>CPU</description>
			<baseAddress>0xE000E000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>AIRCR</name>
					<description>Application Interrupt/Reset Control Register</description>
					<addressOffset>0xD0C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>VECTKEY</name>
							<description>Vector Key</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ENDIANNESS</name>
							<description>Data Endianness</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Little Endian</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Big Endian</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYSRESETREQ</name>
							<description>System Reset Request</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Reset</name>
									<description>no effect</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>request a system level reset</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VECTCLRACTIVE</name>
							<description>VECTCLRACTIVE</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCR</name>
					<description>Configuration Control Register</description>
					<addressOffset>0xD14</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>STKALIGN</name>
							<description>STKALIGN</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>UNALIGN_TRP</name>
							<description>UNALIGN_TRP</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CPUID</name>
					<description>CPU ID Base Register</description>
					<addressOffset>0xD00</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>IMPLEMENTER</name>
							<description>Implementer Code</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>VARIANT</name>
							<description>Variant Number</description>
							<lsb>20</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CONSTANT</name>
							<description>Constant</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PARTNO</name>
							<description>Part Number</description>
							<lsb>4</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>REVISION</name>
							<description>Revision Number</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ICSR</name>
					<description>Interrupt Control and State Register</description>
					<addressOffset>0xD04</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>NMIPENDSET</name>
							<description>NMI Set Pending</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on writes, has no effect. On reads, NMI exception is not pending.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>on writes, changes the NMI exception state to pending. On reads, NMI exception is pending.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PENDSVSET</name>
							<description>PENDSV Set Pending</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on writes, has no effect. On reads, PendSV exception is not pending.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>on writes, changes PendSV exception state to pending. On reads, PendSV is pending.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PENDSVCLR</name>
							<description>PENDSV Clear Pending</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Clear</name>
									<description>no effect</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<description>remove pending state from the PENDSV exception</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PENDSTSET</name>
							<description>SysTick Exception Set Pending</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on writes, has no effect. On reads, SysTick exception is not pending.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>on writes, changes SysTick exception state to pending. On reads, SysTick exception is pending.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PENDSTCLR</name>
							<description>SysTick Exception Clear Pending</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Clear</name>
									<description>no effect</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<description>removes the pending state from the SysTick exception</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ISRPENDING</name>
							<description>Interrupt Pending Flag</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>interrupt not pending</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>interrupt is pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VECTPENDING</name>
							<description>VECTPENDING</description>
							<lsb>12</lsb>
							<msb>17</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no pending exceptions</name>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VECTACTIVE</name>
							<description>VECTACTIVE</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Thread mode</name>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
