cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
				<register>
					<name>NVIC_ICPR</name>
					<description>Interrupt Clear-Pending</description>
					<addressOffset>0x280</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>Int_PORT2</name>
							<description>Interrupt Clear Pending for PORT2</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>on reads the associated interrupt is pending, on writes the status of the associated interrupt is changed to not pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_MON</name>
							<description>Interrupt Clear Pending for MON</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>on reads the associated interrupt is pending, on writes the status of the associated interrupt is changed to not pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_DU</name>
							<description>Interrupt Clear Pending for Differential Unit</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>on reads the associated interrupt is pending, on writes the status of the associated interrupt is changed to not pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_OPA</name>
							<description>Interrupt Clear Pending for Current Sense Amplifier</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>on reads the associated interrupt is pending, on writes the status of the associated interrupt is changed to not pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_HS</name>
							<description>Interrupt Clear Pending for High-Side Switch</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>on reads the associated interrupt is pending, on writes the status of the associated interrupt is changed to not pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_BDRV</name>
							<description>Interrupt Clear Pending for Bridge Driver</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>on reads the associated interrupt is pending, on writes the status of the associated interrupt is changed to not pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_CP</name>
							<description>Interrupt Clear Pending for Charge Pump</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>on reads the associated interrupt is pending, on writes the status of the associated interrupt is changed to not pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_MATHDIV</name>
							<description>Interrupt Clear Pending for Math Divider</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>on reads the associated interrupt is pending, on writes the status of the associated interrupt is changed to not pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_WAKEUP</name>
							<description>Interrupt Clear Pending for WAKEUP</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>on reads the associated interrupt is pending, on writes the status of the associated interrupt is changed to not pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_EXINT1</name>
							<description>Interrupt Clear Pending for External Int 1</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>on reads the associated interrupt is pending, on writes the status of the associated interrupt is changed to not pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_EXINT0</name>
							<description>Interrupt Clear Pending for External Int 0</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>on reads the associated interrupt is pending, on writes the status of the associated interrupt is changed to not pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_UART2</name>
							<description>Interrupt Clear Pending for UART2</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>on reads the associated interrupt is pending, on writes the status of the associated interrupt is changed to not pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_UART1</name>
							<description>Interrupt Clear Pending for UART1</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>on reads the associated interrupt is pending, on writes the status of the associated interrupt is changed to not pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_SSC2</name>
							<description>Interrupt Clear Pending for SSC2</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>on reads the associated interrupt is pending, on writes the status of the associated interrupt is changed to not pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_SSC1</name>
							<description>Interrupt Clear Pending for SSC1</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>on reads the associated interrupt is pending, on writes the status of the associated interrupt is changed to not pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_CCU6SR3</name>
							<description>Interrupt Clear Pending for CCU6 SR3</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>on reads the associated interrupt is pending, on writes the status of the associated interrupt is changed to not pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_CCU6SR2</name>
							<description>Interrupt Clear Pending for CCU6 SR2</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>on reads the associated interrupt is pending, on writes the status of the associated interrupt is changed to not pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_CCU6SR1</name>
							<description>Interrupt Clear Pending for CCU6 SR1</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>on reads the associated interrupt is pending, on writes the status of the associated interrupt is changed to not pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_CCU6SR0</name>
							<description>Interrupt Clear Pending for CCU6 SR0</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>on reads the associated interrupt is pending, on writes the status of the associated interrupt is changed to not pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_ADC1</name>
							<description>Interrupt Clear Pending for ADC1</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>on reads the associated interrupt is pending, on writes the status of the associated interrupt is changed to not pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_ADC2</name>
							<description>Interrupt Clear Pending for MU, ADC2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>on reads the associated interrupt is pending, on writes the status of the associated interrupt is changed to not pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_GPT2</name>
							<description>Interrupt Clear Pending for GPT2</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>on reads the associated interrupt is pending, on writes the status of the associated interrupt is changed to not pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_GPT1</name>
							<description>Interrupt Clear Pending for GPT1</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>on reads the associated interrupt is pending, on writes the status of the associated interrupt is changed to not pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_IPR0</name>
					<description>Interrupt Priority</description>
					<addressOffset>0x400</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>PRI_ADC1</name>
							<description>Priority for ADC1</description>
							<lsb>30</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_ADC2</name>
							<description>Priority for MU, ADC2</description>
							<lsb>22</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_GPT2</name>
							<description>Priority for GPT2</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_GPT1</name>
							<description>Priority for GPT1</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_IPR1</name>
					<description>Interrupt Priority</description>
					<addressOffset>0x404</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>PRI_CCU6SR3</name>
							<description>Priority for CCU6 SR3</description>
							<lsb>30</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_CCU6SR2</name>
							<description>Priority for CCU6 SR2</description>
							<lsb>22</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_CCU6SR1</name>
							<description>Priority for CCU6 SR1</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_CCU6SR0</name>
							<description>Priority for CCU6 SR0</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_IPR2</name>
					<description>Interrupt Priority</description>
					<addressOffset>0x408</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>PRI_UART2</name>
							<description>Priority for UART2</description>
							<lsb>30</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_UART1</name>
							<description>Priority for UART1</description>
							<lsb>22</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_SSC2</name>
							<description>Priority for SSC2</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_SSC1</name>
							<description>Priority for SSC1</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_IPR3</name>
					<description>Interrupt Priority</description>
					<addressOffset>0x40C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>PRI_MATHDIV</name>
							<description>Priority for Math Divider</description>
							<lsb>30</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_WAKEUP</name>
							<description>Priority for WAKEUP</description>
							<lsb>22</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_EXINT1</name>
							<description>Priority for External Int 1</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_EXINT0</name>
							<description>Priority for External Int 0</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_IPR4</name>
					<description>Interrupt Priority</description>
					<addressOffset>0x410</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>PRI_HS</name>
							<description>Priority for High-Side Switch</description>
							<lsb>30</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_BDRV</name>
							<description>Priority for Bridge Driver</description>
							<lsb>22</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_CP</name>
							<description>Priority for Charge Pump</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_IPR5</name>
					<description>Interrupt Priority</description>
					<addressOffset>0x414</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>PRI_PORT2</name>
							<description>Priority for PORT2</description>
							<lsb>30</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_MON</name>
							<description>Priority for MON</description>
							<lsb>22</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_DU</name>
							<description>Priority for Differential Unit</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_OPA</name>
							<description>Priority for Current Sense Amplifier</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
