cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
				<register>
					<name>NVIC_ISPR</name>
					<description>Interrupt Set-Pending</description>
					<addressOffset>0x200</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>Int_PORT2</name>
							<description>Interrupt Set Pending for PORT2</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>the associated interrupt is pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_MON</name>
							<description>Interrupt Set Pending for MON</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>the associated interrupt is pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_DU</name>
							<description>Interrupt Set Pending for Differential Unit</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>the associated interrupt is pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_OPA</name>
							<description>Interrupt Set Pending for Current Sense Amplifier</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>the associated interrupt is pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_HS</name>
							<description>Interrupt Set Pending for High-Side Switch</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>the associated interrupt is pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_BDRV</name>
							<description>Interrupt Set Pending for Bridge Driver</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>the associated interrupt is pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_CP</name>
							<description>Interrupt Set Pending for Charge Pump</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>the associated interrupt is pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_MATHDIV</name>
							<description>Interrupt Set Pending for Math Divider</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>the associated interrupt is pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_WAKEUP</name>
							<description>Interrupt Set Pending for WAKEUP</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>the associated interrupt is pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_EXINT1</name>
							<description>Interrupt Set Pending for External Int 1</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>the associated interrupt is pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_EXINT0</name>
							<description>Interrupt Set Pending for External Int 0</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>the associated interrupt is pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_UART2</name>
							<description>Interrupt Set Pending for UART2</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>the associated interrupt is pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_UART1</name>
							<description>Interrupt Set Pending for UART1</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>the associated interrupt is pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_SSC2</name>
							<description>Interrupt Set Pending for SSC2</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>the associated interrupt is pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_SSC1</name>
							<description>Interrupt Set Pending for SSC1</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>the associated interrupt is pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_CCU6SR3</name>
							<description>Interrupt Set Pending for CCU6 SR3</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>the associated interrupt is pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_CCU6SR2</name>
							<description>Interrupt Set Pending for CCU6 SR2</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>the associated interrupt is pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_CCU6SR1</name>
							<description>Interrupt Set Pending for CCU6 SR1</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>the associated interrupt is pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_CCU6SR0</name>
							<description>Interrupt Set Pending for CCU6 SR0</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>the associated interrupt is pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_ADC1</name>
							<description>Interrupt Set Pending for ADC1</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>the associated interrupt is pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_ADC2</name>
							<description>Interrupt Set Pending for MU, ADC2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>the associated interrupt is pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_GPT2</name>
							<description>Interrupt Set Pending for GPT2</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>the associated interrupt is pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_GPT1</name>
							<description>Interrupt Set Pending for GPT1</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>on reads the associated interrupt is not pending, no effect on writes</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>the associated interrupt is pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SCR</name>
					<description>System Control Register</description>
					<addressOffset>0xD10</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>SEVONPEND</name>
							<description>SEVONPEND</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Enabled</name>
									<description>only enabled interrupts or events can wake-up the processor, disabled interrupts are excluded</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>All</name>
									<description>enabled events and all interrupts, including disabled interrupts, can wake-up the processor</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SLEEPDEEP</name>
							<description>Sleep Deep</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>sleep</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>deep sleep</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SLEEPONEXIT</name>
							<description>Sleep on Exit</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Do Not Sleep</name>
									<description>do not sleep when returning to Thread mode</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enter Sleep</name>
									<description>enter sleep, or deep sleep, on return from an ISR to Thread mode</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SHCSR</name>
					<description>System Handler Control and State Register</description>
					<addressOffset>0xD24</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>SVCALLPENDED</name>
							<description>SVCALLPENDED</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Pending</name>
									<description>SVCall is not pending</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pending</name>
									<description>SVCall is pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SHPR2</name>
					<description>System Handler Priority Register 2</description>
					<addressOffset>0xD1C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>PRI_11</name>
							<description>Priority of System Handler 11, SVCall</description>
							<lsb>30</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SHPR3</name>
					<description>System Handler Priority Register 3</description>
					<addressOffset>0xD20</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>PRI_15</name>
							<description>Priority of System Handler 15, SysTick</description>
							<lsb>30</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_14</name>
							<description>Priority of System Handler 14, PendSV</description>
							<lsb>22</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SYSTICK_CALIB</name>
					<description>SysTick Calibration Value Register</description>
					<addressOffset>0x01C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>NOREF</name>
							<description>No Reference Clock</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SKEW</name>
							<description>Skew</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TENMS</name>
							<description>Tenms</description>
							<lsb>0</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SYSTICK_CSR</name>
					<description>SysTick Control and Status Register</description>
					<addressOffset>0x010</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>COUNTFLAG</name>
							<description>Count Flag</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CLKSOURCE</name>
							<description>CLK Source</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>External</name>
									<description>external reference clock</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Processor</name>
									<description>processor clock</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TICKINT</name>
							<description>TICKINT</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Exception</name>
									<description>counting down to 0 does not assert the SysTick exception request.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Exception</name>
									<description>counting down to 0 asserts the SysTick exception request.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ENABLE</name>
							<description>Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>counter disabled.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>counter enabled.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SYSTICK_CVR</name>
					<description>SysTick Current Value Register</description>
					<addressOffset>0x018</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>CURRENT</name>
							<description>Current</description>
							<lsb>0</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SYSTICK_RVR</name>
					<description>SysTick Reload Value Register</description>
					<addressOffset>0x014</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>RELOAD</name>
							<description>Reload</description>
							<lsb>0</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
