cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
				<register>
					<name>T6CON</name>
					<description>Timer T6 Control Register</description>
					<addressOffset>0x18</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>T6SR</name>
							<description>Timer T6 Reload Mode Enable</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Reload from register CAPREL disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled</name>
									<description>Reload from register CAPREL enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T6CLR</name>
							<description>Timer T6 Clear Enable Bit</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not cleared</name>
									<description>Timer T6 is not cleared on a capture event</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Cleared</name>
									<description>Timer T6 is cleared on a capture event</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BPS2</name>
							<description>GPT2 Block Prescaler Control</description>
							<lsb>11</lsb>
							<msb>12</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>4</name>
									<description>fGPT/4</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2</name>
									<description>fGPT/2</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16</name>
									<description>fGPT/16</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8</name>
									<description>fGPT/8</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T6OTL</name>
							<description>Timer T6 Overflow Toggle Latch</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T6OE</name>
							<description>Overflow/Underflow Output Enable</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Alternate Output Function Disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T6OUT</name>
									<description>State of T6 toggle latch is output on pin T6OUT</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T6UDE</name>
							<description>Timer T6 External Up/Down Enable</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>T6UD</name>
									<description>Count direction is controlled by bit T6UD; input T6EUD is disconnected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T6EUD</name>
									<description>Count direction is controlled by input T6EUD</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T6UD</name>
							<description>Timer T6 Up/Down Control</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Up</name>
									<description>Timer T3 counts up</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Down</name>
									<description>Timer T3 counts down</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T6R</name>
							<description>Timer T6 Input Run Bit</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Stop</name>
									<description>Timer T3 stops</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Run</name>
									<description>Timer T3 runs</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T6M</name>
							<description>Timer T6 Mode Control</description>
							<lsb>3</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Timer Mode</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Counter Mode</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Gated Timer Mode with gate active low</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Gated Timer Mode with gate active high</description>
									<value>0b011</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T6I</name>
							<description>Timer T6 Input Parameter Selection</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
