cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>HS</name>
			<description>HS</description>
			<baseAddress>0x40024000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x4000</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CTRL</name>
					<description>High Side Driver Control</description>
					<addressOffset>0x04</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>HS1_OC_SEL</name>
							<description>High Side 1 Overcurrent Threshold Selection</description>
							<lsb>12</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>IOCTH0</name>
									<description>25 mA min.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>IOCTH1</name>
									<description>50 mA min.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>IOCTH2</name>
									<description>100 mA min.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>IOCTH3</name>
									<description>150 mA min.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS1_SR_CTRL_SEL</name>
							<description>High Side 1 Slew Rate Control select</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Slew Rate 1</name>
									<description>Slow Slew Rate 3V/us is enabled</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Slew Rate 2</name>
									<description>Fast Slew Rate 40V/us is enabled</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Slew Rate 3</name>
									<description>Low EMC Slew Rate 1V/us is enabled (for low EMC emissions)</description>
									<value>0b10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS1_OL_EN</name>
							<description>High Side 1 Open Load Detection Enable</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>disable open load detection</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>enable open load detection</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS1_ON</name>
							<description>High Side 1 On</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>OFF</name>
									<description>HS driver off</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ON</name>
									<description>HS driver on</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS1_PWM</name>
							<description>High Side 1 PWM Enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>disables control by PWM input</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>enables control by PWM input</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS1_EN</name>
							<description>High Side 1 Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>HS circuit power off</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>HS circuit power on</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>IRQCLR</name>
					<description>High Side Driver Interrupt Status Clear Register</description>
					<addressOffset>0x0C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>HS1_OL_SC</name>
							<description>High Side 1 Open Load Status Clear</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS1_OT_SC</name>
							<description>High Side 1 Overtemperature Status Clear</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS1_OC_ISC</name>
							<description>High Side 1 Overcurrent Interrupt Status Clear</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS1_OL_ISC</name>
							<description>High Side 1 Open Load Interrupt Status Clear</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS1_OT_ISC</name>
							<description>High Side 1 Overtemperature Interrupt Status Clear</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>IRQEN</name>
					<description>High Side Driver Interrupt Enable Register</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>HS1_OC_IEN</name>
							<description>High Side 1 Overcurrent Interrupt Enable</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS1_OL_IEN</name>
							<description>High Side 1 Open Load Interrupt Enable</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS1_OT_IEN</name>
							<description>High Side 1 Overtemperature Interrupt Enable</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disabled</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>IRQS</name>
					<description>High Side Driver Interrupt Status</description>
					<addressOffset>0x08</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>HS1_OL_STS</name>
							<description>High Side 1 Open Load Status</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Open Load</name>
									<description>no open load Condition occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Open Load</name>
									<description>open load occurred; switch is not automatically shutdown. Write sets status.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS1_OT_STS</name>
							<description>High Side 1 Overtemperature Status</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Overtemperature</name>
									<description>no overtemperature occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overtemperature</name>
									<description>overtemperature occurred; switch is automatically shutdown. Write sets status.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS1_OC_IS</name>
							<description>High Side 1 Overcurrent Interrupt Status</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Overcurrent</name>
									<description>no overcurrent Condition occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overcurrent</name>
									<description>overcurrent occurred; switch is automatically shutdown. Write sets status.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS1_OL_IS</name>
							<description>High Side 1 Open Load Interrupt Status</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>normal load</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OPEN LOAD</name>
									<description>open load detected, write sets status</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS1_OT_IS</name>
							<description>High Side 1 Overtemperature Interrupt Status</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Overtemperature</name>
									<description>no overtemperature occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overtemperature</name>
									<description>overtemperature occurred; switch is automatically shutdown. Write sets status</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PWMSRCSEL</name>
					<description>High Side PWM Source Selection Register</description>
					<addressOffset>0x24</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>HS1_SRC_SEL</name>
							<description>HS1 PWM Source Selection</description>
							<lsb>3</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CC60</name>
									<description>PWM output of CCU6</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC61</name>
									<description>PWM output of CCU6</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC62</name>
									<description>PWM output of CCU6</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUT60</name>
									<description>PWM output of CCU6</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUT61</name>
									<description>PWM output of CCU6</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUT62</name>
									<description>PWM output of CCU6</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T3OUT</name>
									<description>PWM output of GPT12</description>
									<value>0b110</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>TRIM</name>
					<description>High Side Driver 1 TRIM</description>
					<addressOffset>0x1C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>HS1_OC_OT_BTFILT_SEL</name>
							<description>Blanking Time Filter Select for HS1 overcurrent / overtemperature detection</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>4_us</name>
									<description>4 us filter time</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8_us</name>
									<description>8 us filter time</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16_us</name>
									<description>16 us filter time</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>32_us</name>
									<description>32 us filter time</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS1_OL_BTFILT_SEL</name>
							<description>Blanking Time Filter Select for HS1 open Load detection</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>4_us</name>
									<description>4 us filter time</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8_us</name>
									<description>8 us filter time</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16_us</name>
									<description>16 us filter time</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>32_us</name>
									<description>32 us filter time</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
