cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>MATH</name>
			<description>MATH</description>
			<baseAddress>0x48013000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>INTISR15</name>
				<description>Interrupt node 15: Math Div</description>
				<value>15</value>
			</interrupt>
			<registers>
				<register>
					<name>DIVCON</name>
					<description>Divider Control Register</description>
					<addressOffset>0x34</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>DVSSRC</name>
							<description>Divisor Shift Right Count</description>
							<lsb>24</lsb>
							<msb>28</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DVDSLC</name>
							<description>Dividend Shift Left Count</description>
							<lsb>16</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>QSDIR</name>
							<description>Quotient Shift Direction</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Left shift</name>
									<description>Left shift</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Right Shift</name>
									<description>Right shift</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>QSCNT</name>
							<description>Quotient Shift Count</description>
							<lsb>8</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DIVMODE</name>
							<description>Division Mode</description>
							<lsb>3</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>32-32</name>
									<description>32-bit divide by 32-bit</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>32-16</name>
									<description>32-bit divide by 16-bit</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16-16</name>
									<description>16-bit divide by 16-bit</description>
									<value>0b10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>USIGN</name>
							<description>Unsigned Division Enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>signed</name>
									<description>Signed division is selected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>unsigned</name>
									<description>Unsigned division is selected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>STMODE</name>
							<description>Start Mode</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Auto</name>
									<description>Calculation is automatically started with a write to DVS register</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Manual</name>
									<description>Calculation is started by setting the ST bit to 1</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ST</name>
							<description>Start Bit</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no effect</name>
									<description>No effect</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Start</name>
									<description>Start the division operation when STMODE=1#</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>DIVST</name>
					<description>Divider Status Register</description>
					<addressOffset>0x30</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>BSY</name>
							<description>Busy Indication</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>finish</name>
									<description>Divider is not running any division operation.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>busy</name>
									<description>Divider is still running a division operation.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>DVD</name>
					<description>Dividend Register</description>
					<addressOffset>0x20</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>VAL</name>
							<description>Dividend Value</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DVS</name>
					<description>Divisor Register</description>
					<addressOffset>0x24</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>VAL</name>
							<description>Divisor Value</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVFCR</name>
					<description>Event Flag Clear Register</description>
					<addressOffset>0x18</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>DIVERRC</name>
							<description>Divider Error Event Flag Clear</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no effect</name>
									<description>No effect.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>clear</name>
									<description>Clears the Divider error event flag in EVFR register.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DIVEOCC</name>
							<description>Divider End of Calculation Event Flag Clear</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no effect</name>
									<description>No effect.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>clear</name>
									<description>Clears the Divider end of calculation event flag in EVFR register.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>EVFR</name>
					<description>Event Flag Register</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>DIVERR</name>
							<description>Divider Error Event Flag</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Error</name>
									<description>Divider error event has not been detected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Error</name>
									<description>Divider error event has been detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DIVEOC</name>
							<description>Divider End of Calculation Event Flag</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no EOC</name>
									<description>Divider end of calculation event has not been detected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EOC</name>
									<description>Divider end of calculation event has been detected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>EVIER</name>
					<description>Event Interupt Enable Register</description>
					<addressOffset>0x0C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>DIVERRIEN</name>
							<description>Divider Error Interrupt Enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>Divider error interrupt generation is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>Divider error interrupt generation is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DIVEOCIEN</name>
							<description>Divider End of Calculation Interrupt Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>Divider end of calculation interrupt generation is disabled.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>Divider end of calculation interrupt generation is enabled.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>EVSFR</name>
					<description>Event Flag Set Register</description>
					<addressOffset>0x14</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>DIVERRS</name>
							<description>Divider Error Event Flag Set</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no effect</name>
									<description>No effect.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Set</name>
									<description>Sets the Divider error event flag in EVFR register. Interrupt will be generated if enabled in EVIER register.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DIVEOCS</name>
							<description>Divider End of Calculation Event Flag Set</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no effect</name>
									<description>No effect.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Set</name>
									<description>Sets the Divider end of calculation event flag in EVFR register. Interrupt will be generated if enabled in EVIER register.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>GLBCON</name>
					<description>Global Control Register</description>
					<addressOffset>0x04</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>MATH_EN</name>
							<description>Enable Math Module</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Enable</name>
									<description>Math module is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disable</name>
									<description>Math module is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SUSCFG</name>
							<description>Suspend Mode Configuration</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no suspend</name>
									<description>Suspend mode is never entered.</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>hard suspend</name>
									<description>Hard suspend mode will be entered when CPU is halted.</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>soft suspend</name>
									<description>Soft suspend mode will be entered when CPU is halted.</description>
									<value>0b10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DVSRC</name>
							<description>Divisor Register Result Chaining</description>
							<lsb>3</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disabled</name>
									<description>No result chaining is selected</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>QUOT</name>
									<description>QUOT register is the selected source</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RMD</name>
									<description>RMD register is the selected source</description>
									<value>0b10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DVDRC</name>
							<description>Dividend Register Result Chaining</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disabled</name>
									<description>No result chaining is selected</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>QUOT</name>
									<description>QUOT register is the selected source</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RMD</name>
									<description>RMD register is the selected source</description>
									<value>0b10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>MATH_ID</name>
					<description>Module Identification Register</description>
					<addressOffset>0x08</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>MOD_NUMBER</name>
							<description>Module Number Value</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_TYPE</name>
							<description>Module Type</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_REV</name>
							<description>Module Revision Number</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>QUOT</name>
					<description>Quotient Register</description>
					<addressOffset>0x28</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>VAL</name>
							<description>Quotient Value</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RMD</name>
					<description>Remainder Register</description>
					<addressOffset>0x2C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>VAL</name>
							<description>Remainder Value</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
