cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>MF</name>
			<description>MF</description>
			<baseAddress>0x48018000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x4000</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CSA_CTRL</name>
					<description>Current Sense Amplifier Control Register</description>
					<addressOffset>0x00</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>CSA_VZERO</name>
							<description>Current Sense Output Selection</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>VOUT</name>
									<description>CSA output connected to ADC1 Ch13</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VZERO</name>
									<description>voltage reference connected to ADC1 Ch13</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CSA_MI_EN</name>
							<description>Enable Module Isolation Testmode</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CSA_GAIN</name>
							<description>Operational Amplifier Gain Setting</description>
							<lsb>1</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>10</name>
									<description>Gain Factor 10</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>20</name>
									<description>Gain Factor 20</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>40</name>
									<description>Gain Factor 40</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>60</name>
									<description>Gain Factor 60</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CSA_EN</name>
							<description>CSA Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>OPA switched off</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>OPA switched on</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>REF1_STS</name>
					<description>Reference 1 Status Register</description>
					<addressOffset>0x14</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>VREF1V2_UPTHWARN_STS</name>
							<description>Status for Overvoltage Threshold Measurement of internal VAREF</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>UPPER_TRIG_RESET</name>
									<description>write clears status</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UPPER_TRIG_SET</name>
									<description>trigger status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VREF1V2_LOTHWARN_STS</name>
							<description>Status for Undervoltage Threshold Measurement of internal VAREF</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>UPPER_TRIG_RESET</name>
									<description>write clears status</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UPPER_TRIG_SET</name>
									<description>trigger status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>PMU</name>
			<description>PMU</description>
			<baseAddress>0x50004000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>INTISR14</name>
				<description>Interrupt node 14: Wakeup</description>
				<value>14</value>
			</interrupt>
			<interrupt>
				<name>INTISR22</name>
				<description>Interrupt node 22: MONx</description>
				<value>22</value>
			</interrupt>
			<registers>
				<register>
					<name>CNF_RST_TFB</name>
					<description>Reset Blind Time Register</description>
					<addressOffset>0x06C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>RST_TFB</name>
							<description>Reset Pin Blind Time Selection Bits</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>RST_TFB_0</name>
									<description>0.5 us typ.</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RST_TFB_1</name>
									<description>1 us typ.</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RST_TFB_2</name>
									<description>5 us typ.</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RST_TFB_3</name>
									<description>31 us typ.</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CNF_WAKE_FILTER</name>
					<description>PMU Wake-up Timing Register</description>
					<addressOffset>0x0AC</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>CNF_GPIO_FT</name>
							<description>Wake-up Filter time for General Purpose IO</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>10_us</name>
									<description>10 us filter time</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>20_us</name>
									<description>20 us filter time</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>40_us</name>
									<description>40 us filter time</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>5_us</name>
									<description>5 us filter time</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CNF_MON_FT</name>
							<description>Wake-up Filter time for Monitoring Inputs</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>20_us</name>
									<description>20 us filter time</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>40_us</name>
									<description>40 us filter time</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CNF_LIN_FT</name>
							<description>Wake-up Filter time for LIN WAKE</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50_us</name>
									<description>50 us filter time</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>30_us</name>
									<description>30 us filter time</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>DRV_CTRL</name>
					<description>PMU Bridge Driver Control</description>
					<addressOffset>0x024</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>CNF_OFF</name>
							<description>CNF_OFF Function</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>400 us</name>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>800 us</name>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2000 us</name>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4000 us</name>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CNF_ON</name>
							<description>CNF_ON Function</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>50 us</name>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>100 us</name>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>200 us</name>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>400 us</name>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GL2_HOLD_ON</name>
							<description>GL2 Hold Mode On</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GL2_CYC_ON</name>
							<description>GL2 Cyclic On</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GL1_HOLD_ON</name>
							<description>GL1 Hold Mode On</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GL1_CYC_ON</name>
							<description>GL1 Cyclic On</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>GPIO_WAKE_STATUS</name>
					<description>GPIO Port wake status register</description>
					<addressOffset>0x004</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>GPIO1_STS_4</name>
							<description>Wake GPIO1_4</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No wake-up detected</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>wake-up detected</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO1_STS_2</name>
							<description>Wake GPIO1_2</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No wake-up detected</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>wake-up detected</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO1_STS_1</name>
							<description>Wake GPIO1_1</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No wake-up detected</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>wake-up detected</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO1_STS_0</name>
							<description>Wake GPIO1_0</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No wake-up detected</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>wake-up detected</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO0_STS_5</name>
							<description>Status of GPIO0_5</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No wake-up detected</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>wake-up detected</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO0_STS_4</name>
							<description>Status of GPIO0_4</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No wake-up detected</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>wake-up detected</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO0_STS_3</name>
							<description>Status of GPIO0_3</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No wake-up detected</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>wake-up detected</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO0_STS_2</name>
							<description>Status of GPIO0_2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No wake-up detected</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>wake-up detected</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO0_STS_1</name>
							<description>Status of GPIO0_1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No wake-up detected</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>wake-up detected</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO0_STS_0</name>
							<description>Status of GPIO0_0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No wake-up detected</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>wake-up detected</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>GPUDATA0to3</name>
					<description>General Purpose User DATA0to3</description>
					<addressOffset>0x0C0</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>DATA3</name>
							<description>DATA3 Storage Byte</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DATA2</name>
							<description>DATA2 Storage Byte</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DATA1</name>
							<description>DATA1 Storage Byte</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DATA0</name>
							<description>DATA0 Storage Byte</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GPUDATA4to7</name>
					<description>General Purpose User DATA4to7</description>
					<addressOffset>0x0C4</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>DATA7</name>
							<description>DATA7 Storage Byte</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DATA6</name>
							<description>DATA6 Storage Byte</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DATA5</name>
							<description>DATA5 Storage Byte</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DATA4</name>
							<description>DATA4 Storage Byte</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GPUDATA8to11</name>
					<description>General Purpose User DATA8to11</description>
					<addressOffset>0x0C8</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>DATA11</name>
							<description>DATA11 Storage Byte</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DATA10</name>
							<description>DATA10 Storage Byte</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DATA9</name>
							<description>DATA9 Storage Byte</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DATA8</name>
							<description>DATA8 Storage Byte</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HIGHSIDE_CTRL</name>
					<description>Highside Control Register</description>
					<addressOffset>0x05C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>SPARE</name>
							<description>Spare</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>HS1_CYC_EN</name>
							<description>High-Side 1 switch enable for cyclic sense</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>LIN_WAKE_EN</name>
					<description>LIN Wake Enable</description>
					<addressOffset>0x050</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>LIN_WAKE_EN</name>
							<description>Lin Wake enable</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Wake Disabled</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Wake enabled</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
