cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
				<register>
					<name>MON_CNF2</name>
					<description>Settings Monitor</description>
					<addressOffset>0x038</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>MON5_STS</name>
							<description>MON5 Status Input</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Low</name>
									<description>MON input has low status</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>High</name>
									<description>MON input has high status</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MON5_NSLEEP_SPARE</name>
							<description>MON5 Sleep Bit</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Sleep Mode</name>
									<description>internal MON output forced to 0</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Active Mode</name>
									<description>internal MON output not forced to 0</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MON5_PU</name>
							<description>Pull-Up Current Source for MON5 Input Enable</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>Pull-up source disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>Pull-up source enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MON5_PD</name>
							<description>Pull-Down Current Source for MON5 Input Enable</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>Pull-down source disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>Pull-down source enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MON5_CYC</name>
							<description>MON5 for Cycle Sense Enable</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>Cycle Sense disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>Cycle Sense enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MON5_RISE</name>
							<description>MON5 Wake-up on Rising Edge Enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>Wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>Wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MON5_FALL</name>
							<description>MON5 Wake-up on Falling Edge Enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>Wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>Wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MON5_EN</name>
							<description>MON5 Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>MON5 disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>MON5 enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>OT_CTRL</name>
					<description>Overtemperature Control Register</description>
					<addressOffset>0x054</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>PMU_OT_EN</name>
							<description>PMU Overtemperature Detection Enable</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>Overtemperature detection disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>Overtemperature detection enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_OT_WAKE_EN</name>
							<description>PMU Wake On Overtemperature Enable</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>no Wake-Up on OT condition</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>Wake-Up on OT condition</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_OT_INT_EN</name>
							<description>PMU Overtemperature Interrupt Enable</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Interrupt</name>
									<description>Interrupt on OT disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Interrupt</name>
									<description>Interrupt on OT enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_OT_TH_CNF</name>
							<description>PMU Overtemperature threshold</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>0</name>
									<description>131 degree C</description>
									<value>0b0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1</name>
									<description>136 degree C</description>
									<value>0b0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2</name>
									<description>141 degree C</description>
									<value>0b0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3</name>
									<description>146 degree C</description>
									<value>0b0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4</name>
									<description>152 degree C</description>
									<value>0b0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>5</name>
									<description>157 degree C</description>
									<value>0b0101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>6</name>
									<description>163 degree C</description>
									<value>0b0110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>7</name>
									<description>169 degree C</description>
									<value>0b0111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8</name>
									<description>175 degree C</description>
									<value>0b1000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>9</name>
									<description>181 degree C</description>
									<value>0b1001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>10</name>
									<description>187 degree C</description>
									<value>0b1010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>11</name>
									<description>193 degree C</description>
									<value>0b1011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>12</name>
									<description>200 degree C</description>
									<value>0b1100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>13</name>
									<description>206 degree C</description>
									<value>0b1101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>14</name>
									<description>214 degree C</description>
									<value>0b1110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>15</name>
									<description>221 degree C</description>
									<value>0b1111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PORCFG</name>
					<description>POR Reset Configuration Register</description>
					<addressOffset>0x0B4</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>CNF_FILT</name>
							<description>Configuration for reset filter</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RESET_STS</name>
					<description>Reset Status Register</description>
					<addressOffset>0x010</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>LOCKUP</name>
							<description>Lockup-Reset Flag</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Reset</name>
									<description>No Lockup-Reset executed</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>Lockup-Reset executed</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_SOFT</name>
							<description>Soft-Reset Flag</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Reset</name>
									<description>No Soft-Reset executed</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>Soft-Reset executed</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_IntWDT</name>
							<description>Internal Watchdog Reset Flag</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Reset</name>
									<description>No Internal Watchdog reset executed</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>Internal Watchdog reset executed</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_VS_POR</name>
							<description>Power-On Reset Flag</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Reset</name>
									<description>No Power-On reset executed</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>Power-On reset executed</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_PIN</name>
							<description>PIN-Reset Flag</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Reset</name>
									<description>No PIN-Reset executed</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>PIN-Reset executed</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_ExtWDT</name>
							<description>External Watchdog (WDT1) Reset Flag</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Reset</name>
									<description>No External Watchdog reset executed</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>External Watchdog reset executed</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_ClkWDT</name>
							<description>Clock Watchdog (CLKWDT) Reset Flag</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Reset</name>
									<description>No Clock Watchdog reset executed</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>Clock Watchdog reset executed</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_LPR</name>
							<description>Low Priority Resets (see PMU_RST_STS2)</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Reset</name>
									<description>No Low Priority reset executed</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>Low Priority reset executed</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_SleepEX</name>
							<description>Flag which indicates a reset caused by Sleep-Exit</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Reset</name>
									<description>No reset caused by Sleep-Exit executed</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>Reset caused by Sleep-Exit executed</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_WAKE</name>
							<description>Flag which indicates a reset caused by Stop-Exit</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Reset</name>
									<description>No reset caused by Stop-Exit executed</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>Reset caused by Stop-Exit executed</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYS_FAIL</name>
							<description>Flag which indicates a reset caused by a System Fail reported in the corresponding Fail Register</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Reset</name>
									<description>No reset caused by System Fail executed</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>Reset caused by System Fail executed</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
