cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
				<register>
					<name>SLEEP</name>
					<description>PMU Sleep Behavior Register</description>
					<addressOffset>0x020</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>CYC_SENSE_S_DEL</name>
							<description>Sample Delay in Cyclic Sense</description>
							<lsb>24</lsb>
							<msb>26</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>0</name>
									<description>10 us typ.</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1</name>
									<description>20 us typ.</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2</name>
									<description>30 us typ.</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3</name>
									<description>40 us typ.</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4</name>
									<description>60 us typ.</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>5</name>
									<description>80 us typ.</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>6</name>
									<description>100 us typ.</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>7</name>
									<description>150 us typ.</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CYC_WAKE_E01</name>
							<description>Exponent</description>
							<lsb>20</lsb>
							<msb>21</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>0</name>
									<description>Exponent value is 0</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1</name>
									<description>Exponent value is 1</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2</name>
									<description>Exponent value is 2</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3</name>
									<description>Exponent value is 3</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CYC_WAKE_M03</name>
							<description>Mantissa</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1</name>
									<description>Mantissa value is 1</description>
									<value>0b0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16</name>
									<description>Mantissa value is 16</description>
									<value>0b1111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CYC_SENSE_E01</name>
							<description>Exponent</description>
							<lsb>12</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>0</name>
									<description>Exponent value is 0</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1</name>
									<description>Exponent value is 1</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2</name>
									<description>Exponent value is 2</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3</name>
									<description>Exponent value is 3</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CYC_SENSE_M03</name>
							<description>Mantissa</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1</name>
									<description>Mantissa value is 1</description>
									<value>0b0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16</name>
									<description>Mantissa value is 16</description>
									<value>0b1111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CYC_SENSE_EN</name>
							<description>Enabling Cyclic Sense</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>Cyclic Sense disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>Cyclic Sense enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CYC_WAKE_EN</name>
							<description>Enabling Cyclic Wake</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>Cyclic Wake disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>Cyclic Wake enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EN_0V9_N</name>
							<description>Enables the reduction of the VDDC regulator output to 0.9 V during Stop-Mode</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Enable</name>
									<description>Output voltage reduction enabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disable</name>
									<description>Output voltage reduction disabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WAKE_W_RST</name>
							<description>Wake-up with reset execution</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Reset</name>
									<description>Stop-Exit without reset execution</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>Stop-Exit with reset execution</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SUPPLY_STS</name>
					<description>Voltage Reg Status Register</description>
					<addressOffset>0x008</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>PMU_5V_OVERLOAD_SC</name>
							<description>Overload at VDDP regulator Status clear</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Clear</name>
									<description>Overload status not cleared</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<description>Overload status cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_5V_OVERVOLT_SC</name>
							<description>Overvoltage at VDDP regulator Status clear</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Clear</name>
									<description>Overvoltage status not cleared</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<description>Overvoltage status cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_OVERTEMP_SC</name>
							<description>Overtemperature Status clear</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Clear</name>
									<description>Overtemperature status not cleared</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<description>Overtemperature status cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_1V5_OVERLOAD_SC</name>
							<description>Overload at VDDC regulator Status clear</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Clear</name>
									<description>Overload status not cleared</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<description>Overload status cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_1V5_OVERVOLT_SC</name>
							<description>Overvoltage at VDDC regulator Status clear</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Clear</name>
									<description>Overvoltage status not cleared</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<description>Overvoltage status cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_5V_FAIL_EN</name>
							<description>Enabling of VDDP status information as interrupt source</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>No interrupts are generated</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>Interrupts are generated</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_5V_OVERLOAD</name>
							<description>Overload at VDDP regulator</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No overload</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overload</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_5V_OVERVOLT</name>
							<description>Overvoltage at VDDP regulator</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No overvoltage</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overvoltage</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_OVERTEMP</name>
							<description>PMU Overtemperature</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No overtemperature</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overtemperature</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_1V5_FAIL_EN</name>
							<description>Enabling of VDDC status information as interrupt source</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>No interrupts are generated</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>Interrupts are generated</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_1V5_OVERLOAD</name>
							<description>Overload at VDDC regulator</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No overload</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overload</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_1V5_OVERVOLT</name>
							<description>Overvoltage at VDDC regulator</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No overvoltage</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overvoltage</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>VDDEXT_CTRL</name>
					<description>VDDEXT Control</description>
					<addressOffset>0x00C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>VDDEXT_OT_SC</name>
							<description>VDDEXT Supply Overtemperature Status clear</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Clear</name>
									<description>VDDEXT Overtemperature status not cleared</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<description>VDDEXT Overtemperature status cleared</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDDEXT_UV_ISC</name>
							<description>VDDEXT Supply Undervoltage Interrupt Status clear</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Clear</name>
									<description>VDDEXT Undervoltage not cleared</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<description>VDDEXT Undervoltage cleared</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDDEXT_OT_ISC</name>
							<description>VDDEXT Supply Overtemperature Interrupt Status clear</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Clear</name>
									<description>VDDEXT OverTemperature not cleared</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<description>VDDEXT OverTemperature cleared</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDDEXT_STABLE</name>
							<description>VDDEXT Supply Stable</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>VDDEXT not in stable condition</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VDDEXT in stable condition</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDDEXT_OT</name>
							<description>VDDEXT Supply Overtemperature</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>VDDEXT not in overtemperature condition</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VDDEXT in overtemperature condition</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDDEXT_OT_STS</name>
							<description>VDDEXT Supply Overtemperature Status</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>VDDEXT not in overtemperature condition</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VDDEXT in overtemperature condition</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDDEXT_UV_IS</name>
							<description>VDDEXT Supply Undervoltage Interrupt Status</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>VDDEXT not in undervoltage condition</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VDDEXT in undervoltage condition</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDDEXT_OT_IS</name>
							<description>VDDEXT Supply OverTemperature Interrupt Status</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>VDDEXT no overtemperature condition</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VDDEXT overtemperature condition</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDDEXT_FAIL_EN</name>
							<description>Enabling of VDDEXT Supply status information as interrupt source</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>VDDEXT fail interrupts are disable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>VDDEXT fail Interrupts are enable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDDEXT_CYC_EN</name>
							<description>VDDEXT Supply for Cyclic Sense Enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>VDDEXT for cyclic sense disable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>VDDEXT for cyclic sense enable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDDEXT_ENABLE</name>
							<description>VDDEXT Supply Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>VDDEXT Supply disable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>VDDEXT supply enable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
