cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
				<register>
					<name>WAKE_CNF_GPIO0</name>
					<description>Wake Configuration GPIO Port 0 Register</description>
					<addressOffset>0x0BC</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>CYC_5</name>
							<description>GPIO0_5 input for cycle sense enable</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>input for cycle sense enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>input for cycle sense disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CYC_4</name>
							<description>GPIO0_4 input for cycle sense enable</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>input for cycle sense enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>input for cycle sense disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CYC_3</name>
							<description>GPIO0_3 input for cycle sense enable</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>input for cycle sense enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>input for cycle sense disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CYC_2</name>
							<description>GPIO0_2 input for cycle sense enable</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>input for cycle sense enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>input for cycle sense disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CYC_1</name>
							<description>GPIO0_1 input for cycle sense enable</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>input for cycle sense enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>input for cycle sense disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CYC_0</name>
							<description>GPIO0_0 input for cycle sense enable</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>input for cycle sense enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>input for cycle sense disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FA_5</name>
							<description>Port 0_5 Wake-up on Falling Edge enable</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FA_4</name>
							<description>Port 0_4 Wake-up on Falling Edge enable</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FA_3</name>
							<description>Port 0_3 Wake-up on Falling Edge enable</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FA_2</name>
							<description>Port 0_2 Wake-up on Falling Edge enable</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FA_1</name>
							<description>Port 0_1 Wake-up on Falling Edge enable</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FA_0</name>
							<description>Port 0_0 Wake-up on Falling Edge enable</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RI_5</name>
							<description>Port 0_5 Wake-up on Rising Edge enable</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RI_4</name>
							<description>Port 0_4 Wake-up on Rising Edge enable</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RI_3</name>
							<description>Port 0_3 Wake-up on Rising Edge enable</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RI_2</name>
							<description>Port 0_2 Wake-up on Rising Edge enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RI_1</name>
							<description>Port 0_1 Wake-up on Rising Edge enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RI_0</name>
							<description>Port 0_0 Wake-up on Rising Edge enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>WAKE_CNF_GPIO1</name>
					<description>Wake Configuration GPIO Port 1 Register</description>
					<addressOffset>0x0CC</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>CYC_4</name>
							<description>GPIO1_4 input for cycle sense enable</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>input for cycle sense enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>input for cycle sense disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CYC_2</name>
							<description>GPIO1_2 input for cycle sense enable</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>input for cycle sense enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>input for cycle sense disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CYC_1</name>
							<description>GPIO1_1 input for cycle sense enable</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>input for cycle sense enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>input for cycle sense disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CYC_0</name>
							<description>GPIO1_0 input for cycle sense enable</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>input for cycle sense enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>input for cycle sense disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FA_4</name>
							<description>Port 1_4 Wake-up on Falling Edge enable</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FA_2</name>
							<description>Port 1_2 Wake-up on Falling Edge enable</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FA_1</name>
							<description>Port 1_1 Wake-up on Falling Edge enable</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FA_0</name>
							<description>Port 1_0 Wake-up on Falling Edge enable</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RI_4</name>
							<description>Port 1_4 Wake-up on Rising Edge enable</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RI_2</name>
							<description>Port 1_2 Wake-up on Rising Edge enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RI_1</name>
							<description>Port 1_1 Wake-up on Rising Edge enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RI_0</name>
							<description>Port 1_0 Wake-up on Rising Edge enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
