cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
				<register>
					<name>WAKE_STATUS</name>
					<description>Main wake status register</description>
					<addressOffset>0x000</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>VDDEXT_UV</name>
							<description>Wake VDDEXT Undervoltage</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No wake-up detected</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>wake-up detected</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDDEXT_OT</name>
							<description>Wake VDDEXT Overtemperature</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No wake-up detected</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>wake-up detected</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_OT</name>
							<description>Wake PMU Overtemperature</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No wake-up detected</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>wake-up detected</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MON5_WAKE_STS</name>
							<description>Status of MON5</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No wake-up detected</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>wake-up detected</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MON4_WAKE_STS</name>
							<description>Status of MON4</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No wake-up detected</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>wake-up detected</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MON3_WAKE_STS</name>
							<description>Status of MON3</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No wake-up detected</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>wake-up detected</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MON2_WAKE_STS</name>
							<description>Status of MON2</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No wake-up detected</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>wake-up detected</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MON1_WAKE_STS</name>
							<description>Status of MON1</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No wake-up detected</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>wake-up detected</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO2</name>
							<description>Wake-up via GPIO2 which is a logical OR combination of all Wake_STS_GPIO2 bits</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Wake-up occurred</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Wake-up occurred</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FAIL</name>
							<description>Wake-up after any Fail, which is a logical OR combination of PMU_OT, VDDEXT_OT, VDDEXT_UV</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Wake-up occurred</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Wake-up occurred</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CYC_WAKE</name>
							<description>Wake-up caused by Cyclic Wake</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Wake-up occurred</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Wake-up occurred</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO1</name>
							<description>Wake-up via GPIO1 which is a logical OR combination of all Wake_STS_GPIO1 bits</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Wake-up occurred</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Wake-up occurred</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIO0</name>
							<description>Wake-up via GPIO0 which is a logical OR combination of all Wake_STS_GPIO0 bits</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Wake-up occurred</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Wake-up occurred</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MON</name>
							<description>Wake-up via MON which is a logical OR combination of all Wake_STS_MON bits</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Wake-up occurred</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Wake-up occurred</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LIN_WAKE</name>
							<description>Wake-up via LIN- Message</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Wake-up occurred</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Wake-up occurred</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>WFS</name>
					<description>WFS System Fail Register</description>
					<addressOffset>0x070</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>PMU_OT_FAIL</name>
							<description>PMU Overtemperature Indication Flag</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Overtemperature</name>
									<description>PMU ok</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overtemperature</name>
									<description>PMU Overtemperature</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LP_CLKWD</name>
							<description>LP_CLKWD</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ok</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>fail</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WDT1_SEQ_FAIL</name>
							<description>External Watchdog (WDT1) Sequential Fail</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Fail</name>
									<description>System working properly</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Sequential Watchdog Fail</name>
									<description>5 consecutive watchdog fails</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYS_OT</name>
							<description>System Overtemperature Indication Flag</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Overtemperature</name>
									<description>System ok</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overtemperature</name>
									<description>System Overtemperature</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYS_CLK_WDT</name>
							<description>System Clock (fsys)Watchdog Fail</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No System Clock Fail</name>
									<description>fsys ok</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>System Clock Fail</name>
									<description>fsys failed</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_5V_OVL</name>
							<description>VDDP Overload Flag</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Overload</name>
									<description>VDDP ok</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overload</name>
									<description>VDDP Overload</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_1V5_OVL</name>
							<description>VDDC Overload Flag</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Overload</name>
									<description>VDDC ok</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overload</name>
									<description>Hall VDDC Overload</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SUPP_TMOUT</name>
							<description>Supply Time Out</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Main Supply ok</name>
									<description>VDDP or VDDC are in expected range</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Main Supply fail</name>
									<description>VDDP or VDDC do not have stable operating point</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SUPP_SHORT</name>
							<description>Supply Short</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Main Supply ok</name>
									<description>VDDP or VDDC are in expected range</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Main Supply short</name>
									<description>VDDP or VDDC are in short circuit condition</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
