cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
				<register>
					<name>P0_PUDEN</name>
					<description>Port 0 Pull-Up/Pull-Down Enable Register</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>PP5</name>
							<description>Pull-Up/Pull-Down Enable at Port 0 Bit 5</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Pull-up or Pull-down device is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled</name>
									<description>Pull-up or Pull-down device is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP4</name>
							<description>Pull-Up/Pull-Down Enable at Port 0 Bit 4</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Pull-up or Pull-down device is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled</name>
									<description>Pull-up or Pull-down device is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP3</name>
							<description>Pull-Up/Pull-Down Enable at Port 0 Bit 3</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Pull-up or Pull-down device is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled</name>
									<description>Pull-up or Pull-down device is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP2</name>
							<description>Pull-Up/Pull-Down Enable at Port 0 Bit 2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Pull-up or Pull-down device is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled</name>
									<description>Pull-up or Pull-down device is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP1</name>
							<description>Pull-Up/Pull-Down Enable at Port 0 Bit 1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Pull-up or Pull-down device is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled</name>
									<description>Pull-up or Pull-down device is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP0</name>
							<description>Pull-Up/Pull-Down Enable at Port 0 Bit 0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Pull-up or Pull-down device is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled</name>
									<description>Pull-up or Pull-down device is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>P0_PUDSEL</name>
					<description>Port 0 Pull-Up/Pull-Down Select Register</description>
					<addressOffset>0x0C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>PP5</name>
							<description>Pull-Up/Pull-Down Select Port 0 Bit 5</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Pull-down</name>
									<description>Pull-down device is selected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pull-up</name>
									<description>Pull-up device is selected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP4</name>
							<description>Pull-Up/Pull-Down Select Port 0 Bit 4</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Pull-down</name>
									<description>Pull-down device is selected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pull-up</name>
									<description>Pull-up device is selected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP3</name>
							<description>Pull-Up/Pull-Down Select Port 0 Bit 3</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Pull-down</name>
									<description>Pull-down device is selected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pull-up</name>
									<description>Pull-up device is selected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP2</name>
							<description>Pull-Up/Pull-Down Select Port 0 Bit 2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Pull-down</name>
									<description>Pull-down device is selected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pull-up</name>
									<description>Pull-up device is selected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP1</name>
							<description>Pull-Up/Pull-Down Select Port 0 Bit 1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Pull-down</name>
									<description>Pull-down device is selected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pull-up</name>
									<description>Pull-up device is selected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP0</name>
							<description>Pull-Up/Pull-Down Select Port 0 Bit 0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Pull-down</name>
									<description>Pull-down device is selected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pull-up</name>
									<description>Pull-up device is selected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>P1_ALTSEL0</name>
					<description>Port 1 Alternate Select Register 0</description>
					<addressOffset>0x34</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>PP4</name>
							<description>See</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PP2</name>
							<description>See</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PP1</name>
							<description>See</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PP0</name>
							<description>See</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>P1_ALTSEL1</name>
					<description>Port 1 Alternate Select Register 1</description>
					<addressOffset>0x38</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>PP4</name>
							<description>See</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PP2</name>
							<description>See</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PP1</name>
							<description>See</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PP0</name>
							<description>See</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>P1_DATA</name>
					<description>Port 1 Data Register</description>
					<addressOffset>0x20</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>PP4_STS</name>
							<description>Port 1 Pin 4 Data Value (read back of Port Data when IO is configured as output)</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>0</name>
									<description>Port 0 pin 4 data value = 0</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1</name>
									<description>Port 0 pin 4 data value = 1</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP2_STS</name>
							<description>Port 1 Pin 2 Data Value (read back of Port Data when IO is configured as output)</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>0</name>
									<description>Port 0 pin 2 data value = 0</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1</name>
									<description>Port 0 pin 2 data value = 1</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP1_STS</name>
							<description>Port 1 Pin 1 Data Value (read back of Port Data when IO is configured as output)</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>0</name>
									<description>Port 0 pin 1 data value = 0</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1</name>
									<description>Port 0 pin 1 data value = 1</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP0_STS</name>
							<description>Port 1 Pin 0 Data Value (read back of Port Data when IO is configured as output)</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>0</name>
									<description>Port 0 pin 0 data value = 0</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1</name>
									<description>Port 0 pin 0 data value = 1</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP4</name>
							<description>Port 1 Pin 4 Data Value</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>0</name>
									<description>Port 0 pin 4 data value = 0</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1</name>
									<description>Port 0 pin 4 data value = 1</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP2</name>
							<description>Port 1 Pin 2 Data Value</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>0</name>
									<description>Port 0 pin 2 data value = 0</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1</name>
									<description>Port 0 pin 2 data value = 1</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP1</name>
							<description>Port 1 Pin 1 Data Value</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>0</name>
									<description>Port 0 pin 1 data value = 0</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1</name>
									<description>Port 0 pin 1 data value = 1</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP0</name>
							<description>Port 1 Pin 0 Data Value</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>0</name>
									<description>Port 0 pin 0 data value = 0</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1</name>
									<description>Port 0 pin 0 data value = 1</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>P1_DIR</name>
					<description>Port 1 Direction Register</description>
					<addressOffset>0x24</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>PP4_INEN</name>
							<description>Port 1 Pin 4 Input Schmitt Trigger enable (only valid if IO is configured as output)</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>0</name>
									<description>Schmitt Trigger is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1</name>
									<description>Schmitt Trigger is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP2_INEN</name>
							<description>Port 1 Pin 2 Input Schmitt Trigger enable (only valid if IO is configured as output)</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>0</name>
									<description>Schmitt Trigger is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1</name>
									<description>Schmitt Trigger is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP1_INEN</name>
							<description>Port 1 Pin 1 Input Schmitt Trigger enable (only valid if IO is configured as output)</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>0</name>
									<description>Schmitt Trigger is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1</name>
									<description>Schmitt Trigger is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP0_INEN</name>
							<description>Port 1 Pin 0 Input Schmitt Trigger enable (only valid if IO is configured as output)</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>0</name>
									<description>Schmitt Trigger is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1</name>
									<description>Schmitt Trigger is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP4</name>
							<description>Port 1 Pin 4 Direction Control</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Input</name>
									<description>Direction is set to input</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Output</name>
									<description>Direction is set to output</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP2</name>
							<description>Port 1 Pin 2 Direction Control</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Input</name>
									<description>Direction is set to input</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Output</name>
									<description>Direction is set to output</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP1</name>
							<description>Port 1 Pin 1 Direction Control</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Input</name>
									<description>Direction is set to input</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Output</name>
									<description>Direction is set to output</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP0</name>
							<description>Port 1 Pin 0 Direction Control</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Input</name>
									<description>Direction is set to input</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Output</name>
									<description>Direction is set to output</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>P1_OD</name>
					<description>Port 1 Open Drain Control Register</description>
					<addressOffset>0x28</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>PP4</name>
							<description>Port 1 Pin 4 Open Drain Mode</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Normal Mode</name>
									<description>Output is actively driven for 0 and 1 state</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Open Drain Mode</name>
									<description>Output is actively driven only for 0 state</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP2</name>
							<description>Port 1 Pin 2 Open Drain Mode</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Normal Mode</name>
									<description>Output is actively driven for 0 and 1 state</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Open Drain Mode</name>
									<description>Output is actively driven only for 0 state</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP1</name>
							<description>Port 1 Pin 1 Open Drain Mode</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Normal Mode</name>
									<description>Output is actively driven for 0 and 1 state</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Open Drain Mode</name>
									<description>Output is actively driven only for 0 state</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP0</name>
							<description>Port 1 Pin 0 Open Drain Mode</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Normal Mode</name>
									<description>Output is actively driven for 0 and 1 state</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Open Drain Mode</name>
									<description>Output is actively driven only for 0 state</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
