cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
				<register>
					<name>P1_PUDEN</name>
					<description>Port 1 Pull-Up/Pull-Down Enable Register</description>
					<addressOffset>0x30</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>PP4</name>
							<description>Pull-Up/Pull-Down Enable at Port 1 Bit 4</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Pull-up or Pull-down device is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled</name>
									<description>Pull-up or Pull-down device is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP2</name>
							<description>Pull-Up/Pull-Down Enable at Port 1 Bit 2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Pull-up or Pull-down device is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled</name>
									<description>Pull-up or Pull-down device is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP1</name>
							<description>Pull-Up/Pull-Down Enable at Port 1 Bit 1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Pull-up or Pull-down device is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled</name>
									<description>Pull-up or Pull-down device is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP0</name>
							<description>Pull-Up/Pull-Down Enable at Port 1 Bit 0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Pull-up or Pull-down device is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled</name>
									<description>Pull-up or Pull-down device is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>P1_PUDSEL</name>
					<description>Port 1 Pull-Up/Pull-Down Select Register</description>
					<addressOffset>0x2C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>PP4</name>
							<description>Pull-Up/Pull-Down Select Port 1 Bit 4</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Pull-down</name>
									<description>Pull-down device is selected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pull-up</name>
									<description>Pull-up device is selected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP2</name>
							<description>Pull-Up/Pull-Down Select Port 1 Bit 2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Pull-down</name>
									<description>Pull-down device is selected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pull-up</name>
									<description>Pull-up device is selected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP1</name>
							<description>Pull-Up/Pull-Down Select Port 1 Bit 1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Pull-down</name>
									<description>Pull-down device is selected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pull-up</name>
									<description>Pull-up device is selected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP0</name>
							<description>Pull-Up/Pull-Down Select Port 1 Bit 0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Pull-down</name>
									<description>Pull-down device is selected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pull-up</name>
									<description>Pull-up device is selected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>P2_DATA</name>
					<description>Port 2 Data Register</description>
					<addressOffset>0x40</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>PP7</name>
							<description>Port 2 Pin 7 Data Value</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>0</name>
									<description>Port 2 pin 7 data value = 0</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1</name>
									<description>Port 2 pin 7 data value = 1</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP3</name>
							<description>Port 2 Pin 3 Data Value</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>0</name>
									<description>Port 2 pin 3 data value = 0</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1</name>
									<description>Port 2 pin 3 data value = 1</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP2</name>
							<description>Port 2 Pin 2 Data Value</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>0</name>
									<description>Port 2 pin 2 data value = 0</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1</name>
									<description>Port 2 pin 2 data value = 1</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP1</name>
							<description>Port 2 Pin 1 Data Value</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>0</name>
									<description>Port 2 pin 1 data value = 0</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1</name>
									<description>Port 2 pin 1 data value = 1</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP0</name>
							<description>Port 2 Pin 0 Data Value</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>0</name>
									<description>Port 2 pin 0 data value = 0</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1</name>
									<description>Port 2 pin 0 data value = 1</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>P2_DIR</name>
					<description>Port 2 Direction Register</description>
					<addressOffset>0x44</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>PP7</name>
							<description>Port 2 Pin 7 Driver Control</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Enabled</name>
									<description>Input driver is enabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Input driver is disabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP3</name>
							<description>Port 2 Pin 3 Driver Control</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Enabled</name>
									<description>Input driver is enabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Input driver is disabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP2</name>
							<description>Port 2 Pin 2 Driver Control</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Enabled</name>
									<description>Input driver is enabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Input driver is disabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP1</name>
							<description>Port 2 Pin 1 Driver Control</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Enabled</name>
									<description>Input driver is enabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Input driver is disabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP0</name>
							<description>Port 2 Pin 0 Driver Control</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Enabled</name>
									<description>Input driver is enabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Input driver is disabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>P2_PUDEN</name>
					<description>Port 2 Pull-Up/Pull-Down Enable Register</description>
					<addressOffset>0x50</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>PP7</name>
							<description>Pull-Up/Pull-Down Enable at Port 2 Bit 7</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Pull-up or Pull-down device is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled</name>
									<description>Pull-up or Pull-down device is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP3</name>
							<description>Pull-Up/Pull-Down Enable at Port 2 Bit 3</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Pull-up or Pull-down device is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled</name>
									<description>Pull-up or Pull-down device is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP2</name>
							<description>Pull-Up/Pull-Down Enable at Port 2 Bit 2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Pull-up or Pull-down device is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled</name>
									<description>Pull-up or Pull-down device is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP1</name>
							<description>Pull-Up/Pull-Down Enable at Port 2 Bit 1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Pull-up or Pull-down device is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled</name>
									<description>Pull-up or Pull-down device is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP0</name>
							<description>Pull-Up/Pull-Down Enable at Port 2 Bit 0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disabled</name>
									<description>Pull-up or Pull-down device is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enabled</name>
									<description>Pull-up or Pull-down device is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>P2_PUDSEL</name>
					<description>Port 2 Pull-Up/Pull-Down Select Register</description>
					<addressOffset>0x4C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>PP7</name>
							<description>Pull-Up/Pull-Down Select Port 2 Bit 7</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Pull-down</name>
									<description>Pull-down device is selected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pull-up</name>
									<description>Pull-up device is selected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP3</name>
							<description>Pull-Up/Pull-Down Select Port 2 Bit 3</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Pull-down</name>
									<description>Pull-down device is selected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pull-up</name>
									<description>Pull-up device is selected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP2</name>
							<description>Pull-Up/Pull-Down Select Port 2 Bit 2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Pull-down</name>
									<description>Pull-down device is selected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pull-up</name>
									<description>Pull-up device is selected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP1</name>
							<description>Pull-Up/Pull-Down Select Port 2 Bit 1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Pull-down</name>
									<description>Pull-down device is selected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pull-up</name>
									<description>Pull-up device is selected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PP0</name>
							<description>Pull-Up/Pull-Down Select Port 2 Bit 0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Pull-down</name>
									<description>Pull-down device is selected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pull-up</name>
									<description>Pull-up device is selected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
