cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>SCU</name>
			<description>SCU</description>
			<baseAddress>0x50005000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>INTISR12</name>
				<description>Interrupt node 12: EINT0</description>
				<value>12</value>
			</interrupt>
			<interrupt>
				<name>INTISR13</name>
				<description>Interrupt node 13: EINT1</description>
				<value>13</value>
			</interrupt>
			<registers>
				<register>
					<name>ADC1_CLK</name>
					<description>ADC1 Peripheral Clock Register</description>
					<addressOffset>0x06C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>DPP1_CLK_DIV</name>
							<description>ADC1 Post processing clock divider</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>div 1</name>
									<description>Divide by 1</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 2</name>
									<description>Divide by 2</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 3</name>
									<description>Divide by 3</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 4</name>
									<description>Divide by 4</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADC1_CLK_DIV</name>
							<description>ADC1 Clock divider</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>div 1</name>
									<description>Divide by 1</description>
									<value>0b0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 2</name>
									<description>Divide by 2</description>
									<value>0b0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 3</name>
									<description>Divide by 3</description>
									<value>0b0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 4</name>
									<description>Divide by 4</description>
									<value>0b0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 5</name>
									<description>Divide by 5</description>
									<value>0b0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 6</name>
									<description>Divide by 6</description>
									<value>0b0101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 7</name>
									<description>Divide by 7</description>
									<value>0b0110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 8</name>
									<description>Divide by 8</description>
									<value>0b0111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 15</name>
									<description>Divide by 15</description>
									<value>0b1110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 16</name>
									<description>Divide by 16</description>
									<value>0b1111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>APCLK</name>
					<description>Analog Peripheral Clock Register</description>
					<addressOffset>0x058</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>CPCLK_DIV</name>
							<description>Charge Pump Clock Divider</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>div 2</name>
									<description>divide by 2</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 1</name>
									<description>divide by 1</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CPCLK_SEL</name>
							<description>Charge Pump Clock Selection</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>LP_CLK</name>
									<description>LP_CLK is selected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>f_sys</name>
									<description>fsys is selected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BGCLK_DIV</name>
							<description>Bandgap Clock Divider</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>div 2</name>
									<description>divide by 2</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 1</name>
									<description>divide by 1</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BGCLK_SEL</name>
							<description>Bandgap Clock Selection</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>LP_CLK</name>
									<description>LP_CLK is selected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>f_sys</name>
									<description>fsys is selected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>APCLK2FAC</name>
							<description>Slow Down Clock Divider for TFILT_CLK Generation</description>
							<lsb>8</lsb>
							<msb>12</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>div 1</name>
									<description>fsys</description>
									<value>0b00000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 2</name>
									<description>fsys/2</description>
									<value>0b00001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 3</name>
									<description>fsys/3</description>
									<value>0b00010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 4</name>
									<description>fsys/4</description>
									<value>0b00011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 5</name>
									<description>fsys/5</description>
									<value>0b00100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 6</name>
									<description>fsys/6</description>
									<value>0b00101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 7</name>
									<description>fsys/7</description>
									<value>0b00110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 8</name>
									<description>fsys/8</description>
									<value>0b00111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 9</name>
									<description>fsys/9</description>
									<value>0b01000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 10</name>
									<description>fsys/10</description>
									<value>0b01001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 11</name>
									<description>fsys/11</description>
									<value>0b01010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 12</name>
									<description>fsys/12</description>
									<value>0b01011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 31</name>
									<description>fsys/31</description>
									<value>0b11110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 32</name>
									<description>fsys/32</description>
									<value>0b11111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>APCLK1FAC</name>
							<description>Analog Module Clock Factor</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>div 1</name>
									<description>Divide by 1</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 2</name>
									<description>Divide by 2</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 3</name>
									<description>Divide by 3</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 4</name>
									<description>Divide by 4</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>APCLK_CTRL</name>
					<description>Analog Peripheral Clock Control Register</description>
					<addressOffset>0x054</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>CLKWDT_IE</name>
							<description>Clock Watchdog Interrupt Enable</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disabled</name>
									<description>Interrupt disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enabled</name>
									<description>Interrupt enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>APCLK_SET</name>
							<description>Set and Overtake Flag for Clock Settings</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ignore</name>
									<description>Clock Settings are ignored (previous values are held)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>update</name>
									<description>Clock Settings are overtaken</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>APCLK_SCLR</name>
					<description>Analog Peripheral Clock Status Clear Register</description>
					<addressOffset>0x064</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>APCLK3SCLR</name>
							<description>Analog Peripherals Clock 3 Status Clear</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>APCLK2SCLR</name>
							<description>Analog Peripherals Clock Status Clear</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>APCLK1SCLR</name>
							<description>Analog Peripherals Clock Status Clear</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>APCLK_STS</name>
					<description>Analog Peripheral Clock Status Register</description>
					<addressOffset>0x05C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>PLL_LOCK</name>
							<description>PLL LOCK Status</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no lock</name>
									<description>PLL has not locked</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>lock</name>
									<description>PLL has locked</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BRDRV_CLK_ERR_STS</name>
							<description>BRDRV CLK Error Status</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Error</name>
									<description>no Error writing was not blocked</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Error</name>
									<description>Error writing was blocked</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>APCLK3STS</name>
							<description>Loss of Clock Status</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no loss</name>
									<description>No loss of clock</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>loss</name>
									<description>Loss of clock occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>APCLK2STS</name>
							<description>Analog Peripherals Clock Status</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>OK</name>
									<description>The TFILT_CLK clock is in the required range</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Too high</name>
									<description>The TFILT_CLK clock exceeds the higher limit</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Too low</name>
									<description>The TFILT_CLK clock exceeds the lower limit</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Out of Limit</name>
									<description>The TFILT_CLK clock is not inside the specified limit.</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>APCLK_ERR_STS</name>
							<description>APCLK Error Status</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Error</name>
									<description>no Error writing was not blocked</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Error</name>
									<description>Error writing was blocked</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>APCLK1STS</name>
							<description>Analog Peripherals Clock Status</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>OK</name>
									<description>The MI_CLK clock is in the required range</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>too high</name>
									<description>The MI_CLK clock exceeds the higher limit</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>too low</name>
									<description>The MI_CLK clock exceeds the lower limit</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>out of limit</name>
									<description>The MI_CLK clock is not inside the specified limit.</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>BCON1</name>
					<description>Baud Rate Control Register 1</description>
					<addressOffset>0x088</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>BR1_PRE</name>
							<description>Prescaler Bit</description>
							<lsb>1</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>div 1</name>
									<description>fDIV = fPCLK</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 2</name>
									<description>fDIV = fPCLK/2</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 4</name>
									<description>fDIV = fPCLK/4</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 8</name>
									<description>fDIV = fPCLK/8</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 16</name>
									<description>fDIV = fPCLK/16</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 32</name>
									<description>fDIV = fPCLK/32</description>
									<value>0b101</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BR1_R</name>
							<description>Baud Rate Generator Run Control Bit</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>Baud-rate generator disabled.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>Baud-rate generator enabled.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>BCON2</name>
					<description>Baud Rate Control Register 2</description>
					<addressOffset>0x098</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>BR2_PRE</name>
							<description>Prescaler Bit</description>
							<lsb>1</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>div 1</name>
									<description>fDIV = fPCLK</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 2</name>
									<description>fDIV = fPCLK/2</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 4</name>
									<description>fDIV = fPCLK/4</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 8</name>
									<description>fDIV = fPCLK/8</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 16</name>
									<description>fDIV = fPCLK/16</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 32</name>
									<description>fDIV = fPCLK/32</description>
									<value>0b101</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BR2_R</name>
							<description>Baud Rate Generator Run Control Bit</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>Baud-rate generator disabled.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>Baud-rate generator enabled.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>BG1</name>
					<description>Baud Rate Timer/Reload Register</description>
					<addressOffset>0x090</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>BG1_TIM_VALUE</name>
							<description>Baud Rate Timer Value</description>
							<lsb>16</lsb>
							<msb>26</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Bypassed</name>
									<description>Baud-rate timer is bypassed.</description>
									<value>0x000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1</name>
									<value>0x001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2</name>
									<value>0x002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2046</name>
									<value>0x7FE</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2047</name>
									<value>0x7FF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BG1_BR_VALUE</name>
							<description>Baud Rate Reload Value</description>
							<lsb>0</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Bypass</name>
									<description>Baud-rate timer is bypassed.</description>
									<value>0x000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1</name>
									<value>0x001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2</name>
									<value>0x002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2046</name>
									<value>0x7FE</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2047</name>
									<value>0x7FF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
