cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
				<register>
					<name>BG2</name>
					<description>Baud Rate Timer/Reload Register</description>
					<addressOffset>0x0A0</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>BG2_TIM_VALUE</name>
							<description>Baud Rate Timer Value</description>
							<lsb>16</lsb>
							<msb>26</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Bypassed</name>
									<description>Baud-rate timer is bypassed.</description>
									<value>0x000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1</name>
									<value>0x001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2</name>
									<value>0x002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2046</name>
									<value>0x7FE</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2047</name>
									<value>0x7FF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BG2_BR_VALUE</name>
							<description>Baud Rate Reload Value</description>
							<lsb>0</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Bypass</name>
									<description>Baud-rate timer is bypassed.</description>
									<value>0x000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1</name>
									<value>0x001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2</name>
									<value>0x002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2046</name>
									<value>0x7FE</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2047</name>
									<value>0x7FF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>BGL1</name>
					<description>Baud Rate Timer/Reload Register, Low Byte 1</description>
					<addressOffset>0x08C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>BG1_FD_SEL</name>
							<description>Fractional Divider Selection</description>
							<lsb>0</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BGL2</name>
					<description>Baud Rate Timer/Reload Register, Low Byte 2</description>
					<addressOffset>0x09C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>BG2_FD_SEL</name>
							<description>Fractional Divider Selection</description>
							<lsb>0</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BRDRV_CLK</name>
					<description>ADC1 Peripheral Clock Register</description>
					<addressOffset>0x150</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>BRDRV_TFILT_DIV</name>
							<description>Slow Down Clock Divider for TFILT_CLK Generation</description>
							<lsb>8</lsb>
							<msb>12</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>div 1</name>
									<description>fsys</description>
									<value>0b00000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 2</name>
									<description>fsys/2</description>
									<value>0b00001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 3</name>
									<description>fsys/3</description>
									<value>0b00010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 4</name>
									<description>fsys/4</description>
									<value>0b00011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 5</name>
									<description>fsys/5</description>
									<value>0b00100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 6</name>
									<description>fsys/6</description>
									<value>0b00101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 7</name>
									<description>fsys/7</description>
									<value>0b00110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 8</name>
									<description>fsys/8</description>
									<value>0b00111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 9</name>
									<description>fsys/9</description>
									<value>0b01000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 10</name>
									<description>fsys/10</description>
									<value>0b01001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 11</name>
									<description>fsys/11</description>
									<value>0b01010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 12</name>
									<description>fsys/12</description>
									<value>0b01011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 31</name>
									<description>fsys/31</description>
									<value>0b11110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 32</name>
									<description>fsys/32</description>
									<value>0b11111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BRDRV_CLK_DIV</name>
							<description>Analog Module Clock Factorf</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>div 1</name>
									<description>Divide by 1</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 2</name>
									<description>Divide by 2</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 3</name>
									<description>Divide by 3</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 4</name>
									<description>Divide by 4</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CMCON1</name>
					<description>Clock Control Register 1</description>
					<addressOffset>0x048</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>PDIV</name>
							<description>PLL PDIV-Divider:</description>
							<lsb>8</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>0</name>
									<description>P = 4</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1</name>
									<description>P = 4</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2</name>
									<description>P = 4</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3</name>
									<description>P = 4</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4</name>
									<description>P = 4</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>5</name>
									<description>P = 5 (default)</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>6</name>
									<description>P = 6, ...</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>50</name>
									<description>P = 50</description>
									<value>50</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>51</name>
									<description>P = 50, ...</description>
									<value>51</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>63</name>
									<description>P = 50</description>
									<value>63</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>K1DIV</name>
							<description>PLL K1-Divider</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>div 2</name>
									<description>K1 = 2</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 1</name>
									<description>K1 = 1</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>K2DIV</name>
							<description>PLL K2-Divider</description>
							<lsb>4</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>div 2</name>
									<description>K2 = 2 (default)</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 3</name>
									<description>K2 = 3</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 4</name>
									<description>K2 = 4</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 5</name>
									<description>K2 = 5</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 6</name>
									<description>K2 = 6</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 7</name>
									<description>K2 = 7</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 8</name>
									<description>K2 = 8</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 9</name>
									<description>K2 = 9</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLKREL</name>
							<description>Slow Down Clock Divider for fCCLK Generation</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>div 1</name>
									<description>fsys</description>
									<value>0b0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 2</name>
									<description>fsys/2</description>
									<value>0b0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 3</name>
									<description>fsys/3</description>
									<value>0b0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 4</name>
									<description>fsys/4</description>
									<value>0b0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 8</name>
									<description>fsys/8</description>
									<value>0b0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 16</name>
									<description>fsys/16</description>
									<value>0b0101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 24</name>
									<description>fsys/24</description>
									<value>0b0110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 32</name>
									<description>fsys/32</description>
									<value>0b0111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 48</name>
									<description>fsys/48</description>
									<value>0b1000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 64</name>
									<description>fsys/64</description>
									<value>0b1001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 96</name>
									<description>fsys/96</description>
									<value>0b1010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 128</name>
									<description>fsys/128</description>
									<value>0b1011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 192</name>
									<description>fsys/192</description>
									<value>0b1100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 256</name>
									<description>fsys/256</description>
									<value>0b1101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 384</name>
									<description>fsys/384</description>
									<value>0b1110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 512</name>
									<description>fsys/512</description>
									<value>0b1111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CMCON2</name>
					<description>Clock Control Register 2</description>
					<addressOffset>0x04C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>PBA0CLKREL</name>
							<description>PBA0 Clock Divider</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>div 1</name>
									<description>divide by 1</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 2</name>
									<description>divide by 2</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>COCON</name>
					<description>Clock Output Control Register</description>
					<addressOffset>0x0B4</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>EN</name>
							<description>CLKOUT Enable</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disable</name>
									<description>No external clock signal is provided</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<description>The configured external clock signal is provided</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>COUTS1</name>
							<description>Clock Out Source Select Bit 1</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>f_cclk</name>
									<description>fCCLK is selected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUTS0</name>
									<description>Based on setting of COUTS0.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TLEN</name>
							<description>Toggle Latch Enable</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disable</name>
									<description>Toggle Latch is disabled. Clock output frequency is chosen by the bit field COREL.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<description>Toggle Latch is enabled. Clock output frequency is half of the frequency that is chosen by the bit field COREL. The resulting output frequency has 50 percent duty cycle.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>COUTS0</name>
							<description>Clock Out Source Select Bit 0</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Osc</name>
									<description>Oscillator output frequency is selected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COREL</name>
									<description>Clock output frequency is chosen by the bit field COREL.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>COREL</name>
							<description>Clock Output Divider</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>div 1</name>
									<description>fsys</description>
									<value>0b0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 2</name>
									<description>fsys/2</description>
									<value>0b0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 3</name>
									<description>fsys/3</description>
									<value>0b0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 4</name>
									<description>fsys/4</description>
									<value>0b0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 6</name>
									<description>fsys/6</description>
									<value>0b0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 8</name>
									<description>fsys/8</description>
									<value>0b0101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 10</name>
									<description>fsys/10</description>
									<value>0b0110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 12</name>
									<description>fsys/12</description>
									<value>0b0111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 14</name>
									<description>fsys/14</description>
									<value>0b1000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 16</name>
									<description>fsys/16</description>
									<value>0b1001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 18</name>
									<description>fsys/18</description>
									<value>0b1010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 20</name>
									<description>fsys/20</description>
									<value>0b1011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 24</name>
									<description>fsys/24</description>
									<value>0b1100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 32</name>
									<description>fsys/32</description>
									<value>0b1101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 36</name>
									<description>fsys/36</description>
									<value>0b1110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 40</name>
									<description>fsys/40</description>
									<value>0b1111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>EDCCON</name>
					<description>Error Detection and Correction Control Register</description>
					<addressOffset>0x0D4</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>NVMIE</name>
							<description>NVM Double Bit ECC Error Interrupt Enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>No NMI is generated when a double bit ECC error occurs reading NVM.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>An NMI is generated when a double bit ECC error occurs reading NVM.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RIE</name>
							<description>RAM Double Bit ECC Error Interrupt Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>No NMI is generated when a double bit ECC error occurs reading RAM.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>An NMI is generated when a double bit ECC error occurs reading RAM.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>EDCSCLR</name>
					<description>Error Detection and Correction Status Clear Register</description>
					<addressOffset>0x10C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>RSBEC</name>
							<description>RAM Single Bit Error Clear</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not cleared</name>
									<description>A single bit error on RAM is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Cleared</name>
									<description>A single bit error on RAM is cleared.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NVMDBEC</name>
							<description>NVM Double Bit Error Clear</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Cleared</name>
									<description>A double bit error on NVM is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Cleared</name>
									<description>A double bit error on NVM is cleared.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RDBEC</name>
							<description>RAM Double Bit Error Clear</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Cleared</name>
									<description>A double bit error on RAM is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Cleared</name>
									<description>A double bit error on RAM is cleared.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
