cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
				<register>
					<name>EDCSTAT</name>
					<description>Error Detection and Correction Status Register</description>
					<addressOffset>0x0D8</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>RSBE</name>
							<description>RAM Single Bit Error</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Error</name>
									<description>No single bit error on RAM has occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Error</name>
									<description>A single bit error on RAM has occurred.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NVMDBE</name>
							<description>NVM Double Bit Error</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Error</name>
									<description>No double bit error on NVM has occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Error</name>
									<description>A double bit error on NVM has occurred.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RDBE</name>
							<description>RAM Double Bit Error</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Error</name>
									<description>No double bit error on RAM has occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Error</name>
									<description>A double bit error on RAM has occurred.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>EXICON0</name>
					<description>External Interrupt Control Register 0</description>
					<addressOffset>0x028</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>EXINT2</name>
							<description>External Interrupt 2 Trigger Select</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disable</name>
									<description>Interrupt disabled.</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>rising</name>
									<description>Interrupt on rising edge.</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>falling</name>
									<description>Interrupt on falling edge.</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>both</name>
									<description>Interrupt on both rising and falling edge.</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXINT1</name>
							<description>External Interrupt 1 Trigger Select</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disable</name>
									<description>Interrupt disabled.</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>rising</name>
									<description>Interrupt on rising edge.</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>falling</name>
									<description>Interrupt on falling edge.</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>both</name>
									<description>Interrupt on both rising and falling edge.</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXINT0</name>
							<description>External Interrupt 0 Trigger Select</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>enable</name>
									<description>Interrupt disabled.</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>rising</name>
									<description>Interrupt on rising edge.</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>falling</name>
									<description>Interrupt on falling edge.</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>both</name>
									<description>Interrupt on both rising and falling edge.</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>EXICON1</name>
					<description>External Interrupt Control Register 1</description>
					<addressOffset>0x02C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>MON4</name>
							<description>MON4 Input Trigger Select</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disable</name>
									<description>external interrupt MON is disabled.</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>rising</name>
									<description>Interrupt on rising edge.</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>falling</name>
									<description>Interrupt on falling edge.</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>both</name>
									<description>Interrupt on both rising and falling edge.</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MON3</name>
							<description>MON3 Input Trigger Select</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disable</name>
									<description>external interrupt MON is disabled.</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>rising</name>
									<description>Interrupt on rising edge.</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>falling</name>
									<description>Interrupt on falling edge.</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>both</name>
									<description>Interrupt on both rising and falling edge.</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MON2</name>
							<description>MON2 Input Trigger Select</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disable</name>
									<description>external interrupt MON is disabled.</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>rising</name>
									<description>Interrupt on rising edge.</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>falling</name>
									<description>Interrupt on falling edge.</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>both</name>
									<description>Interrupt on both rising and falling edge.</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MON1</name>
							<description>MON1 Input Trigger Select</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disable</name>
									<description>external interrupt MON is disabled.</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>rising</name>
									<description>Interrupt on rising edge.</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>falling</name>
									<description>Interrupt on falling edge.</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>both</name>
									<description>Interrupt on both rising and falling edge.</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>GPT12ICLR</name>
					<description>Timer and Counter Control/Status Clear Register</description>
					<addressOffset>0x180</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>GPT12CRC</name>
							<description>GPT Module 1 Capture Reload Interrupt Status</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Cleared</name>
									<description>Interrupt event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Cleared</name>
									<description>Interrupt event is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPT2T6C</name>
							<description>GPT Module 2Timer6 Interrupt Status</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Cleared</name>
									<description>Interrupt event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Cleared</name>
									<description>Interrupt event is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPT2T5C</name>
							<description>GPT Module 2 Timer5 Interrupt Status</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Cleared</name>
									<description>Interrupt event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Cleared</name>
									<description>Interrupt event is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPT1T4C</name>
							<description>GPT Module 1 Timer4 Interrupt Status</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Cleared</name>
									<description>Interrupt event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Cleared</name>
									<description>Interrupt event is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPT1T3C</name>
							<description>GPT Module 1 Timer3 Interrupt Status</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Cleared</name>
									<description>Interrupt event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Cleared</name>
									<description>Interrupt event is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPT1T2C</name>
							<description>GPT Module 1 Timer 2 Interrupt Status</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Cleared</name>
									<description>Interrupt event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Cleared</name>
									<description>Interrupt event is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>GPT12IEN</name>
					<description>General Purpose Timer 12 Interrupt Enable Register</description>
					<addressOffset>0x15C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>CRIE</name>
							<description>General Purpose Timer 12 Capture and Reload Interrupt Enable</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T6IE</name>
							<description>General Purpose Timer 12 T6 Interrupt Enable</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T5IE</name>
							<description>General Purpose Timer 12 T5 Interrupt Enable</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T4IE</name>
							<description>General Purpose Timer 12 T4 Interrupt Enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T3IE</name>
							<description>General Purpose Timer 12 T3 Interrupt Enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T2IE</name>
							<description>General Purpose Timer 12 T2 Interrupt Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>GPT12IRC</name>
					<description>Timer and Counter Control/Status Register</description>
					<addressOffset>0x160</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>GPT12CR</name>
							<description>GPT Module 1 Capture Reload Interrupt Status</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Int</name>
									<description>No Capture Reload Interrupt has occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Int</name>
									<description>Capture Reload Interrupt has occurred.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPT2T6</name>
							<description>GPT Module 2Timer6 Interrupt Status</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Int</name>
									<description>No Timer 6 Interrupt has occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Int</name>
									<description>Timer 6 Interrupt has occurred.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPT2T5</name>
							<description>GPT Module 2 Timer5 Interrupt Status</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Int</name>
									<description>No Timer 5 Interrupt has occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Int</name>
									<description>Timer 5 Interrupt has occurred.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPT1T4</name>
							<description>GPT Module 1 Timer4 Interrupt Status</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Int</name>
									<description>No Timer 4 Interrupt has occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Int</name>
									<description>Timer 4 Interrupt has occurred.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPT1T3</name>
							<description>GPT Module 1 Timer3 Interrupt Status</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Int</name>
									<description>No Timer 3 Interrupt has occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Int</name>
									<description>Timer 3 Interrupt has occurred.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPT1T2</name>
							<description>GPT Module 1 Timer 2 Interrupt Status</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Int</name>
									<description>No Timer 2 Interrupt has occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Int</name>
									<description>Timer 2 Interrupt has occurred.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
