cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
				<register>
					<name>GPT12PISEL</name>
					<description>GPT12 Peripheral Input Select Register</description>
					<addressOffset>0x0D0</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>GPT12_SEL</name>
							<description>CCU6 Trigger Configuration.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>T_21</name>
									<description>CCU6_INT is triggered by Timer21</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GPT12</name>
									<description>CCU6_INT is triggered by GPT12PISEL.GPT12</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TRIG_CONF</name>
							<description>CCU6 Trigger Configuration.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Single</name>
									<description>Trigger is just for one measurement (default)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Edge</name>
									<description>Trigger is present until next input edge (selected by GPT12) - continuous measurement.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPT12</name>
							<description>GPT12 TIN3B / TIN4D Input Select</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CC60</name>
									<description>CC60</description>
									<value>0b0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC61</name>
									<description>CC61</description>
									<value>0b0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC62</name>
									<description>CC62</description>
									<value>0b0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T12 ZM</name>
									<description>T12 ZM</description>
									<value>0b0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T12 PM</name>
									<description>T12 PM</description>
									<value>0b0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T12 CM0</name>
									<description>T12 CM0</description>
									<value>0b0101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T12 CM1</name>
									<description>T12 CM1</description>
									<value>0b0110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T12 CM2</name>
									<description>T12 CM2</description>
									<value>0b0111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T13 PM</name>
									<description>T13 PM</description>
									<value>0b1000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T13 ZM</name>
									<description>T13 ZM</description>
									<value>0b1001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T13 CM</name>
									<description>T13 CM</description>
									<value>0b1010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Edge</name>
									<description>any pos or neg edge on CC60/61/62</description>
									<value>0b1011</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ID</name>
					<description>Identity Register</description>
					<addressOffset>0x0A8</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>PRODID</name>
							<description>Product ID</description>
							<lsb>3</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>VERID</name>
							<description>Version ID</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IEN0</name>
					<description>Interrupt Enable Register 0</description>
					<addressOffset>0x01C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>EA</name>
							<description>Global Interrupt Mask</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disable</name>
									<description>All pending interrupt requests (except NMI) are blocked from the core.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<description>Pending interrupt requests are not blocked from the core.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>IRCON0</name>
					<description>Interrupt Request Register 0</description>
					<addressOffset>0x004</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>EXINT2F</name>
							<description>Interrupt Flag for External Interrupt 2x on falling edge</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Int</name>
									<description>Interrupt on falling edge event has not occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>no Int</name>
									<description>Interrupt on falling edge event has occurred.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXINT2R</name>
							<description>Interrupt Flag for External Interrupt 2x on rising edge</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Int</name>
									<description>Interrupt on rising edge event has not occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>no Int</name>
									<description>Interrupt on rising edge event has occurred.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXINT1F</name>
							<description>Interrupt Flag for External Interrupt 1x on falling edge</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Int</name>
									<description>Interrupt on falling edge event has not occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>no Int</name>
									<description>Interrupt on falling edge event has occurred.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXINT1R</name>
							<description>Interrupt Flag for External Interrupt 1x on rising edge</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Int</name>
									<description>Interrupt on rising edge event has not occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>no Int</name>
									<description>Interrupt on rising edge event has occurred.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXINT0F</name>
							<description>Interrupt Flag for External Interrupt 0x on falling edge</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Int</name>
									<description>Interrupt on falling edge event has not occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>no Int</name>
									<description>Interrupt on falling edge event has occurred.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXINT0R</name>
							<description>Interrupt Flag for External Interrupt 0x on rising edge</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Int</name>
									<description>Interrupt on rising edge event has not occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>no Int</name>
									<description>Interrupt on rising edge event has occurred.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>IRCON0CLR</name>
					<description>Interrupt Request 0 Clear Register</description>
					<addressOffset>0x178</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>EXINT2FC</name>
							<description>Interrupt Flag for External Interrupt 2x on falling edge</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not cleared</name>
									<description>Interrupt event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>cleared</name>
									<description>Interrupt event is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXINT2RC</name>
							<description>Interrupt Flag for External Interrupt 2x on rising edge</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not cleared</name>
									<description>Interrupt event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>cleared</name>
									<description>Interrupt event is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXINT1FC</name>
							<description>Interrupt Flag for External Interrupt 1x on falling edge</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not cleared</name>
									<description>Interrupt event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>cleared</name>
									<description>Interrupt event is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXINT1RC</name>
							<description>Interrupt Flag for External Interrupt 1x on rising edge</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not cleared</name>
									<description>Interrupt event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>cleared</name>
									<description>Interrupt event is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXINT0FC</name>
							<description>Interrupt Flag for External Interrupt 0x on falling edge</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not cleared</name>
									<description>Interrupt event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>cleared</name>
									<description>Interrupt event is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXINT0RC</name>
							<description>Interrupt Flag for External Interrupt 0x on rising edge</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not cleared</name>
									<description>Interrupt event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>cleared</name>
									<description>Interrupt event is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>IRCON1</name>
					<description>Interrupt Request Register 1</description>
					<addressOffset>0x008</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>MON4F</name>
							<description>Interrupt Flag for MON4x on falling edge</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Int</name>
									<description>Interrupt on falling edge event has not occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Int</name>
									<description>Interrupt on falling edge event has occurred.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MON4R</name>
							<description>Interrupt Flag for MON4x on rising edge</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Int</name>
									<description>Interrupt on rising edge event has not occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Int</name>
									<description>Interrupt on rising edge event has occurred.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MON3F</name>
							<description>Interrupt Flag for MON3x on falling edge</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Int</name>
									<description>Interrupt on falling edge event has not occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Int</name>
									<description>Interrupt on falling edge event has occurred.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MON3R</name>
							<description>Interrupt Flag for MON3x on rising edge</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Int</name>
									<description>Interrupt on rising edge event has not occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Int</name>
									<description>Interrupt on rising edge event has occurred.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MON2F</name>
							<description>Interrupt Flag for MON2x on falling edge</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Int</name>
									<description>Interrupt on falling edge event has not occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Int</name>
									<description>Interrupt on falling edge event has occurred.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MON2R</name>
							<description>Interrupt Flag for MON2x on rising edge</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Int</name>
									<description>Interrupt on rising edge event has not occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Int</name>
									<description>Interrupt on rising edge event has occurred.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MON1F</name>
							<description>Interrupt Flag for MON1x on falling edge</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Int</name>
									<description>Interrupt on falling edge event has not occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Int</name>
									<description>Interrupt on falling edge event has occurred.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MON1R</name>
							<description>Interrupt Flag for MON1x on rising edge</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Int</name>
									<description>Interrupt on rising edge event has not occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Int</name>
									<description>Interrupt on rising edge event has occurred.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
