cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
				<register>
					<name>IRCON1CLR</name>
					<description>Interrupt Request 1 Clear Register</description>
					<addressOffset>0x17C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>MON4FC</name>
							<description>Interrupt Flag for MON4x on falling edge</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Cleared</name>
									<description>Interrupt event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Cleared</name>
									<description>Interrupt event is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MON4RC</name>
							<description>Interrupt Flag for MON4x on rising edge</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Cleared</name>
									<description>Interrupt event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Cleared</name>
									<description>Interrupt event is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MON3FC</name>
							<description>Interrupt Flag for MON3x on falling edge</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Cleared</name>
									<description>Interrupt event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Cleared</name>
									<description>Interrupt event is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MON3RC</name>
							<description>Interrupt Flag for MON3x on rising edge</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Cleared</name>
									<description>Interrupt event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Cleared</name>
									<description>Interrupt event is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MON2FC</name>
							<description>Interrupt Flag for MON2x on falling edge</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Cleared</name>
									<description>Interrupt event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Cleared</name>
									<description>Interrupt event is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MON2RC</name>
							<description>Interrupt Flag for MON2x on rising edge</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Cleared</name>
									<description>Interrupt event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Cleared</name>
									<description>Interrupt event is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MON1FC</name>
							<description>Interrupt Flag for MON1x on falling edge</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Cleared</name>
									<description>Interrupt event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Cleared</name>
									<description>Interrupt event is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MON1RC</name>
							<description>Interrupt Flag for MON1x on rising edge</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Cleared</name>
									<description>Interrupt event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Cleared</name>
									<description>Interrupt event is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>IRCON2</name>
					<description>Interrupt Request Register 2</description>
					<addressOffset>0x00C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>RIR1</name>
							<description>Receive Interrupt Flag for SSC1</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Cleared</name>
									<description>Interrupt event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Cleared</name>
									<description>Interrupt event is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TIR1</name>
							<description>Transmit Interrupt Flag for SSC1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Cleared</name>
									<description>Interrupt event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Cleared</name>
									<description>Interrupt event is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EIR1</name>
							<description>Error Interrupt Flag for SSC1</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Cleared</name>
									<description>Interrupt event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Cleared</name>
									<description>Interrupt event is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>IRCON2CLR</name>
					<description>Interrupt Request 2 Clear Register</description>
					<addressOffset>0x190</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>RIR1C</name>
							<description>Receive Interrupt Flag for SSC1</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Cleared</name>
									<description>Interrupt event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Cleared</name>
									<description>Interrupt event is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TIR1C</name>
							<description>Transmit Interrupt Flag for SSC1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Cleared</name>
									<description>Interrupt event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Cleared</name>
									<description>Interrupt event is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EIR1C</name>
							<description>Error Interrupt Flag for SSC1</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Cleared</name>
									<description>Interrupt event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Cleared</name>
									<description>Interrupt event is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>IRCON3</name>
					<description>Interrupt Request Register 3</description>
					<addressOffset>0x010</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>RIR2</name>
							<description>Receive Interrupt Flag for SSC2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Cleared</name>
									<description>Interrupt event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Cleared</name>
									<description>Interrupt event is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TIR2</name>
							<description>Transmit Interrupt Flag for SSC2</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Cleared</name>
									<description>Interrupt event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Cleared</name>
									<description>Interrupt event is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EIR2</name>
							<description>Error Interrupt Flag for SSC2</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Cleared</name>
									<description>Interrupt event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Cleared</name>
									<description>Interrupt event is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>IRCON3CLR</name>
					<description>Interrupt Request 3 Clear Register</description>
					<addressOffset>0x194</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>RIR2C</name>
							<description>Receive Interrupt Flag for SSC2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Cleared</name>
									<description>Interrupt event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Cleared</name>
									<description>Interrupt event is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TIR2C</name>
							<description>Transmit Interrupt Flag for SSC2</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Cleared</name>
									<description>Interrupt event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Cleared</name>
									<description>Interrupt event is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EIR2C</name>
							<description>Error Interrupt Flag for SSC2</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Cleared</name>
									<description>Interrupt event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Cleared</name>
									<description>Interrupt event is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>IRCON4</name>
					<description>Interrupt Request Register 4</description>
					<addressOffset>0x014</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>CCU6SR3</name>
							<description>Interrupt Flag 1 for CCU6</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Cleared</name>
									<description>Interrupt event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Cleared</name>
									<description>Interrupt event is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CCU6SR2</name>
							<description>Interrupt Flag 1 for CCU6</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Cleared</name>
									<description>Interrupt event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Cleared</name>
									<description>Interrupt event is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CCU6SR1</name>
							<description>Interrupt Flag 1 for CCU6</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Cleared</name>
									<description>Interrupt event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Cleared</name>
									<description>Interrupt event is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CCU6SR0</name>
							<description>Interrupt Flag 1 for CCU6</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Cleared</name>
									<description>Interrupt event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Cleared</name>
									<description>Interrupt event is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>IRCON4CLR</name>
					<description>Interrupt Request 4 Clear Register</description>
					<addressOffset>0x198</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>CCU6SR3C</name>
							<description>Interrupt Flag 1 for CCU6</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Cleared</name>
									<description>Interrupt event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Cleared</name>
									<description>Interrupt event is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CCU6SR2C</name>
							<description>Interrupt Flag 1 for CCU6</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Cleared</name>
									<description>Interrupt event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Cleared</name>
									<description>Interrupt event is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CCU6SR1C</name>
							<description>Interrupt Flag 1 for CCU6</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Cleared</name>
									<description>Interrupt event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Cleared</name>
									<description>Interrupt event is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CCU6SR0C</name>
							<description>Interrupt Flag 1 for CCU6</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Cleared</name>
									<description>Interrupt event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Cleared</name>
									<description>Interrupt event is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>IRCON5</name>
					<description>Interrupt Request Register 5</description>
					<addressOffset>0x0F0</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>WAKEUP</name>
							<description>Interrupt Flag for Wakeup</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Cleared</name>
									<description>Interrupt event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Cleared</name>
									<description>Interrupt event is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>IRCON5CLR</name>
					<description>Interrupt Request 5 Clear Register</description>
					<addressOffset>0x19C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>WAKEUPC</name>
							<description>Clear Flag for Wakeup Interrupt</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Cleared</name>
									<description>Interrupt event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Cleared</name>
									<description>Interrupt event is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>LINSCLR</name>
					<description>LIN Status Clear Register</description>
					<addressOffset>0x0A4</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>ERRSYNC</name>
							<description>SYN Byte Error Interrupt Flag</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not cleared</name>
									<description>Error in SYN Byte not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Cleared</name>
									<description>Error in SYN Byte cleared.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EOFSYNC</name>
							<description>End of SYN Byte Interrupt Flag Clear</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not cleared</name>
									<description>End of SYN Byte is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Cleared</name>
									<description>End of SYN Byte is cleared.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BRKC</name>
							<description>Break Field Flag Clear</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not cleared</name>
									<description>Break Field is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Cleared</name>
									<description>Break Field is cleared.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
