cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
				<register>
					<name>LINST</name>
					<description>LIN Status Register</description>
					<addressOffset>0x094</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>SYNEN</name>
							<description>End of SYN Byte and SYN Byte Error Interrupts Enable</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>End of SYN Byte and SYN Byte Error Interrupts are not enabled.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>End of SYN Byte and SYN Byte Error Interrupts are enabled.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ERRSYN</name>
							<description>SYN Byte Error Interrupt Flag</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>Error is not detected in SYN Byte.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>Error is detected in SYN Byte.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EOFSYN</name>
							<description>End of SYN Byte Interrupt Flag</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>End of SYN Byte is not detected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>End of SYN Byte is detected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BRK</name>
							<description>Break Field Flag</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>Break Field is not detected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>Break Field is detected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BGSEL</name>
							<description>Baud Rate Select for Detection</description>
							<lsb>1</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BRDIS</name>
							<description>Baud Rate Detection Disable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>Break/Synch detection is enabled.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>Break/Synch detection is disabled.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>MEM_ACC_STS</name>
					<description>Memory Access Status Register</description>
					<addressOffset>0x0E4</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>ROM_PROT_ERR</name>
							<description>ROM Access Protection</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Error</name>
									<description>No Protection error</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Error</name>
									<description>Protection error</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NVM_SFR_ADDR_ERR</name>
							<description>NVM SFR Address Protection</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Error</name>
									<description>No Protection error</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Error</name>
									<description>Protection error</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NVM_SFR_PROT_ERR</name>
							<description>NVM SFR Access Protection</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Error</name>
									<description>No Protection error</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Error</name>
									<description>Protection error</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NVM_ADDR_ERR</name>
							<description>NVM Address Protection</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Error</name>
									<description>No Protection error</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Error</name>
									<description>Protection error</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NVM_PROT_ERR</name>
							<description>NVM Access Protection</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Error</name>
									<description>No Protection error</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Error</name>
									<description>Protection error</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>MEMSTAT</name>
					<description>Memory Status Register</description>
					<addressOffset>0x0DC</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>RAM_TEST_MODE</name>
							<description>RAM Data Mode</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Full</name>
									<description>RAM test at cold reset executed on the whole RAM</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1K</name>
									<description>RAM test at cold reset executed only on 1st kb of RAM</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RAM_VAL_KEYS</name>
							<description>RAM valid keys</description>
							<lsb>20</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NVM_DATA_MODE</name>
							<description>NVM Data Mode</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1</name>
									<description>1 Non linearly mapped data sector</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2</name>
									<description>2 linearly mapped data sectors.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NVM_VAL_KEYS</name>
							<description>NVM valid keys</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SASTATUS</name>
							<description>Service Algorithm Status</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Success_1</name>
									<description>Depending on SECTORINFO, there are two possible outcomes: For SECTORINFO = 00H, NVM initialization is successful and no SA is executed. For SECTORINFO = values other than 00H, SA execution is successful and only one map error is fixed.</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Success_2</name>
									<description>SA execution is successful. More than one mapping error is fixed.</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Error_1</name>
									<description>SA execution is not successful. Map error exists</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Error_2</name>
									<description>NVM initialization failed, SA called but no page to be repaired has been found. Soft error present.</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SECTORINFO</name>
							<description>Sector Information</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MODIEN1</name>
					<description>Peripheral Interrupt Enable Register 1</description>
					<addressOffset>0x030</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>RIREN2</name>
							<description>SSC 2 Receive Interrupt Enable</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>Receive interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>Receive interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TIREN2</name>
							<description>SSC 2 Transmit Interrupt Enable</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>Transmit interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>Transmit interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EIREN2</name>
							<description>SSC 2 Error Interrupt Enable</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>Error interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>Error interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RIREN1</name>
							<description>SSC 1 Receive Interrupt Enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>Receive interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>Receive interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TIREN1</name>
							<description>SSC 1 Transmit Interrupt Enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>Transmit interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>Transmit interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EIREN1</name>
							<description>SSC 1 Error Interrupt Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>Error interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>Error interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>MODIEN2</name>
					<description>Peripheral Interrupt Enable Register 2</description>
					<addressOffset>0x034</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>TIEN2</name>
							<description>UART 2 Transmit Interrupt Enable</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>Transmit interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>Transmit interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RIEN2</name>
							<description>UART 2 Receive Interrupt Enable</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>Receive interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>Receive interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXINT2_EN</name>
							<description>External Interrupt 2 Enable</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>External interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>External interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TIEN1</name>
							<description>UART 1 Transmit Interrupt Enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>Transmit interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>Transmit interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RIEN1</name>
							<description>UART 1 Receive Interrupt Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>Receive interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>Receive interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>MODIEN3</name>
					<description>Peripheral Interrupt Enable Register 3</description>
					<addressOffset>0x038</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>IE0</name>
							<description>External Interrupt Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>MODIEN4</name>
					<description>Peripheral Interrupt Enable Register 4</description>
					<addressOffset>0x03C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>IE1</name>
							<description>External Interrupt Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
