cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
				<register>
					<name>MODPISEL</name>
					<description>Peripheral Input Select Register</description>
					<addressOffset>0x0B8</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>SSC12_S_MRST_OUTSEL</name>
							<description>Output selection for SSC12_S_MRST</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>SSC1</name>
									<description>SSC1_S_MRST</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SSC2</name>
									<description>SSC2_S_MRST</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SSC12_M_MTSR_OUTSEL</name>
							<description>Output selection for SSC12_M_MTSR</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>SSC1</name>
									<description>SSC1_M_MTSR</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SSC2</name>
									<description>SSC2_M_MTSR</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SSC12_M_SCK_OUTSEL</name>
							<description>Output selection for SSC12_M_SCK</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>SSC1</name>
									<description>SSC1_M_SCK</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SSC2</name>
									<description>SSC2_M_SCK</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>U_TX_CONDIS</name>
							<description>UART1 TxD Connection Disable</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Enable</name>
									<description>UART1-TX-Output -LIN Transmitter TX Input Connection available.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disable</name>
									<description>UART1-TX-Output -LIN Transmitter TX Input Connection not available (can be stimulated by external port pin).</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>URIOS1</name>
							<description>UART1 Input/Output Select</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Enable</name>
									<description>UART1 Receiver Input RXD1_0 (Connection to LIN is available).</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disable</name>
									<description>UART1 Receiver Input RXD1_1 (Connection to LIN is not available).</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXINT2IS</name>
							<description>External Interrupt 2 Input Select</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>EXINT2_0</name>
									<description>External Interrupt Input EXINT2_0 is selected.</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXINT2_1</name>
									<description>External Interrupt Input EXINT2_1 is selected.</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXINT2_2</name>
									<description>External Interrupt Input EXINT2_2 is selected.</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXINT2_3</name>
									<description>External Interrupt Input EXINT2_3 is selected.</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXINT1IS</name>
							<description>External Interrupt 1 Input Select</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>EXINT1_0</name>
									<description>External Interrupt Input EXINT1_0 is selected.</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXINT1_1</name>
									<description>External Interrupt Input EXINT1_1 is selected.</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXINT1_2</name>
									<description>External Interrupt Input EXINT1_2 is selected.</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXINT1_3</name>
									<description>External Interrupt Input EXINT1_3 is selected.</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXINT0IS</name>
							<description>External Interrupt 0 Input Select</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>EXINT0_0</name>
									<description>External Interrupt Input EXINT0_0 is selected.</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXINT0_1</name>
									<description>External Interrupt Input EXINT0_1 is selected.</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXINT0_2</name>
									<description>External Interrupt Input EXINT0_2 is selected.</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXINT0_3</name>
									<description>External Interrupt Input EXINT0_3 is selected.</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>MODPISEL1</name>
					<description>Peripheral Input Select Register 1</description>
					<addressOffset>0x0BC</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>T21EXCON</name>
							<description>Timer 21 External Input Control</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>MODPISEL</name>
									<description>Timer 21 Input T21EX is selected by bit field SCU_MODPISEL2.T21EXIS.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCU6</name>
									<description>Timer 21 Input T21EX is connected to signal from CCU6 (Output &gt;cc6_ch0).</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T2EXCON</name>
							<description>Timer 2 External Input Control</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>MODPISEL</name>
									<description>Timer 2 Input T2EX is selected by bit field SCU_MODPISEL2.T2EXIS.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCU</name>
									<description>Timer 2 Input T2EX is connected to signal from CCU6 (Output &gt;cc6_cout60).</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>MODPISEL2</name>
					<description>Peripheral Input Select Register 2</description>
					<addressOffset>0x0C0</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>T21EXISCNF</name>
							<description>Timer 21 External Input Select Configuration</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>T21EX_x</name>
									<description>Timer 21 Input T21EX_x is selected.</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MONx</name>
									<description>MONx Input is selected.</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T21EX_y</name>
									<description>Timer 21 Input T21EX_x is selected..</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MONy</name>
									<description>MONx Input is selected.</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T2EXISCNF</name>
							<description>Timer 2 External Input Select Configuration</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>T2EX_x</name>
									<description>Timer 2 Input T2EX_x is selected.</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MONx</name>
									<description>MONx Input is selected.</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T2EX_y</name>
									<description>Timer 2 Input T2EX_x is selected.</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MONy</name>
									<description>MONx Input is selected.</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T21EXIS</name>
							<description>Timer 21 External Input Select</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value0</name>
									<description>Timer 21 Input T21EX_0 or MON1 is selected.</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value1</name>
									<description>Timer 21 Input T21EX_1 or MON2 is selected.</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Timer 21 Input T21EX_2 or MON3 is selected.</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Timer 21 Input T21EX_3 or MON4 is selected.</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T2EXIS</name>
							<description>Timer 2 External Input Select</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value0</name>
									<description>Timer 2 Input T2EX_0 or MON1 is selected.</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value1</name>
									<description>Timer 2 Input T2EX_1 or MON2 is selected.</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Timer 2 Input T2EX_2 or MON3 is selected.</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Timer 2 Input T2EX_3 or MON4 is selected.</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T21IS</name>
							<description>Timer 21 Input Select</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>T21_0</name>
									<description>Timer 21 Input T21_0 is selected.</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T21_1</name>
									<description>Timer 21 Input T21_1 is selected.</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T21_2</name>
									<description>Timer 21 Input T21_2 is selected.</description>
									<value>0b10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T2IS</name>
							<description>Timer 2 Input Select</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>T2_0</name>
									<description>Timer 2 Input T2_0 is selected.</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T2_1</name>
									<description>Timer 2 Input T2_1 is selected.</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T2_2</name>
									<description>Timer 2 Input T2_2 is selected.</description>
									<value>0b10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>MODPISEL3</name>
					<description>Peripheral Input Select Register 3</description>
					<addressOffset>0x0C4</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>URIOS2</name>
							<description>UART2 Input/Output Select</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>RXTX_0</name>
									<description>UART2 Receiver Input RXD2_0 and Transmitter Output TXD2_0 is selected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RXTX_1</name>
									<description>UART2 Receiver Input RXD2_1 and Transmitter Output TXD2_1 is selected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>MODPISEL4</name>
					<description>Peripheral Input Select Register 4</description>
					<addressOffset>0x0FC</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>DU4TRIGGEN</name>
							<description>Differential Unit Trigger Enable</description>
							<lsb>24</lsb>
							<msb>26</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CC60</name>
									<description>CC60 is selected.</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC61</name>
									<description>CC61 is selected.</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC62</name>
									<description>CC62 is selected.</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUT60</name>
									<description>COUT60 is selected.</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUT61</name>
									<description>COUT61 is selected.</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUT62</name>
									<description>COUT62 is selected.</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T3OUT</name>
									<description>T3OUT is selected.</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUT63</name>
									<description>COUT63 is selected.</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DU3TRIGGEN</name>
							<description>Differential Unit Trigger Enable</description>
							<lsb>16</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CC60</name>
									<description>CC60 is selected.</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC61</name>
									<description>CC61 is selected.</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC62</name>
									<description>CC62 is selected.</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUT60</name>
									<description>COUT60 is selected.</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUT61</name>
									<description>COUT61 is selected.</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUT62</name>
									<description>COUT62 is selected.</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T3OUT</name>
									<description>T3OUT is selected.</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUT63</name>
									<description>COUT63 is selected.</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DU2TRIGGEN</name>
							<description>Differential Unit Trigger Enable</description>
							<lsb>8</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CC60</name>
									<description>CC60 is selected.</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC61</name>
									<description>CC61 is selected.</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC62</name>
									<description>CC62 is selected.</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUT60</name>
									<description>COUT60 is selected.</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUT61</name>
									<description>COUT61 is selected.</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUT62</name>
									<description>COUT62 is selected.</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T3OUT</name>
									<description>T3OUT is selected.</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUT63</name>
									<description>COUT63 is selected.</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DU1TRIGGEN</name>
							<description>Differential Unit Trigger Enable</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CC60</name>
									<description>CC60 is selected.</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC61</name>
									<description>CC61 is selected.</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC62</name>
									<description>CC62 is selected.</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUT60</name>
									<description>COUT60 is selected.</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUT61</name>
									<description>COUT61 is selected.</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUT62</name>
									<description>COUT62 is selected.</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T3OUT</name>
									<description>T3OUT is selected.</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>COUT63</name>
									<description>COUT63 is selected.</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
