cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
				<register>
					<name>MODSUSP</name>
					<description>Module Suspend Control Register</description>
					<addressOffset>0x0C8</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>ADC1_SUSP</name>
							<description>ADC1 Unit Debug Suspend Bit</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No suspend</name>
									<description>ADC1 will not be suspended.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Suspend</name>
									<description>ADC1 will be suspended.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MU_SUSP</name>
							<description>Measurement Unit Debug Suspend Bit</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Suspend</name>
									<description>MU will not be suspended.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Suspend</name>
									<description>MU will be suspended.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WDT1SUSP</name>
							<description>Watchdog Timer 1 Debug Suspend Bit</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Suspend</name>
									<description>WDT1 will not be suspended.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Suspend</name>
									<description>WDT1 will be suspended.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T21_SUSP</name>
							<description>Timer21 Debug Suspend Bit</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Suspend</name>
									<description>Timer21 will not be suspended.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Suspend</name>
									<description>Timer21 will be suspended.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPT12_SUSP</name>
							<description>GPT12 Debug Suspend Bit</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Suspend</name>
									<description>GPT12 will not be suspended.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Suspend</name>
									<description>GPT12 will be suspended.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T2_SUSP</name>
							<description>Timer2 Debug Suspend Bit</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Suspend</name>
									<description>Timer2 will not be suspended.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Suspend</name>
									<description>Timer2 will be suspended.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T13SUSP</name>
							<description>Timer 13 Debug Suspend Bit</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Suspend</name>
									<description>Timer 13 in Capture/Compare Unit will not be suspended.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Suspend</name>
									<description>Timer 13 in Capture/Compare Unit will be suspended.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T12SUSP</name>
							<description>Timer 12 Debug Suspend Bit</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Suspend</name>
									<description>Timer 12 in Capture/Compare Unit will not be suspended.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Suspend</name>
									<description>Timer 12 in Capture/Compare Unit will be suspended.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WDTSUSP</name>
							<description>SCU Watchdog Timer Debug Suspend Bit</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Suspend</name>
									<description>WDT will not be suspended.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Suspend</name>
									<description>WDT will be suspended.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>MONIEN</name>
					<description>Monitoring Input Interrupt Enable Register</description>
					<addressOffset>0x18C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>MON4IE</name>
							<description>MON 4 Interrupt Enable</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MON3IE</name>
							<description>MON 3 Interrupt Enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MON2IE</name>
							<description>MON 2 Interrupt Enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MON1IE</name>
							<description>MON 1 Interrupt Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>NMICON</name>
					<description>NMI Control Register</description>
					<addressOffset>0x024</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>NMISTOF</name>
							<description>Stack Overflow NMI Enable</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disable</name>
									<description>Stack overflow NMI is disabled.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<description>Stack overflow NMI is enabled.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NMISUP</name>
							<description>Supply Prewarning NMI Enable</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disable</name>
									<description>Supply NMI is disabled.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<description>Supply NMI is enabled.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NMIECC</name>
							<description>ECC Error NMI Enable</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disable</name>
									<description>ECC Error NMI is disabled.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<description>ECC Error NMI is enabled.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NMIMAP</name>
							<description>NVM Map Error NMI Enable</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disable</name>
									<description>NVM Map Error NMI is disabled.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<description>NVM Map Error NMI is enabled.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NMIOWD</name>
							<description>Oscillator Watchdog NMI Enable</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disable</name>
									<description>Oscillator watchdog NMI is disabled.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<description>Oscillator watchdog NMI is enabled.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NMIOT</name>
							<description>NMI OT Enable</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disable</name>
									<description>NMI OT is disabled.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<description>NMI OT is enabled.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NMIPLL</name>
							<description>PLL Loss of Lock NMI Enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disable</name>
									<description>PLL Loss of Lock NMI is disabled.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<description>PLL Loss of Lock NMI is enabled.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NMIWDT</name>
							<description>Watchdog Timer NMI Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disable</name>
									<description>WDT NMI is disabled.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<description>WDT NMI is enabled.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>NMISR</name>
					<description>NMI Status Register</description>
					<addressOffset>0x018</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>FNMISTOF</name>
							<description>Stack Overflow NMI Flag</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Int</name>
									<description>No supply prewarning NMI has occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Int</name>
									<description>Supply prewarning has occurred.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FNMISUP</name>
							<description>Supply Prewarning NMI Flag</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Int</name>
									<description>No supply prewarning NMI has occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Int</name>
									<description>Supply prewarning has occurred.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FNMIECC</name>
							<description>ECC Error NMI Flag</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Int</name>
									<description>No uncorrectable ECC error has occurred on NVM, XRAM.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Int</name>
									<description>Uncorrectable ECC error has occurred on NVM, RAM.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FNMIMAP</name>
							<description>NVM Map Error NMI Flag</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Int</name>
									<description>No NVM Map Error NMI has occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Int</name>
									<description>NVM Map Error has occurred.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FNMIOWD</name>
							<description>Oscillator Watchdog NMI Flag</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Int</name>
									<description>No oscillator watchdog NMI has occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Int</name>
									<description>Oscillator watchdog event has occurred.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FNMIOT</name>
							<description>Overtemperature NMI Flag</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Int</name>
									<description>No OT NMI has occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Int</name>
									<description>OT NMI event has occurred.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FNMIPLL</name>
							<description>PLL NMI Flag</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Int</name>
									<description>No PLL NMI has occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Int</name>
									<description>PLL loss-of-lock to the external crystal has occurred.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FNMIWDT</name>
							<description>Watchdog Timer NMI Flag</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no Int</name>
									<description>No watchdog NMI has occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Int</name>
									<description>WDT prewarning has occurred.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>NMISRCLR</name>
					<description>NMI Status Clear Register</description>
					<addressOffset>0x000</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>FNMIMAPC</name>
							<description>NVM Map Error NMI Flag</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Cleared</name>
									<description>Interrupt event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Cleared</name>
									<description>Interrupt event is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FNMIOWDC</name>
							<description>Oscillator Watchdog NMI Flag</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Cleared</name>
									<description>Interrupt event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Cleared</name>
									<description>Interrupt event is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FNMIPLLC</name>
							<description>PLL NMI Flag</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Cleared</name>
									<description>Interrupt event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Cleared</name>
									<description>Interrupt event is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FNMIWDTC</name>
							<description>Watchdog Timer NMI Flag</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Cleared</name>
									<description>Interrupt event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Cleared</name>
									<description>Interrupt event is cleared</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
