cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
				<register>
					<name>NVM_PROT_STS</name>
					<description>NVM Protection Status Register</description>
					<addressOffset>0x0E0</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>DAT_LIN_SIZE</name>
							<description>Data linear Region Size Definition</description>
							<lsb>26</lsb>
							<msb>27</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>0K</name>
									<description>data linear Size is 0K</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4K</name>
									<description>data linear Size is 4K</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8K</name>
									<description>data linear Size is 8K</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>12K</name>
									<description>data linear Size is 12K</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CUS_BSL_SIZE</name>
							<description>CBSL Region Size Definition</description>
							<lsb>24</lsb>
							<msb>25</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>0K</name>
									<description>CBSL Size is 0K</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4K</name>
									<description>CBSL Size is 4K</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8K</name>
									<description>CBSL Size is 8K</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16K</name>
									<description>CBSL Size is 16K</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DAT_NL_PW</name>
							<description>Status of Non-Linear Region Password / Protection</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Protected</name>
									<description>Non-Linear Region Password is not installed; Linear region is not protected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Protected</name>
									<description>Non-Linear Region Password is installed; Linear region is protected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DAT_LIN_PW</name>
							<description>Status of Data linear Region Password / Protection</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not protected</name>
									<description>Non-Linear Region Password is not installed; Linear region is not protected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Protected</name>
									<description>Non-Linear Region Password is installed; Linear region is protected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>COD_LIN_PW</name>
							<description>Status of Linear Region Password / Protection</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Protected</name>
									<description>Linear Region Password is not installed; Linear region is not protected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Protected</name>
									<description>Linear Region Password is installed; Linear region is protected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CUS_BSL_PW</name>
							<description>Status of CBSL Region Password / Protection</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Protected</name>
									<description>CBSL Region Password is not installed; CBSL region is not protected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Protected</name>
									<description>CBSL Region Password is installed; CBSL region is protected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DIS_RDUS_S0</name>
							<description>Configuration of NVM Read Protection for Sector 0 with EN_RD_S0 = 0</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Protected</name>
									<description>only active when nvm_read_S0_unsafe_i = 1 and not for nvm_read_S0_unsafe_i = 0</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Protected</name>
									<description>independent from nvm_read_S0_unsafe_i; Also write accesess to Sector 0 are prevented</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DIS_RDUS</name>
							<description>Configuration of NVM Read Protection for Sector 1...n with EN_RD_* = 0</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Protected</name>
									<description>only active when nvm_read_unsafe_i = 1 and not for nvm_read_unsafe_i = 0</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Protected</name>
									<description>independent from nvm_read_unsafe_i; Also write accesess to Sector 1...n are prevented</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EN_RD_S0</name>
							<description>NVM Read Protection for Sector 0</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Protected</name>
									<description>The data in sector 0 can not be read over AHB-Lite Interface</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Not Protected</name>
									<description>The data in sector 0 can be read over AHB-Lite Interface</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EN_PRG_DAT_NL</name>
							<description>NVM Protection of Data in Non-Linear Data Sectors</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Protected</name>
									<description>The data in sectors of the non-linearly mapped area can not be changed</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Not Protected</name>
									<description>The data in sectors of the non-linearly mapped area can be changed (erased or written)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EN_RD_DAT_NL</name>
							<description>NVM Read Protection of Data in Non-Linear Data Sectors</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Protected</name>
									<description>The data in sectors of the non-linearly mapped area can not be read</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Not Protected</name>
									<description>The data in sectors of the non-linearly mapped area can be read</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EN_PRG_DAT_LIN</name>
							<description>NVM Protection of Data in Linear Data Sectors</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Protected</name>
									<description>The data in sectors of the linearly mapped area can not be changed</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Not Protected</name>
									<description>The data in sectors of the linearly mapped area can be changed (erased or written)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EN_RD_DAT_LIN</name>
							<description>NVM Read Protection of Data in Linear Data Sectors</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Protected</name>
									<description>The data in sectors of the linearly mapped area can not be read</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Not Protected</name>
									<description>The data in sectors of the linearly mapped area can be read</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EN_PRG_COD_LIN</name>
							<description>NVM Protection of Data in Linear Code Sectors</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Protected</name>
									<description>The data in sectors of the linearly mapped area can not be changed</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Not Protected</name>
									<description>The data in sectors of the linearly mapped area can be changed (erased or written)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EN_RD_COD_LIN</name>
							<description>NVM Read Protection of Data in Linear Code Sectors</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Protected</name>
									<description>The data in sectors of the linearly mapped area can not be read</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Not Protected</name>
									<description>The data in sectors of the linearly mapped area can be read</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EN_PRG_CUS_BSL</name>
							<description>NVM Protection of Data in Customer BSL Region</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Protected</name>
									<description>The data in region defined by NVMBSL can not be changed</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Not Protected</name>
									<description>The data in region defined by NVMBSL can be changed (erased or written)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EN_RD_CUS_BSL</name>
							<description>NVM Read Protection of Data in Customer BSL Region</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Protected</name>
									<description>The data in region defined by NVMBSL can not be read</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Not Protected</name>
									<description>The data in region defined by NVMBSL sectors of can be read</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>OSC_CON</name>
					<description>OSC Control Register</description>
					<addressOffset>0x0B0</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>XPD</name>
							<description>XTAL (OSC_HP) Power Down Control</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Enabled</name>
									<description>XTAL (OSC_HP) is not powered down.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Power down</name>
									<description>XTAL (OSC_HP) is powered down.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OSC2L</name>
							<description>OSC-Too-Low Condition Flag</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>OSC OK</name>
									<description>fOSC is above threshold.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OSC too low</name>
									<description>fOSC is below threshold.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OSCWDTRST</name>
							<description>Oscillator Watchdog Reset</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Reset</name>
									<description>No effect.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset</name>
									<description>Reset OSC2L flag and restart the oscillator watchdog of the PLL.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OSCSS</name>
							<description>Oscillator Source Select</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>f_int_sync</name>
									<description>PLL internal oscillator OSC_PLL (fINT) is selected synchronously as fR.</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Xtal_sync</name>
									<description>XTAL (fOSC from OSC_HP) is selected synchronously as fR.</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>f_int_async</name>
									<description>PLL internal oscillator OSC_PLL (fINT) is selected asynchronously as fR.</description>
									<value>0b10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
