cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
				<register>
					<name>P0_POCON0</name>
					<description>Port Output Control Register</description>
					<addressOffset>0x0E8</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>P0_PDM6</name>
							<description>P0.6 Port Driver Mode</description>
							<lsb>24</lsb>
							<msb>26</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Strong-sharp</name>
									<description>Strong driver and sharp edge mode</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Strong-med</name>
									<description>Strong driver and medium edge mode</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Strong-soft</name>
									<description>Strong driver and soft edge mode</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Weak</name>
									<description>Weak driver</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Medium</name>
									<description>Medium driver</description>
									<value>0b100</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_PDM5</name>
							<description>P0.5 Port Driver Mode</description>
							<lsb>20</lsb>
							<msb>22</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Strong-sharp</name>
									<description>Strong driver and sharp edge mode</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Strong-med</name>
									<description>Strong driver and medium edge mode</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Strong-soft</name>
									<description>Strong driver and soft edge mode</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Weak</name>
									<description>Weak driver</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Medium</name>
									<description>Medium driver</description>
									<value>0b100</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_PDM4</name>
							<description>P0.4 Port Driver Mode</description>
							<lsb>16</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Strong-sharp</name>
									<description>Strong driver and sharp edge mode</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Strong-med</name>
									<description>Strong driver and medium edge mode</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Strong-soft</name>
									<description>Strong driver and soft edge mode</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Weak</name>
									<description>Weak driver</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Medium</name>
									<description>Medium driver</description>
									<value>0b100</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_PDM3</name>
							<description>P0.3 Port Driver Mode</description>
							<lsb>12</lsb>
							<msb>14</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Strong-sharp</name>
									<description>Strong driver and sharp edge mode</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Strong-med</name>
									<description>Strong driver and medium edge mode</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Strong-soft</name>
									<description>Strong driver and soft edge mode</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Weak</name>
									<description>Weak driver</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Medium</name>
									<description>Medium driver</description>
									<value>0b100</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_PDM2</name>
							<description>P0.2 Port Driver Mode</description>
							<lsb>8</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Strong-sharp</name>
									<description>Strong driver and sharp edge mode</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Strong-med</name>
									<description>Strong driver and medium edge mode</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Strong-soft</name>
									<description>Strong driver and soft edge mode</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Weak</name>
									<description>Weak driver</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Medium</name>
									<description>Medium driver</description>
									<value>0b100</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_PDM1</name>
							<description>P0.1 Port Driver Mode</description>
							<lsb>4</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Strong-sharp</name>
									<description>Strong driver and sharp edge mode</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Strong-med</name>
									<description>Strong driver and medium edge mode</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Strong-soft</name>
									<description>Strong driver and soft edge mode</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Weak</name>
									<description>Weak driver</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Medium</name>
									<description>Medium driver</description>
									<value>0b100</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P0_PDM0</name>
							<description>P0.0 Port Driver Mode</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Strong-sharp</name>
									<description>Strong driver and sharp edge mode</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Strong-med</name>
									<description>Strong driver and medium edge mode</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Strong-soft</name>
									<description>Strong driver and soft edge mode</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Weak</name>
									<description>Weak driver</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Medium</name>
									<description>Medium driver</description>
									<value>0b100</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>P1_POCON0</name>
					<description>Port Output Control Register</description>
					<addressOffset>0x0F8</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>P1_PDM4</name>
							<description>P1.4 Port Driver Mode</description>
							<lsb>16</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Strong-sharp</name>
									<description>Strong driver and sharp edge mode</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Strong-med</name>
									<description>Strong driver and medium edge mode</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Strong-soft</name>
									<description>Strong driver and soft edge mode</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Weak</name>
									<description>Weak driver</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Medium</name>
									<description>Medium driver</description>
									<value>0b100</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_PDM2</name>
							<description>P1.2 Port Driver Mode</description>
							<lsb>8</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Weak</name>
									<description>Weak driver</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Medium</name>
									<description>Medium driver</description>
									<value>0b100</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_PDM1</name>
							<description>P1.1 Port Driver Mode</description>
							<lsb>4</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Weak</name>
									<description>Weak driver</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Medium</name>
									<description>Medium driver</description>
									<value>0b100</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1_PDM0</name>
							<description>P1.0 Port Driver Mode</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Weak</name>
									<description>Weak driver</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Medium</name>
									<description>Medium driver</description>
									<value>0b100</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PASSWD</name>
					<description>Password Register</description>
					<addressOffset>0x0AC</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>PASS</name>
							<description>Password Bits</description>
							<lsb>3</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Enable</name>
									<description>Enables writing of the bit field MODE.</description>
									<value>0b11000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Open</name>
									<description>Opens access to writing of all protected bits.</description>
									<value>0b10011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Close</name>
									<description>Closes access to writing of all protected bits.</description>
									<value>0b10101</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PROTECT_S</name>
							<description>Bit-Protection Signal Status Bit</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not protected</name>
									<description>Software is able to write to all protected bits.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Protected</name>
									<description>Software is unable to write to any protected bits.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PW_MODE</name>
							<description>Bit-Protection Scheme Control Bit</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>Scheme Disabled</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>Scheme Enabled (default)</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PLL_CON</name>
					<description>PLL Control Register</description>
					<addressOffset>0x044</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>UNPROT_VCOBYP</name>
							<description>Unprotect write access of VCO_BYP</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>UNPROT_OSCDISC</name>
							<description>Unprotect write access of OSC_DISC</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>NDIV</name>
							<description>PLL N-Divider</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>0</name>
									<description>N = 39, ...</description>
									<value>00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>38</name>
									<description>N = 39</description>
									<value>38</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>39</name>
									<description>N = 39, ...</description>
									<value>39</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>80</name>
									<description>N = 80 (default), ...</description>
									<value>80</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>200</name>
									<description>N = 200</description>
									<value>200</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>201</name>
									<description>N = 200, ...</description>
									<value>201</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>255</name>
									<description>N = 200</description>
									<value>255</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCOBYP</name>
							<description>PLL VCO Bypass Mode Select</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Normal</name>
									<description>Normal (or freerunning) operation (default)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Prescaler</name>
									<description>Prescaler Mode; VCO is bypassed (PLL output clock is derived from input clock divided by K1-divider)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OSCDISC</name>
							<description>Oscillator Disconnect</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Connect</name>
									<description>Oscillator is connected to the PLL</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disconnect</name>
									<description>Oscillator is disconnected to the PLL.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESLD</name>
							<description>Restart Lock Detection</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No reset</name>
									<description>No effect.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>reset</name>
									<description>Reset lock flag and restart lock detection.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LOCK</name>
							<description>PLL Lock Status Flag</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Locked</name>
									<description>The frequency difference of fREF and fDIV is greater than allowed. The VCO part of the PLL can not lock on a target frequency.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Locked</name>
									<description>The frequency difference of fREF and fDIV is small enough to enable a stable VCO operation.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PMCON</name>
					<description>Peripheral Management Control Register</description>
					<addressOffset>0x060</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>T21_DIS</name>
							<description>T21 Disable Request. Active high.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Enable</name>
									<description>T21 is in normal operation. (default)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disable</name>
									<description>Request to disable the T21.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SSC2_DIS</name>
							<description>SSC Disable Request. Active high.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Enable</name>
									<description>SSC is in normal operation. (default)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disable</name>
									<description>Request to disable the SSC.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPT12_DIS</name>
							<description>General Purpose Timer 12 Disable Request. Active high.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Enable</name>
									<description>GPT12 is in normal operation. (default)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disable</name>
									<description>Request to disable the GPT12.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T2_DIS</name>
							<description>T2 Disable Request. Active high.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Enable</name>
									<description>T2 is in normal operation. (default)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disable</name>
									<description>Request to disable the T2.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CCU_DIS</name>
							<description>CCU Disable Request. Active high.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Enable</name>
									<description>CCU is in normal operation. (default)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disabel</name>
									<description>Request to disable the CCU.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SSC1_DIS</name>
							<description>SSC Disable Request. Active high.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Enable</name>
									<description>SSC is in normal operation. (default)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disable</name>
									<description>Request to disable the SSC.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADC1_DIS</name>
							<description>ADC1 Disable Request. Active high.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Enable</name>
									<description>ADC1 is in normal operation. (default)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disable</name>
									<description>Request to disable the ADC.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
