cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
				<register>
					<name>PMCON0</name>
					<description>Power Mode Control Register 0</description>
					<addressOffset>0x040</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>SD</name>
							<description>Slow Down Mode Enable. Active High.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PD</name>
							<description>Power Down Mode Enable. Active High.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SL</name>
							<description>Sleep Mode Enable. Active High.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>XTAL_ON</name>
							<description>OSC_HP Operation in Power Down Mode</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>PD</name>
									<description>OSC_HP (XTAL) will be put to Power Down mode by hardware in power save mode.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ON</name>
									<description>OSC_HP (XTAL) continues to operate in Power Down mode, if enabled by SCU_OSC_CON.XPD.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>RSTCON</name>
					<description>Reset Control Register</description>
					<addressOffset>0x068</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>LOCKUP_EN</name>
							<description>Lockup Reset Enable Flag</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disable</name>
									<description>Lockup is disabled.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<description>Lockup is enabled.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LOCKUP</name>
							<description>Lockup Flag</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disable</name>
									<description>Lockup Status not active.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<description>Lockup Status active.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>STACK_OVF_ADDR</name>
					<description>Stack Overflow Control Register</description>
					<addressOffset>0x148</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>STOF_ADDR_OFF_H</name>
							<description>Stack Overflow High Address Offset</description>
							<lsb>18</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>STOF_ADDR_OFF_L</name>
							<description>Stack Overflow Low Address Offset</description>
							<lsb>2</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STACK_OVF_CTRL</name>
					<description>Stack Overflow Control Register</description>
					<addressOffset>0x144</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>STOF_EN</name>
							<description>Stack Overflow Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>stack overflow detection disabled.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>stack overflow detection enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>STACK_OVF_STS</name>
					<description>Stack Overflow Status Register</description>
					<addressOffset>0x14C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>STOF_STS</name>
							<description>Stack Overflow Status</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Error</name>
									<description>No stack overflow detected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Error</name>
									<description>stack overflow detected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>STACK_OVFCLR</name>
					<description>Stack Overflow Status Clear Register</description>
					<addressOffset>0x12C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>STOF_STSC</name>
							<description>Clear Stack Overflow Status</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Not Cleared</name>
									<description>stack overflow not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Cleared</name>
									<description>stack overflow cleared.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SYS_STRTUP_STS</name>
					<description>System Startup Status Register</description>
					<addressOffset>0x074</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>PG100TP_CHKS_ERR</name>
							<description>100 TP Page Checksum Error</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>OK</name>
									<description>initialisation of trimming parameters from NVM was successfull (checksum was correct)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Not OK</name>
									<description>initialisation of trimming parameter from NVM was not successfull (checksum was not correct). As a backup default values form Boot-ROM are used</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MRAMINITSTS</name>
							<description>Map RAM Initialisation Status</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Fail</name>
									<description>Map RAM initialisation was successfull</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Fail</name>
									<description>Map RAM initialisation was not successfull</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PLL_LOCK_STS</name>
							<description>PLL LOCK STATUS</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Fail</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Fail</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SYSCON0</name>
					<description>System Control Register 0</description>
					<addressOffset>0x070</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>SYSCLKSEL</name>
							<description>System Clock Select</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>f_pll</name>
									<description>The PLL clock output signal fPLL is used</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>f_osc</name>
									<description>The direct clock input from fOSC is used</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>f_lpclk</name>
									<description>The direct low-precision clock input from fLP_CLK is used.</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>f_int</name>
									<description>The direct input from internal oscillator fINTOSC is used</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NVMCLKFAC</name>
							<description>NVM Access Clock Factor</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>div 1</name>
									<description>Divide by 1</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 2</name>
									<description>Divide by 2</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 3</name>
									<description>Divide by 3</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div 4</name>
									<description>Divide by 4</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>TCCR</name>
					<description>Temperature Compensation Control Register</description>
					<addressOffset>0x0F4</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>TCC</name>
							<description>Temperature Compensation Control</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>T1</name>
									<description>TJ: -40 degree C to 0 degree C</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T2</name>
									<description>TJ: 0 degree C to 40 degree C</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T3</name>
									<description>TJ: 40 degree C to 80 degree C</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>T4</name>
									<description>TJ: 80 degree C to 150 degree C</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>VTOR</name>
					<description>Vector Table Reallocation Register</description>
					<addressOffset>0x020</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>VTOR_BYP</name>
							<description>Vector Table Bypass Mode</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ROM</name>
									<description>VTOR is not remapped (ROM)</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RAM</name>
									<description>VTOR is remapped to RAM</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NVM_BSL</name>
									<description>VTOR is remapped to NVM</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NVM_LIN</name>
									<description>VTOR is remapped to NVM</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>WAKECON</name>
					<description>Wakeup Interrupt Control Register</description>
					<addressOffset>0x0EC</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>WAKEUPEN</name>
							<description>Wakeup Interrupt Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disable</name>
									<description>wakeup interrupt is disabled.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<description>wakeup interrupt is enabled.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>WDT</name>
					<description>Watchdog Timer</description>
					<addressOffset>0x080</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>WDT</name>
							<description>Watchdog Timer Current Value</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>WDTCON</name>
					<description>Watchdog Timer Control Register</description>
					<addressOffset>0x050</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>WINBEN</name>
							<description>Watchdog Window-Boundary Enable</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>Watchdog Window-Boundary feature is disabled. (default)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>Watchdog Window-Boundary feature is enabled.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WDTPR</name>
							<description>Watchdog Prewarning Mode Flag</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Normal</name>
									<description>Normal mode (default after reset)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Prewarn</name>
									<description>The Watchdog is operating in Prewarning Mode</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WDTEN</name>
							<description>WDT Enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>WDT is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>WDT is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WDTRS</name>
							<description>WDT Refresh Start</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>WDTIN</name>
							<description>Watchdog Timer Input Frequency Selection</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIV 2</name>
									<description>Input frequency is fPCLK/2</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV 128</name>
									<description>Input frequency is fPCLK/128</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>WDTREL</name>
					<description>Watchdog Timer Reload Register</description>
					<addressOffset>0x078</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>WDTREL</name>
							<description>Watchdog Timer Reload Value</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>WDTWINB</name>
					<description>Watchdog Window-Boundary Count</description>
					<addressOffset>0x07C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>WDTWINB</name>
							<description>Watchdog Window-Boundary Count Value</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>XTAL_CTRL</name>
					<description>Peripheral Input Select Register</description>
					<addressOffset>0x100</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>XTALHYSCTRL</name>
							<description>XTAL Hysteresis Control</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>XHYST_0</name>
									<description>400mV nom.</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>XHYST_1</name>
									<description>300mV nom.</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>XHYST_2</name>
									<description>200mV nom.</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>XHYST_3</name>
									<description>100mV nom.</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>XTALHYSEN</name>
							<description>XTAL Hysteresis Enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>Hysteresis is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>Hysteresis is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>XTAL12EN</name>
							<description>Pins XTAL1/2 Enable Bit</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>Pins XTAL1/2 is not available. This setting overrides the .XPD setting.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>Pins XTAL1/2 are available</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
