cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>SCUPM</name>
			<description>SCUPM</description>
			<baseAddress>0x50006000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>AMCLK_CTRL</name>
					<description>Analog Module Clock Control Register</description>
					<addressOffset>0x04</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>CLKWDT_PD_N</name>
							<description>Clock Watchdog Powerdown</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Clock Watchdog disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Clock Watchdog enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>AMCLK_FREQ_STS</name>
					<description>Analog Module Clock Frequency Status Register</description>
					<addressOffset>0x00</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>AMCLK2_FREQ</name>
							<description>Current frequency of Analog Module Clock 2 (TFILT_CLK)</description>
							<lsb>8</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AMCLK1_FREQ</name>
							<description>Current frequency of Analog Module Clock System Clock (MI_CLK)</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>AMCLK_TH_HYS</name>
					<description>Analog Module Clock Limit Register</description>
					<addressOffset>0x0C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>AMCLK2_LOW_HYS</name>
							<description>Analog Module Clock 2 (TFILT_CLK) Lower Hysteresis</description>
							<lsb>30</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AMCLK2_LOW_TH</name>
							<description>Analog Module Clock 2 (TFILT_CLK) Lower Limit Threshold</description>
							<lsb>24</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AMCLK2_UP_HYS</name>
							<description>Analog Module Clock 2 (TFILT_CLK) Upper Hysteresis</description>
							<lsb>22</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AMCLK2_UP_TH</name>
							<description>Analog Module Clock 2 (TFILT_CLK) Upper Limit Threshold</description>
							<lsb>16</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AMCLK1_LOW_HYS</name>
							<description>Analog Module Clock 1 (MI_CLK) Lower Hysteresis</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AMCLK1_LOW_TH</name>
							<description>Analog Module Clock 1 (MI_CLK) Lower Limit Threshold</description>
							<lsb>8</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AMCLK1_UP_HYS</name>
							<description>Analog Module Clock 1 (MI_CLK) Upper Hysteresis</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AMCLK1_UP_TH</name>
							<description>Analog Module Clock 1 (MI_CLK) Upper Limit Threshold</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PCU_CTRL_STS</name>
					<description>Power Control Unit Control Status Register</description>
					<addressOffset>0x30</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>CLKLOSS_RES_SD_DIS</name>
							<description>Loss of Clock Reset Disable</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Enable</name>
									<description>Loss of Clock Reset Enable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disable</name>
									<description>Loss of Clock Reset Disable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLKWDT_RES_SD_DIS</name>
							<description>Clock Watchdog Reset Disable</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Enable</name>
									<description>Clock Watchdog Reset Enable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disable</name>
									<description>Clock Watchdog Reset Disable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLKLOSS_SD_DIS</name>
							<description>System Loss of Clock Shutdown Disable (AMCLK3)</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Enable</name>
									<description>Automatic Shutdown Signal for Power Switches in case of loss of clock</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disable</name>
									<description>Automatic Shutdown Signal for Power Switches in case of loss of clock</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYS_OTWARN_PS_DIS</name>
							<description>System Overtemperature Warning Power Switches Shutdown Disable</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Enable</name>
									<description>Automatic Shutdown Signal for Power Switches in case of system overtemperature warning enable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disable</name>
									<description>Automatic Shutdown Signal for Power Switches in case of system overtemperature warning enable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYS_VS_OV_SLM_DIS</name>
							<description>VS Overvoltage Shutdown for Peripherals Disable</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Enable</name>
									<description>Automatic Shutdown for Power modules in case of VS Overvoltage enabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disable</name>
									<description>Automatic Shutdown for Power modules in case of VS Overvoltage disabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYS_VS_UV_SLM_DIS</name>
							<description>VS Undervoltage Shutdown for Peripherals Disable</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Enable</name>
									<description>Automatic Shutdown for Power modules in case of VS Undervoltage enabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disable</name>
									<description>Automatic Shutdown for Power modules in case of VS Undervoltage disabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LIN_VS_UV_SD_DIS</name>
							<description>LIN Module VS Undervoltage Transmitter Shutdown</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Enable</name>
									<description>Automatic Shutdown for Power modules in case of VS Undervoltage enabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Disable</name>
									<description>Automatic Shutdown for Power modules in case of VS Undervoltage disabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FAIL_PS_DIS</name>
							<description>Disable LIN Tx and HS and because of Overtemperature Warning or VS OV/UV</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Switch off Enabled</name>
									<description>LIN Tx andHS will be turned off when Overtemperature Warning occurs</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Switch off Disabled</name>
									<description>LIN Tx andHS will be kept on when Overtemperature Warning occurs</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLKWDT_SD_DIS</name>
							<description>Power Modules Clock Watchdog Shutdown Disable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Shutdown Enable</name>
									<description>Power Devices will be switched off when Clock Watchdog.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Shutdown Disable</name>
									<description>Power Devices will not be shutdown when Clock Watchdog occurs</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>STCALIB</name>
					<description>System Tick Calibration Register</description>
					<addressOffset>0x6C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>STCALIB</name>
							<description>System Tick Calibration</description>
							<lsb>0</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SYS_IRQ_CTRL</name>
					<description>System Interrupt Control Register</description>
					<addressOffset>0x28</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>VREF1V2_OV_IE</name>
							<description>8 Bit ADC2 Reference Overvoltage Interrupt Enable</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Interrupt is disabled</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Interrupt is enabled</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VREF1V2_UV_IE</name>
							<description>8 Bit ADC2 Reference Undervoltage Interrupt Enable</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Interrupt is disabled</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Interrupt is enabled</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYS_OT_IE</name>
							<description>System Overtemperature Shutdown Interrupt Enable</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Interrupt is disabled</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Interrupt is enabled</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYS_OTWARN_IE</name>
							<description>System Overtemperature Prewarning Interrupt Enable</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Interrupt is disabled</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Interrupt is enabled</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
