cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
				<register>
					<name>SYS_IS</name>
					<description>System Interrupt Status Register</description>
					<addressOffset>0x18</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>SYS_SUPPLY_STS</name>
							<description>System Supply Status</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>OK</name>
									<description>no status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FAIL</name>
									<description>at least one status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VREF1V2_OV_STS</name>
							<description>8 Bit ADC2 Reference Overvoltage (ADC2, Channel 5) interrupt status</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>OK</name>
									<description>no interrupt status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FAIL</name>
									<description>at least one interrupt status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VREF1V2_UV_STS</name>
							<description>8 Bit ADC2 Reference Undervoltage (ADC2, Channel 5) interrstatus</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>OK</name>
									<description>no interrupt status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FAIL</name>
									<description>at least one interrupt status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYS_OT_STS</name>
							<description>System Overtemperature Shutdown (ADC2, Channel 6) status</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>OK</name>
									<description>no status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FAIL</name>
									<description>at least one status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYS_OTWARN_STS</name>
							<description>System Overtemperature Prewarning (ADC2, Channel 6) status</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>OK</name>
									<description>no status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FAIL</name>
									<description>at least one status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS_FAIL_STS</name>
							<description>High Side Driver Fail Status</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>OK</name>
									<description>no status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FAIL</name>
									<description>at least one status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRV_FAIL_STS</name>
							<description>Gate Driver Fail Status</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>OK</name>
									<description>no status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FAIL</name>
									<description>at least one status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CP_FAIL_STS</name>
							<description>Charge Pump Fail Status</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>OK</name>
									<description>no status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FAIL</name>
									<description>at least one status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LIN_FAIL_STS</name>
							<description>LIN Fail Status</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>OK</name>
									<description>no status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FAIL</name>
									<description>at least one status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYS_SUPPLY_IS</name>
							<description>System Supply Interrupt Status</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>OK</name>
									<description>no interrupt status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FAIL</name>
									<description>at least one interrupt status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VREF1V2_OV_IS</name>
							<description>8 Bit ADC2 Reference Overvoltage (ADC2, Channel 5) interrupt status</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>OK</name>
									<description>no interrupt status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FAIL</name>
									<description>at least one interrupt status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VREF1V2_UV_IS</name>
							<description>8 Bit ADC2 Reference Undervoltage (ADC2, Channel 5) interrupt status</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>OK</name>
									<description>no interrupt status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FAIL</name>
									<description>at least one interrupt status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLKWDT_IS</name>
							<description>Clock Watchdog Interrupt Status</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>OK</name>
									<description>no interrupt status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FAIL</name>
									<description>at least one interrupt status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYS_OT_IS</name>
							<description>System Overtemperature Shutdown (ADC2, Channel 8) interrupt status</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>OK</name>
									<description>no interrupt status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FAIL</name>
									<description>at least one interrupt status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYS_OTWARN_IS</name>
							<description>System Overtemperature Prewarning (ADC2, Channel 8) interrupt status</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>OK</name>
									<description>no interrupt status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FAIL</name>
									<description>at least one interrupt status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS_FAIL_IS</name>
							<description>High Side Driver Fail Interrupt Status</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>OK</name>
									<description>no status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FAIL</name>
									<description>at least one status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRV_FAIL_IS</name>
							<description>Gate Driver Fail Interrupt Status</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>OK</name>
									<description>no status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FAIL</name>
									<description>at least one status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CP_FAIL_IS</name>
							<description>Charge Pump Fail Interrupt Status</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>OK</name>
									<description>no status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FAIL</name>
									<description>at least one status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LIN_FAIL_IS</name>
							<description>LIN Fail Interrupt Status</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>OK</name>
									<description>no status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FAIL</name>
									<description>at least one status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SYS_ISCLR</name>
					<description>System Interrupt Status Clear Register</description>
					<addressOffset>0x14</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>VREF1V2_OV_SC</name>
							<description>8 Bit ADC2 Reference Overvoltage Status Clear</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VREF1V2_UV_SC</name>
							<description>8 Bit ADC2 Reference Undervoltage Status Clear</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYS_OT_SC</name>
							<description>System Overtemperature Shutdown Status Clear</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYS_OTWARN_SC</name>
							<description>System Overtemperature Prewarning Status Clear</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VREF1V2_OV_ISC</name>
							<description>8 Bit ADC2 Reference Overvoltage Interrupt Status Clear</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VREF1V2_UV_ISC</name>
							<description>8 Bit ADC2 Reference Undervoltage Interrupt Status Clear</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYS_OT_ISC</name>
							<description>System Overtemperature Shutdown Interrupt Status Clear</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYS_OTWARN_ISC</name>
							<description>System Overtemperature Prewarning Interrupt Status Clear</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
