cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
				<register>
					<name>SYS_SUPPLY_IRQ_CLR</name>
					<description>System Supply Interrupt Status Clear Register</description>
					<addressOffset>0x24</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>VDD1V5_OV_SC</name>
							<description>VDDC Overvoltage Status clear</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDD5V_OV_SC</name>
							<description>VDDP Overvoltage Status clear</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDDEXT_OV_SC</name>
							<description>VDDEXT Overvoltage Status clear</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VS_OV_SC</name>
							<description>VS Overvoltage Status clear</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDD1V5_UV_SC</name>
							<description>VDDC Undervoltage Status clear</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDD5V_UV_SC</name>
							<description>VDDP Undervoltage Status clear</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDDEXT_UV_SC</name>
							<description>VDDEXT Undervoltage Status clear</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VS_UV_SC</name>
							<description>VS Undervoltage Status clear</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDD1V5_OV_ISC</name>
							<description>VDDC Overvoltage Interrupt Status clear</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDD5V_OV_ISC</name>
							<description>VDDP Overvoltage Interrupt Status clear</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDDEXT_OV_ISC</name>
							<description>VDDEXT Overvoltage Interrupt Status clear</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VS_OV_ISC</name>
							<description>VS Overvoltage Interrupt Status clear</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDD1V5_UV_ISC</name>
							<description>VDDC Undervoltage Interrupt Status clear</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDD5V_UV_ISC</name>
							<description>VDDP Undervoltage Interrupt Status clear</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDDEXT_UV_ISC</name>
							<description>VDDEXT Undervoltage Interrupt Status clear</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VS_UV_ISC</name>
							<description>VS Undervoltage Interrupt Status clear</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Clear</name>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SYS_SUPPLY_IRQ_CTRL</name>
					<description>System Supply Interrupt Control Register</description>
					<addressOffset>0x20</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>VDD1V5_OV_IE</name>
							<description>VDDC Overvoltage Interrupt Enable</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDD5V_OV_IE</name>
							<description>VDDP Overvoltage Interrupt Enable</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDDEXT_OV_IE</name>
							<description>VDDEXT Overvoltage Interrupt Enable</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VS_OV_IE</name>
							<description>VS Overvoltage Interrupt Enable</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDD1V5_UV_IE</name>
							<description>VDDC Undervoltage Interrupt Enable</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDD5V_UV_IE</name>
							<description>VDDP Undervoltage Interrupt Enable</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDDEXT_UV_IE</name>
							<description>VDDEXT Undervoltage Interrupt Enable</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VS_UV_IE</name>
							<description>VS Undervoltage Interrupt Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SYS_SUPPLY_IRQ_STS</name>
					<description>System Supply Interrupt Status Register</description>
					<addressOffset>0x1C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>VDD1V5_OV_STS</name>
							<description>VDDC Overvoltage Status (ADC2 channel 6)</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Overvoltage</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overvoltage</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDD5V_OV_STS</name>
							<description>VDDP Overvoltage Status (ADC2 channel 4)</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Overvoltage</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overvoltage</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDDEXT_OV_STS</name>
							<description>VDDEXT Overvoltage Status (ADC2 channel 3)</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Overvoltage</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overvoltage</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VS_OV_STS</name>
							<description>VS Overvoltage Status (ADC2 channel 0)</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Overvoltage</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overvoltage</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDD1V5_UV_STS</name>
							<description>VDDC Undervoltage Status (ADC2 channel 6)</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Undervoltage</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Undervoltage</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDD5V_UV_STS</name>
							<description>VDDP Undervoltage Status (ADC2 channel 4)</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Undervoltage</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Undervoltage</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDDEXT_UV_STS</name>
							<description>VDDEXT Undervoltage Status (ADC2 channel 3)</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Undervoltage</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Undervoltage</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VS_UV_STS</name>
							<description>VS Undervoltage Status (ADC2 channel 0)</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Undervoltage</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Undervoltage</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDD1V5_OV_IS</name>
							<description>VDDC Overvoltage Interrupt Status (ADC2 channel 6)</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Overvoltage Interrupt</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overvoltage Interrupt</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDD5V_OV_IS</name>
							<description>VDDP Overvoltage Interrupt Status (ADC2 channel 4)</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Overvoltage Interrupt</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overvoltage Interrupt</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDDEXT_OV_IS</name>
							<description>VDDEXT Overvoltage Interrupt Status (ADC2 channel 3)</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Overvoltage Interrupt</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overvoltage Interrupt</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VS_OV_IS</name>
							<description>VS Overvoltage Interrupt Status (ADC2 channel 0)</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Overvoltage Interrupt</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overvoltage Interrupt</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDD1V5_UV_IS</name>
							<description>VDDC Undervoltage Interrupt Status (ADC2 channel 6)</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Undervoltage Interrupt</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Undervoltage Interrupt</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDD5V_UV_IS</name>
							<description>VDDP Undervoltage Interrupt Status (ADC2 channel 4)</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Undervoltage Interrupt</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Undervoltage Interrupt</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDDEXT_UV_IS</name>
							<description>VDDEXT Undervoltage Interrupt Status (ADC2 channel 3)</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Undervoltage Interrupt</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Undervoltage Interrupt</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VS_UV_IS</name>
							<description>VS Undervoltage Interrupt Status (ADC2 channel 0)</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Undervoltage Interrupt</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Undervoltage Interrupt</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
