cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
				<register>
					<name>WDT1_TRIG</name>
					<description>WDT1 Watchdog Control Register</description>
					<addressOffset>0x34</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>SOWCONF</name>
							<description>Short Open Window Configuration</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<description>Short Open Windows disabled</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SOW1</name>
									<description>one successive Short Open Window allowed</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SOW2</name>
									<description>two successive Short Open Windows allowed</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SOW3</name>
									<description>three successive Short Open Windows allowed</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WDP_SEL</name>
							<description>Watchdog Period Selection and trigger</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>SOW_TRIG</name>
									<description>trigger short open window</description>
									<value>0x00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WP_1</name>
									<description>Watchdog period 16 ms</description>
									<value>0x01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WP_2</name>
									<description>Watchdog period 32 ms</description>
									<value>0x02</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WP_3</name>
									<description>Watchdog period 48 ms, ...</description>
									<value>0x03</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WP_63</name>
									<description>Watchdog period 1008 ms</description>
									<value>0x3F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>SSC1</name>
			<description>SSC1</description>
			<baseAddress>0x48024000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x2000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>INTISR8</name>
				<description>Interrupt node 8: SSC1</description>
				<value>8</value>
			</interrupt>
			<registers>
				<register>
					<name>BR</name>
					<description>Baud Rate Timer Reload Register</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>BR_VALUE</name>
							<description>Baud Rate Timer/Reload Register Value</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CON</name>
					<description>Control Register</description>
					<addressOffset>0x04</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>BSY</name>
							<description>Busy Flag</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>BE</name>
							<description>Baud Rate Error Flag</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NO</name>
									<description>error.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ERROR</name>
									<description>More than factor 2 or 0.5 between slave's actual and expected baud rate.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PE</name>
							<description>Phase Error Flag</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NO</name>
									<description>error.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ERROR</name>
									<description>Received data changes around sampling clock edge.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RE</name>
							<description>Receive Error Flag</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NO</name>
									<description>error.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ERROR</name>
									<description>Reception completed before the receive buffer was read.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TE</name>
							<description>Transmit Error Flag</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NO</name>
									<description>error.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ERROR</name>
									<description>Transfer starts with the slave's transmit buffer not being updated.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BC</name>
							<description>Bit Count Field</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EN</name>
							<description>Enable Bit</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Programming Mode</name>
									<description>Transmission and reception disabled. Access to control bits.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Operating Mode</name>
									<description>Transmission and reception enabled. Access to status flags and M/S control.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MS</name>
							<description>Master Select</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>SLAVE</name>
									<description>Mode. Operate on shift clock received via SCLK.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MASTER</name>
									<description>Mode. Generate shift clock and output it via SCLK.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>AREN</name>
							<description>Automatic Reset Enable</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>N/A</name>
									<description>No additional action upon a baud rate error.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESET</name>
									<description>The SSC is automatically reset upon a baud rate error.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BEN</name>
							<description>Baud Rate Error Enable</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>IGNORE</name>
									<description>baud rate errors.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CHECK</name>
									<description>baud rate errors.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PEN</name>
							<description>Phase Error Enable</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>IGNORE</name>
									<description>phase errors.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CHECK</name>
									<description>phase errors.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>REN</name>
							<description>Receive Error Enable</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>IGNORE</name>
									<description>receive errors.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CHECK</name>
									<description>receive errors.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TEN</name>
							<description>Transmit Error Enable</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>IGNORE</name>
									<description>transmit errors.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CHECK</name>
									<description>transmit errors.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LB</name>
							<description>Loop Back Control</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>output.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LB</name>
									<description>Receive input is connected with transmit output (half-duplex mode).</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PO</name>
							<description>Clock Polarity Control</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>Idle clock line is low, leading clock edge is low-to-high transition.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>Idle clock line is high, leading clock edge is high-to-low transition.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PH</name>
							<description>Clock Phase Control</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>SHIFT</name>
									<description>transmit data on the leading clock edge, latch on trailing edge.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LATCH</name>
									<description>receive data on leading clock edge, shift on trailing edge.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HB</name>
							<description>Heading Control</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>LSB</name>
									<description>Transmit/Receive LSB First.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MSB</name>
									<description>Transmit/Receive MSB First.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BM</name>
							<description>Data Width Selection</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>2</name>
									<description>Transfer Data Width is 2 (BM+1).</description>
									<value>0b0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16</name>
									<description>Transfer Data Width is 16 bits (BM+1).</description>
									<value>0b1111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ISRCLR</name>
					<description>Interrupt Status Register Clear</description>
					<addressOffset>0x14</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>BECLR</name>
							<description>Baud Rate Error Flag Clear</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NO</name>
									<description>No error clear.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR</name>
									<description>Error clear.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PECLR</name>
							<description>Phase Error Flag Clear</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NO</name>
									<description>No error clear.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR</name>
									<description>Error clear.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RECLR</name>
							<description>Receive Error Flag Clear</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NO</name>
									<description>No error clear.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR</name>
									<description>Error clear.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TECLR</name>
							<description>Transmit Error Flag Clear</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NO</name>
									<description>No error clear.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR</name>
									<description>Error clear.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PISEL</name>
					<description>Port Input Select Register</description>
					<addressOffset>0x00</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>GIS</name>
							<description>Global SSC12 Input Select</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Inputs SSC12_S_SCK_0, SSC12_S_MTSR_0, and SSC12_M_MRST_0 are selected if CIS, SIS or MIS_O is 1.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Inputs SSC12_S_SCK_1, SSC12_S_MTSR_1, and SSC12_M_MRST_1 are selected if CIS, SIS or MIS_O is 1. See</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MIS_1</name>
							<description>Master Mode Input Select Bit 1 (Master Mode only)</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Default, Inputs selected according to MIS_0.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Do not use, Connects to unused pins.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CIS</name>
							<description>Clock Input Select (Slave Mode only)</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>SSCx_S_SCK</name>
									<description>(x = 1 or 2, dependant form current SSC), see .</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SSC12_S_SCK_x</name>
									<description>(x=0 or 1). See .</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SIS</name>
							<description>Slave Mode Input Select (Slave Mode only)</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>SSCx_S_MTSR</name>
									<description>(x = 1 or 2, dependant form current SSC), see .</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SSC12_S_MTSR_x</name>
									<description>(x=0 or 1). See .</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MIS_0</name>
							<description>Master Mode Input Select Bit 0 (Master Mode only)</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>SSCx_M_MRST</name>
									<description>(x = 1 or 2, dependant form current SSC), see .</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SSC12_M_MRST_x</name>
									<description>(x=0 or 1). See .</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>RB</name>
					<description>Receiver Buffer Register</description>
					<addressOffset>0x0C</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>RB_VALUE</name>
							<description>Receive Data Register Value</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TB</name>
					<description>Transmitter Buffer Register</description>
					<addressOffset>0x08</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>TB_VALUE</name>
							<description>Transmit Data Register Value</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
