cmsis-svd/cmsis-svd/data/Infineon/TLE985x.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>UART1</name>
			<description>UART1</description>
			<baseAddress>0x48020000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x2000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>INTISR10</name>
				<description>Interrupt node 10: UART1(ASC,LIN), Timer2</description>
				<value>10</value>
			</interrupt>
			<registers>
				<register>
					<name>SBUF</name>
					<description>Serial Data Buffer</description>
					<addressOffset>0x04</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>VAL</name>
							<description>Serial Interface Buffer Register</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SCON</name>
					<description>Serial Channel Control Register</description>
					<addressOffset>0x00</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>SM0</name>
							<description>Serial Port Operating Mode Selection</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SM1</name>
							<description>Serial Port Operating Mode Selection</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SM2</name>
							<description>Enable Serial Port Multiprocessor Communication in Modes 2 and 3</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>REN</name>
							<description>Enable Receiver of Serial Port</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>Serial reception is disabled.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>Serial reception is enabled.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TB8</name>
							<description>Serial Port Transmitter Bit 9</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RB8</name>
							<description>Serial Port Receiver Bit 9</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TI</name>
							<description>Transmit Interrupt Flag</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RI</name>
							<description>Receive Interrupt Flag</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SCONCLR</name>
					<description>Serial Channel Control Clear Register</description>
					<addressOffset>0x08</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>RB8CLR</name>
							<description>SCON.RB8 Clear Flag</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Clear</name>
									<description>RB8 Flag is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<description>RB8 Flag is cleared.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TICLR</name>
							<description>SCON.TI Clear Flag</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Clear</name>
									<description>TI Flag is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<description>TI Flag is cleared.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RICLR</name>
							<description>SCON.RI Clear Flag</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Clear</name>
									<description>RI Flag is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<description>RI Flag is cleared.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>UART2</name>
			<description>UART2</description>
			<baseAddress>0x48022000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x2000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>INTISR11</name>
				<description>Interrupt node 11: UART2, Timer21</description>
				<value>11</value>
			</interrupt>
			<registers>
				<register>
					<name>SBUF</name>
					<description>Serial Data Buffer</description>
					<addressOffset>0x04</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>VAL</name>
							<description>Serial Interface Buffer Register</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SCON</name>
					<description>Serial Channel Control Register</description>
					<addressOffset>0x00</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>SM0</name>
							<description>Serial Port Operating Mode Selection</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SM1</name>
							<description>Serial Port Operating Mode Selection</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SM2</name>
							<description>Enable Serial Port Multiprocessor Communication in Modes 2 and 3</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>REN</name>
							<description>Enable Receiver of Serial Port</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>Serial reception is disabled.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>Serial reception is enabled.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TB8</name>
							<description>Serial Port Transmitter Bit 9</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RB8</name>
							<description>Serial Port Receiver Bit 9</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TI</name>
							<description>Transmit Interrupt Flag</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RI</name>
							<description>Receive Interrupt Flag</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SCONCLR</name>
					<description>Serial Channel Control Clear Register</description>
					<addressOffset>0x08</addressOffset>
					<size>32</size>
					<fields>
						<field>
							<name>RB8CLR</name>
							<description>SCON.RB8 Clear Flag</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Clear</name>
									<description>RB8 Flag is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<description>RB8 Flag is cleared.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TICLR</name>
							<description>SCON.TI Clear Flag</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Clear</name>
									<description>TI Flag is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<description>TI Flag is cleared.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RICLR</name>
							<description>SCON.RI Clear Flag</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No Clear</name>
									<description>RI Flag is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<description>RI Flag is cleared.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
	</peripherals>
</device>
